
_detalhes_global = {
	["ask_to_erase_frame"] = {
		["scale"] = 1,
		["position"] = {
		},
	},
	["boss_icon_cache"] = {
	},
	["encounter_spell_pool"] = {
		{
			1064, -- [1]
			"Глубток", -- [2]
		}, -- [1]
		[55964] = {
			213, -- [1]
			"Принц Талдарам", -- [2]
		},
		[90555] = {
			1060, -- [1]
			"\"Капитан\" Пирожок", -- [2]
		},
		[57781] = {
			215, -- [1]
			"Странное видение", -- [2]
		},
		[90603] = {
			1060, -- [1]
			"\"Капитан\" Пирожок", -- [2]
		},
		[32409] = {
			545, -- [1]
			"[*] Слово Тьмы: Смерть", -- [2]
		},
		[48920] = {
			373, -- [1]
			"Король Дред", -- [2]
		},
		[93520] = {
			1072, -- [1]
			"Лорд Годфри", -- [2]
		},
		[54801] = {
			385, -- [1]
			"Элементаль Дракарри", -- [2]
		},
		[88484] = {
			1063, -- [1]
			"Врагорез-5000", -- [2]
		},
		[91050] = {
			1064, -- [1]
			"Огр-телохранитель", -- [2]
		},
		[90556] = {
			1060, -- [1]
			"\"Капитан\" Пирожок", -- [2]
		},
		[55104] = {
			387, -- [1]
			"Мураби", -- [2]
		},
		[90604] = {
			1060, -- [1]
			"\"Капитан\" Пирожок", -- [2]
		},
		[57941] = {
			215, -- [1]
			"Глашатай Волаж", -- [2]
		},
		[57949] = {
			215, -- [1]
			"Глашатай Волаж", -- [2]
		},
		[67718] = {
			340, -- [1]
			"Черный рыцарь", -- [2]
		},
		[47765] = {
			520, -- [1]
			"[*] Гравитационный колодец", -- [2]
		},
		[47773] = {
			520, -- [1]
			"Великая ведунья Телестра", -- [2]
		},
		[56969] = {
			520, -- [1]
			"Лазурный чешуеплет", -- [2]
		},
		[42705] = {
			575, -- [1]
			"Ингвар Расхититель", -- [2]
		},
		[34298] = {
			1947, -- [1]
			"Коготь", -- [2]
		},
		[88501] = {
			1063, -- [1]
			"Врагорез-5000", -- [2]
		},
		[90557] = {
			1060, -- [1]
			"\"Капитан\" Пирожок", -- [2]
		},
		[51917] = {
			369, -- [1]
			"Вурдалак-мучитель", -- [2]
		},
		[90605] = {
			1060, -- [1]
			"\"Капитан\" Пирожок", -- [2]
		},
		[88836] = {
			1062, -- [1]
			"Адмирал Терзающий Рев", -- [2]
		},
		[93697] = {
			1073, -- [1]
			"Лорд Вальден", -- [2]
		},
		[67719] = {
			340, -- [1]
			"Черный рыцарь", -- [2]
		},
		[49678] = {
			369, -- [1]
			"Вурдалак-мучитель", -- [2]
		},
		[67751] = {
			340, -- [1]
			"Черный рыцарь", -- [2]
		},
		[49710] = {
			373, -- [1]
			"Потрошитель Драккари", -- [2]
		},
		[33661] = {
			369, -- [1]
			"Восставший воин Драккари", -- [2]
		},
		[55599] = {
			387, -- [1]
			"Целитель Драккари", -- [2]
		},
		[57647] = {
			215, -- [1]
			"Странное видение", -- [2]
		},
		[57655] = {
			215, -- [1]
			"Странное видение", -- [2]
		},
		[47981] = {
			524, -- [1]
			"Орморок Воспитатель Дерев", -- [2]
		},
		[56149] = {
			212, -- [1]
			"Ан'кахарский страж", -- [2]
		},
		[49527] = {
			375, -- [1]
			"Пророк Тарон'джа", -- [2]
		},
		[51336] = {
			528, -- [1]
			"Дракос Дознаватель", -- [2]
		},
		[34267] = {
			1945, -- [1]
			"Газ'ан", -- [2]
		},
		[89252] = {
			1060, -- [1]
			"\"Капитан\" Пирожок", -- [2]
		},
		[91053] = {
			1064, -- [1]
			"Огр-телохранитель", -- [2]
		},
		[88009] = {
			1064, -- [1]
			"Глубток", -- [2]
		},
		[49639] = {
			369, -- [1]
			"Кровотролль", -- [2]
		},
		[88169] = {
			1064, -- [1]
			"Глубток", -- [2]
		},
		[49703] = {
			369, -- [1]
			"Гнусный изрыгатель", -- [2]
		},
		[54819] = {
			385, -- [1]
			"Элементаль Дракарри", -- [2]
		},
		[55847] = {
			369, -- [1]
			"Восставший энергетический маг Драккари", -- [2]
		},
		[31704] = {
			1948, -- [1]
			"Черная Охотница", -- [2]
		},
		[55098] = {
			387, -- [1]
			"Мураби", -- [2]
		},
		[56891] = {
			214, -- [1]
			"Джедога Искательница Теней", -- [2]
		},
		[31717] = {
			1948, -- [1]
			"Черная Охотница", -- [2]
		},
		[31429] = {
			1947, -- [1]
			"Коготь", -- [2]
		},
		[88839] = {
			1062, -- [1]
			"Адмирал Терзающий Рев", -- [2]
		},
		[47743] = {
			522, -- [1]
			"Аномалус", -- [2]
		},
		[47751] = {
			522, -- [1]
			"Аномалус", -- [2]
		},
		[67722] = {
			340, -- [1]
			"Черный рыцарь", -- [2]
		},
		[55927] = {
			213, -- [1]
			"Огненная сфера", -- [2]
		},
		[87899] = {
			1064, -- [1]
			"Глубток", -- [2]
		},
		[34268] = {
			1945, -- [1]
			"Газ'ан", -- [2]
		},
		[31946] = {
			1947, -- [1]
			"Владыка болот Мусел'ек", -- [2]
		},
		[55959] = {
			213, -- [1]
			"Принц Талдарам", -- [2]
		},
		[31615] = {
			1947, -- [1]
			"Владыка болот Мусел'ек", -- [2]
		},
		[31547] = {
			1947, -- [1]
			"Владыка болот Мусел'ек", -- [2]
		},
		[36093] = {
			369, -- [1]
			"Восставший воин Драккари", -- [2]
		},
		[88521] = {
			1063, -- [1]
			"Врагорез-5000", -- [2]
		},
		[15530] = {
			524, -- [1]
			"Лазурный волхв", -- [2]
		},
		[22907] = {
			1947, -- [1]
			"Владыка болот Мусел'ек", -- [2]
		},
		[55250] = {
			390, -- [1]
			"Гал'дара", -- [2]
		},
		[93685] = {
			1071, -- [1]
			"Командир Спрингвейл", -- [2]
		},
		[15716] = {
			1945, -- [1]
			"Газ'ан", -- [2]
		},
		[91677] = {
			1072, -- [1]
			"Пустулезное чудовище", -- [2]
		},
		[34290] = {
			1945, -- [1]
			"Газ'ан", -- [2]
		},
		[68504] = {
			334, -- [1]
			"Маршал Якоб Алерий", -- [2]
		},
		[32065] = {
			1946, -- [1]
			"Болотоход", -- [2]
		},
		[34874] = {
			1946, -- [1]
			"Топеглад", -- [2]
		},
		[55249] = {
			390, -- [1]
			"Гал'дара", -- [2]
		},
		[55218] = {
			390, -- [1]
			"Гал'дара", -- [2]
		},
		[16346] = {
			369, -- [1]
			"Гнусный изрыгатель", -- [2]
		},
		[88490] = {
			1063, -- [1]
			"Врагорез-5000", -- [2]
		},
		[8599] = {
			526, -- [1]
			"Керистраза", -- [2]
		},
		[88522] = {
			1063, -- [1]
			"Врагорез-5000", -- [2]
		},
		[66863] = {
			338, -- [1]
			"Эдрик Чистый", -- [2]
		},
		[54970] = {
			383, -- [1]
			"Слад'ран", -- [2]
		},
		[58693] = {
			545, -- [1]
			"Синигоса", -- [2]
		},
		[55633] = {
			385, -- [1]
			"Голем Драккари", -- [2]
		},
		[87896] = {
			1064, -- [1]
			"Глубток", -- [2]
		},
		[57952] = {
			215, -- [1]
			"[*] Трепет", -- [2]
		},
		[67724] = {
			340, -- [1]
			"Черный рыцарь", -- [2]
		},
		[66935] = {
			338, -- [1]
			"Эдрик Чистый", -- [2]
		},
		[87901] = {
			1064, -- [1]
			"Глубток", -- [2]
		},
		[93527] = {
			1073, -- [1]
			"Лорд Вальден", -- [2]
		},
		[54850] = {
			385, -- [1]
			"Колосс Драккари", -- [2]
		},
		[46202] = {
			369, -- [1]
			"Плотоядный вурдалак", -- [2]
		},
		[55968] = {
			213, -- [1]
			"Принц Талдарам", -- [2]
		},
		[57657] = {
			215, -- [1]
			"Странное видение", -- [2]
		},
		[42724] = {
			575, -- [1]
			"Ингвар Расхититель", -- [2]
		},
		[55106] = {
			387, -- [1]
			"Мураби", -- [2]
		},
		[48095] = {
			526, -- [1]
			"[*] Лютый холод", -- [2]
		},
		[88300] = {
			1065, -- [1]
			"Болванчик", -- [2]
		},
		[66862] = {
			338, -- [1]
			"Эдрик Чистый", -- [2]
		},
		[93687] = {
			1071, -- [1]
			"Командир Спрингвейл", -- [2]
		},
		[89652] = {
			1064, -- [1]
			"Огр-надзиратель", -- [2]
		},
		[47958] = {
			524, -- [1]
			"Орморок Воспитатель Дерев", -- [2]
		},
		[67725] = {
			340, -- [1]
			"Черный рыцарь", -- [2]
		},
		[53463] = {
			375, -- [1]
			"Пророк Тарон'джа", -- [2]
		},
		[90559] = {
			1060, -- [1]
			"\"Капитан\" Пирожок", -- [2]
		},
		[67749] = {
			340, -- [1]
			"Воскрешенный Джерен Верный Солнцу", -- [2]
		},
		[57942] = {
			215, -- [1]
			"Глашатай Волаж", -- [2]
		},
		[89735] = {
			1060, -- [1]
			"Испорченная кукуруза", -- [2]
		},
		[93505] = {
			1073, -- [1]
			"Лорд Вальден", -- [2]
		},
		[47944] = {
			524, -- [1]
			"[*] Кристальный шип", -- [2]
		},
		[57784] = {
			215, -- [1]
			"Странное видение", -- [2]
		},
		[90560] = {
			1060, -- [1]
			"\"Капитан\" Пирожок", -- [2]
		},
		[1604] = {
			334, -- [1]
			"Лана Твердомолот", -- [2]
		},
		[57648] = {
			215, -- [1]
			"Странное видение", -- [2]
		},
		[47729] = {
			520, -- [1]
			"Великая ведунья Телестра", -- [2]
		},
		[47737] = {
			522, -- [1]
			"Хаотический разлом <Аномалус>", -- [2]
		},
		[49537] = {
			375, -- [1]
			"Пророк Тарон'джа", -- [2]
		},
		[48849] = {
			373, -- [1]
			"Король Дред", -- [2]
		},
		[48016] = {
			524, -- [1]
			"Орморок Воспитатель Дерев", -- [2]
		},
		[414207] = {
			369, -- [1]
			"Восставший воин Драккари", -- [2]
		},
		[48287] = {
			383, -- [1]
			"Слад'ран", -- [2]
		},
		[67774] = {
			340, -- [1]
			"Воскрешенный Джерен Верный Солнцу", -- [2]
		},
		[7074] = {
			1071, -- [1]
			"Стенающий охранник", -- [2]
		},
		[47688] = {
			522, -- [1]
			"Хаотический разлом <Аномалус>", -- [2]
		},
		[49544] = {
			375, -- [1]
			"Пророк Тарон'джа", -- [2]
		},
		[49528] = {
			375, -- [1]
			"Пророк Тарон'джа", -- [2]
		},
		[55220] = {
			390, -- [1]
			"Дух люторога <Гал'дара>", -- [2]
		},
		[49618] = {
			369, -- [1]
			"Кровотролль", -- [2]
		},
		[48096] = {
			526, -- [1]
			"Керистраза", -- [2]
		},
		[50997] = {
			526, -- [1]
			"Керистраза", -- [2]
		},
		[57802] = {
			215, -- [1]
			"Странное видение", -- [2]
		},
		[93581] = {
			1069, -- [1]
			"Барон Эшбери", -- [2]
		},
		[50933] = {
			369, -- [1]
			"Плотоядный вурдалак", -- [2]
		},
		[55276] = {
			390, -- [1]
			"Гал'дара", -- [2]
		},
		[66867] = {
			338, -- [1]
			"Эдрик Чистый", -- [2]
		},
		[55635] = {
			385, -- [1]
			"Голем Драккари", -- [2]
		},
		[48017] = {
			524, -- [1]
			"Орморок Воспитатель Дерев", -- [2]
		},
		[48400] = {
			571, -- [1]
			"Ледяная могила", -- [2]
		},
		[68301] = {
			334, -- [1]
			"Маршал Якоб Алерий", -- [2]
		},
		[48583] = {
			573, -- [1]
			"Скарвальд Строитель", -- [2]
		},
		[67823] = {
			340, -- [1]
			"Черный рыцарь", -- [2]
		},
		[88288] = {
			1065, -- [1]
			"Болванчик", -- [2]
		},
		[49380] = {
			369, -- [1]
			"Кровотролль", -- [2]
		},
		[47747] = {
			522, -- [1]
			"Аномалус", -- [2]
		},
		[50774] = {
			528, -- [1]
			"Дракос Дознаватель", -- [2]
		},
		[48878] = {
			373, -- [1]
			"Король Дред", -- [2]
		},
		[43650] = {
			573, -- [1]
			"Далронн Контролирующий", -- [2]
		},
		[54878] = {
			385, -- [1]
			"Элементаль Дракарри", -- [2]
		},
		[56926] = {
			214, -- [1]
			"Джедога Искательница Теней", -- [2]
		},
		[55636] = {
			385, -- [1]
			"Голем Драккари", -- [2]
		},
		[49037] = {
			371, -- [1]
			"Новос Призыватель", -- [2]
		},
		[49555] = {
			369, -- [1]
			"Кровотролль", -- [2]
		},
		[58688] = {
			545, -- [1]
			"Синигоса", -- [2]
		},
		[48894] = {
			369, -- [1]
			"Шаман Драккари", -- [2]
		},
		[50089] = {
			371, -- [1]
			"Новос Призыватель", -- [2]
		},
		[67808] = {
			340, -- [1]
			"Черный рыцарь", -- [2]
		},
		[87874] = {
			1064, -- [1]
			"Глубток", -- [2]
		},
		[88495] = {
			1063, -- [1]
			"Врагорез-5000", -- [2]
		},
		[49356] = {
			375, -- [1]
			"Пророк Тарон'джа", -- [2]
		},
		[54719] = {
			385, -- [1]
			"Колосс Драккари", -- [2]
		},
		[37132] = {
			524, -- [1]
			"Лазурный волхв", -- [2]
		},
		[23224] = {
			1070, -- [1]
			"Барон Сильверлейн", -- [2]
		},
		[93675] = {
			1072, -- [1]
			"Лорд Годфри", -- [2]
		},
		[93691] = {
			1071, -- [1]
			"[*] Осквернение", -- [2]
		},
		[93707] = {
			1072, -- [1]
			"Лорд Годфри", -- [2]
		},
		[93468] = {
			1069, -- [1]
			"Барон Эшбери", -- [2]
		},
		[88129] = {
			1064, -- [1]
			"Глубток", -- [2]
		},
		[67745] = {
			340, -- [1]
			"Черный рыцарь", -- [2]
		},
		[67761] = {
			340, -- [1]
			"Черный рыцарь", -- [2]
		},
		[88177] = {
			1064, -- [1]
			"Глубток", -- [2]
		},
		[50759] = {
			528, -- [1]
			"Нестабильная сфера", -- [2]
		},
		[88974] = {
			1065, -- [1]
			"Бомба-липучка", -- [2]
		},
		[57628] = {
			215, -- [1]
			"Странное видение", -- [2]
		},
		[89739] = {
			1060, -- [1]
			"\"Капитан\" Пирожок", -- [2]
		},
		[47699] = {
			522, -- [1]
			"Кристаллический хранитель", -- [2]
		},
		[54847] = {
			385, -- [1]
			"Элементаль Дракарри", -- [2]
		},
		[56130] = {
			212, -- [1]
			"Старейшина Надокс", -- [2]
		},
		[47723] = {
			520, -- [1]
			"Великая ведунья Телестра", -- [2]
		},
		[43651] = {
			573, -- [1]
			"Скарвальд Строитель", -- [2]
		},
		[33833] = {
			520, -- [1]
			"Безумный призрак маны", -- [2]
		},
		[43667] = {
			571, -- [1]
			"Принц Келесет", -- [2]
		},
		[87859] = {
			1064, -- [1]
			"Глубток", -- [2]
		},
		[49548] = {
			375, -- [1]
			"Пророк Тарон'джа", -- [2]
		},
		[55931] = {
			213, -- [1]
			"Принц Талдарам", -- [2]
		},
		[22686] = {
			373, -- [1]
			"Король Дред", -- [2]
		},
		[67778] = {
			340, -- [1]
			"Черный рыцарь", -- [2]
		},
		[47731] = {
			520, -- [1]
			"Великая ведунья Телестра", -- [2]
		},
		[93424] = {
			1069, -- [1]
			"[*] Удушить", -- [2]
		},
		[88481] = {
			1063, -- [1]
			"Врагорез-5000", -- [2]
		},
		[50155] = {
			526, -- [1]
			"Керистраза", -- [2]
		},
		[48082] = {
			524, -- [1]
			"Кристаллический хлестун", -- [2]
		},
		[93629] = {
			1072, -- [1]
			"Лорд Годфри", -- [2]
		},
		[48873] = {
			373, -- [1]
			"Король Дред", -- [2]
		},
		[7054] = {
			1071, -- [1]
			"Замученный офицер", -- [2]
		},
		[13738] = {
			373, -- [1]
			"Смертехват Драккари", -- [2]
		},
		[42730] = {
			575, -- [1]
			"Ингвар Расхититель", -- [2]
		},
		[48895] = {
			369, -- [1]
			"Шаман Драккари", -- [2]
		},
		[49668] = {
			371, -- [1]
			"Хрустальный укротитель", -- [2]
		},
		[67731] = {
			340, -- [1]
			"[*] Отсрочка смерти", -- [2]
		},
		[50378] = {
			369, -- [1]
			"Воскреситель из Плети", -- [2]
		},
		[49805] = {
			369, -- [1]
			"Воскреситель из Плети", -- [2]
		},
		[52067] = {
			524, -- [1]
			"Кристаллический хлестун", -- [2]
		},
		[47668] = {
			369, -- [1]
			"Страж Драккари", -- [2]
		},
		[68321] = {
			334, -- [1]
			"Маршал Якоб Алерий", -- [2]
		},
		[57629] = {
			215, -- [1]
			"Странное видение", -- [2]
		},
		[89263] = {
			1060, -- [1]
			"\"Капитан\" Пирожок", -- [2]
		},
		[55605] = {
			383, -- [1]
			"Непреклонный душитель", -- [2]
		},
		[42729] = {
			575, -- [1]
			"Ингвар Расхититель", -- [2]
		},
		[67781] = {
			340, -- [1]
			"[*] Осквернение", -- [2]
		},
		[90602] = {
			1060, -- [1]
			"\"Капитан\" Пирожок", -- [2]
		},
		[93423] = {
			1069, -- [1]
			"Барон Эшбери", -- [2]
		},
		[49637] = {
			369, -- [1]
			"Кровотролль", -- [2]
		},
		[47748] = {
			522, -- [1]
			"Аномалус", -- [2]
		},
		[87861] = {
			1064, -- [1]
			"Глубток", -- [2]
		},
		[49034] = {
			371, -- [1]
			"Новос Призыватель", -- [2]
		},
		[90047] = {
			1064, -- [1]
			"Заклинательница из Братства Справедливости", -- [2]
		},
		[93857] = {
			1070, -- [1]
			"Барон Сильверлейн", -- [2]
		},
		[93535] = {
			1073, -- [1]
			"Лорд Вальден", -- [2]
		},
		[58690] = {
			545, -- [1]
			"Синигоса", -- [2]
		},
		[43649] = {
			573, -- [1]
			"Далронн Контролирующий", -- [2]
		},
	},
	["immersion_pets_on_solo_play"] = false,
	["npcid_ignored"] = {
	},
	["dungeon_data"] = {
	},
	["report_pos"] = {
		1, -- [1]
		1, -- [2]
	},
	["latest_report_table"] = {
	},
	["exp90temp"] = {
		["delete_damage_TCOB"] = true,
	},
	["always_use_profile"] = false,
	["deathlog_healingdone_min_arena"] = 400,
	["spell_school_cache"] = {
		["Удар грома"] = 8,
		["Хватай за горло!"] = 1,
		["Жатва"] = 1,
		["Ледяные кулаки"] = 16,
		["Перегрызание глотки"] = 1,
		["Поганочное гниение"] = 8,
		["Выброс лавы"] = 4,
		["Головокружение"] = 1,
		["Ледяное дыхание"] = 16,
		["Пылающие кулаки"] = 4,
		["Пропитывание колдунством"] = 8,
		["Глубокая рана"] = 1,
		["Ближний бой"] = 1,
		["Озноб"] = 16,
		["Взрыв тела"] = 8,
		["Казнь"] = 1,
		["Ледяной цветок"] = 16,
		["Лютый холод"] = 16,
		["Гниение плоти"] = 1,
		["Кровопускание"] = 1,
		["Сияние"] = 2,
		["Выстрел"] = 1,
		["Коварный удар"] = 1,
		["Правой, левой"] = 1,
		["Чародейский разряд"] = 64,
		["Болезнетворное облако"] = 8,
		["Кислотный плевок"] = 8,
		["Воспламенение"] = 4,
		["Кристальный шип"] = 1,
		["Отсрочка смерти"] = 32,
		["Обращение в бегство"] = 1,
		["Трепка"] = 1,
		["Тень Бездны"] = 32,
		["Разящий удар"] = 1,
		["Обжигающий луч"] = 4,
		["Победный раж"] = 1,
		["Удар жнеца"] = 1,
		["Удушить"] = 1,
		["Град амулетов"] = 8,
		["Осквернение"] = 32,
		["Форсаж"] = 1,
		["Кровавая чума"] = 32,
		["Гравитационный колодец"] = 32,
		["Широкий взмах"] = 1,
		["Corpo-a-Corpo"] = 1,
		["Ледяные осколки"] = 16,
		["Желчная рвота"] = 8,
		["Трепет"] = 32,
		["Ледяная могила"] = 16,
		["Слово Тьмы: Смерть"] = 32,
		["Рывок"] = 1,
		["Взрыв сферы"] = 64,
		["Вихревой удар"] = 1,
		["Мощный удар"] = 1,
		["Апперкот"] = 1,
		["Призыв Молота Ужаса"] = 1,
		["Молния"] = 8,
		["Удар героя"] = 1,
		["Превосходство"] = 1,
		["Отложенная расправа"] = 2,
		["Смертельный яд"] = 8,
		["Сокрушение"] = 1,
		["Пустулезный плевок"] = 8,
		["Пламенный клинок"] = 4,
	},
	["deathlog_healingdone_min"] = 1,
	["damage_scroll_auto_open"] = true,
	["show_warning_id1_amount"] = 0,
	["latest_shield_spellid_cache_access"] = 1715417907,
	["current_exp_raid_encounters"] = {
	},
	["keystone_frame"] = {
		["scale"] = 1,
		["position"] = {
		},
	},
	["show_aug_predicted_spell_damage"] = false,
	["trinket_data"] = {
	},
	["global_plugin_database"] = {
	},
	["savedCustomSpells"] = {
		{
			6, -- [1]
			"Мир (огонь)", -- [2]
			"Interface\\ICONS\\INV_SummerFest_FireSpirit", -- [3]
		}, -- [1]
		{
			2, -- [1]
			"Автоматическая стрельба", -- [2]
			"Interface\\ICONS\\INV_Weapon_Bow_07", -- [3]
		}, -- [2]
		{
			8, -- [1]
			"Мир (слизь)", -- [2]
			"Interface\\ICONS\\Ability_Creature_Poison_02", -- [3]
		}, -- [3]
		{
			3, -- [1]
			"Мир (падение)", -- [2]
			"Interface\\ICONS\\Spell_Magic_FeatherFall", -- [3]
		}, -- [4]
		{
			1, -- [1]
			"Ближний бой", -- [2]
			"Interface\\ICONS\\INV_Sword_04", -- [3]
		}, -- [5]
		{
			4, -- [1]
			"Мир (утопление)", -- [2]
			"Interface\\ICONS\\Ability_Suffocate", -- [3]
		}, -- [6]
		{
			5, -- [1]
			"Мир (усталость)", -- [2]
			"Interface\\ICONS\\Spell_Arcane_MindMastery", -- [3]
		}, -- [7]
		{
			7, -- [1]
			"Мир (лава)", -- [2]
			"Interface\\ICONS\\Ability_Rhyolith_Volcano", -- [3]
		}, -- [8]
	},
	["keystone_cache"] = {
	},
	["breakdown_spell_tab"] = {
		["nest_players_spells_with_same_name"] = true,
		["spellcontainer_height"] = 311,
		["blockspell_height"] = 67,
		["blockspell_backgroundcolor"] = {
			0.05, -- [1]
			0.05, -- [2]
			0.05, -- [3]
			0.2, -- [4]
		},
		["phasecontainer_islocked"] = true,
		["blockspell_spark_color"] = {
			1, -- [1]
			1, -- [2]
			1, -- [3]
			0.7, -- [4]
		},
		["blockcontainer_width"] = 455.9998779296875,
		["genericcontainer_width"] = 429,
		["spellcontainer_width"] = 429.0000915527344,
		["spellcontainer_header_fontcolor"] = {
			1, -- [1]
			1, -- [2]
			1, -- [3]
			1, -- [4]
		},
		["phasecontainer_height"] = 140.0000305175781,
		["phasecontainer_enabled"] = true,
		["genericcontainer_headers_right"] = {
		},
		["phasecontainer_width"] = 290.0000305175781,
		["phasecontainer_headers"] = {
		},
		["blockspell_bordercolor"] = {
			0, -- [1]
			0, -- [2]
			0, -- [3]
			0.7, -- [4]
		},
		["spellcontainer_islocked"] = true,
		["nest_pet_spells_by_caster"] = true,
		["targetcontainer_headers"] = {
		},
		["targetcontainer_islocked"] = true,
		["blockspell_spark_width"] = 4,
		["spellbar_background_alpha"] = 0.92,
		["blockcontainer_height"] = 270.0000610351563,
		["statusbar_background_color"] = {
			0.15, -- [1]
			0.15, -- [2]
			0.15, -- [3]
		},
		["genericcontainer_right_width"] = 403,
		["blockspell_color"] = {
			0.6, -- [1]
			0.6, -- [2]
			0.6, -- [3]
			0.55, -- [4]
		},
		["blockspell_spark_show"] = true,
		["spellcontainer_header_fontsize"] = 10,
		["blockcontainer_islocked"] = true,
		["blockspell_padding"] = 5,
		["targetcontainer_width"] = 429.0000915527344,
		["blockspell_spark_offset"] = -1,
		["genericcontainer_islocked"] = true,
		["genericcontainer_right_height"] = 460,
		["nest_pet_spells_by_name"] = false,
		["targetcontainer_height"] = 140.0000305175781,
		["statusbar_alpha"] = 0.7,
		["genericcontainer_enabled"] = true,
		["genericcontainer_headers"] = {
		},
		["spellcontainer_header_height"] = 20,
		["statusbar_background_alpha"] = 0.7,
		["spellcontainer_headers"] = {
		},
		["statusbar_texture"] = "Interface\\AddOns\\Details\\images\\bar_skyline",
		["genericcontainer_height"] = 481,
	},
	["always_use_profile_name"] = "",
	["profile_by_spec"] = {
	},
	["combat_id_global"] = 2142,
	["displays_by_spec"] = {
	},
	["plugin_window_pos"] = {
		["y"] = -3.814697265625e-06,
		["x"] = 9.1552734375e-05,
		["point"] = "CENTER",
		["scale"] = 1,
	},
	["userCustomSpells"] = {
	},
	["last_changelog_size"] = 22625,
	["immersion_unit_special_icons"] = true,
	["lastUpdateWarning"] = 1716203898,
	["npcid_pool"] = {
		[0] = "[*] Взрыв",
		[26607] = "Ануб'арский гнилостный зверь",
		[26639] = "Шаман Драккари",
		[26735] = "Лазурный чешуеплет",
		[35095] = "Разведчик с заставы Талрендис",
		[30893] = "Хранитель портала",
		[1557] = "Старая горилла из Мглистой долины",
		[6232] = "Волшебный обнулятор X-21",
		[1561] = "Налетчик из шайки Кровавого Паруса",
		[1563] = "Сорвиголова из шайки Кровавого Паруса",
		[1565] = "Морской волк из шайки Кровавого Паруса",
		[33688] = "Гневный древень",
		[4273] = "Хранитель Ордан",
		[4289] = "Вызыватель из Алого ордена",
		[4297] = "Окудник из Алого ордена",
		[25392] = "Верховный жрец Андорат",
		[4329] = "Огнегривый разведчик",
		[27567] = "Капитан Искандар",
		[6392] = "Медик зоны",
		[27631] = "Ангратарская аберрация",
		[38998] = "Землекоп из Лиги исследователей",
		[34968] = "Часовой Когтистых гор",
		[47314] = "Бомба-липучка",
		[4393] = "Кислотный болотный слизнюк",
		[37207] = "Равнинный хозяин стаи",
		[23953] = "Принц Келесет",
		[8958] = "Злобнопалый изверг",
		[3269] = "Геомант племени Иглогривых",
		[30286] = "Стужень",
		[48338] = "Разносчица напитков",
		[30414] = "Позабытый",
		[38359] = "Воин Вайш'элана",
		[26448] = "Часовой Покоя Звезд",
		[42901] = "Смотритель выводка из племени Порочной Ветви",
		[26608] = "Король подземелий Ануб'ет'кан",
		[417] = "Неизвестно",
		[34969] = "Зараженный часовой",
		[26800] = "Берсерк Альянса",
		[4673] = "Предатель из племени Ярой Ненависти",
		[24849] = "Всадник на протодраконе",
		[35545] = "Воскрешенный Джерен Верный Солнцу",
		[4713] = "Воин из клана Скользящего Плавника",
		[1693] = "Озерный кроколиск",
		[11517] = "Огглфлинт",
		[50258] = "Исполин Ледяного Молота",
		[1713] = "Старая тенебрюхая пантера",
		[4809] = "Сумеречный послушник",
		[25393] = "Вурдалак из Эн'кила",
		[4825] = "Хрустогрыз Аку'мая",
		[25489] = "Самец шерстистого люторога",
		[4849] = "Тенегорнский археолог",
		[27600] = "Восставший темный чародей",
		[25585] = "Берилловый охотник на магов",
		[39384] = "Зараженный дракончик",
		[23954] = "Ингвар Расхититель",
		[4977] = "Мелководный хрупопанцирник",
		[39896] = "Йети со Свирепого Утеса",
		[24082] = "Укротитель протодраконов",
		[30287] = "Бесчинствующий упырь",
		[30319] = "Сумеречный черный маг",
		[26257] = "Колдун Волноловов",
		[7112] = "Джеденарский сектант",
		[7120] = "Джеденарский чернокнижник",
		[26449] = "Геймел Жестокий",
		[26481] = "Вожак магнатавров",
		[38809] = "Мальмо",
		[24562] = "Неруб'арский захватчик",
		[26641] = "Потрошитель Драккари",
		[26705] = "Послушник снежных равнин",
		[26737] = "Безумный манаплеск",
		[39193] = "Громила-надзиратель",
		[39449] = "Наемник Южных морей",
		[26929] = "Существо",
		[1815] = "Больной черный медведь",
		[3637] = "Загадочный страж",
		[5249] = "Полукровка из стаи Древолапов",
		[35995] = "Удушающая лиана",
		[3669] = "Лорд Кобран",
		[3673] = "Лорд Серпентис",
		[25522] = "Скадирский налетчик",
		[38810] = "Телох",
		[29680] = "Слад'ранская гадюка",
		[3717] = "Колдунья из клана Зловещего Хвоста",
		[3721] = "Гидра-тайнохлыст",
		[25682] = "Лич-Лорд Хладолют",
		[27761] = "Боевой скакун из Крепости Фордрагона",
		[39194] = "Вспыхомрак Глава Громил",
		[3745] = "Землепроходец из племени Гиблой Чащи",
		[28017] = "Кровавый червь",
		[24019] = "Ледион",
		[8959] = "Волк-сквернолап",
		[24083] = "Порабощенный протодракон",
		[475] = "Кобольд-проходчик",
		[30416] = "Укрощенный элементаль огня",
		[1907] = "Нага-исследователь",
		[3821] = "Терновый паук",
		[26482] = "Полярный гризли",
		[9167] = "Бесноватый терродактиль",
		[3833] = "Кенарийский воздаятель",
		[38811] = "Устанский охотник за скальпами",
		[24563] = "Неруб'арский ядоплюй",
		[26674] = "Темнопутый детеныш",
		[26770] = "Тивакс Разрушитель",
		[26802] = "Следопыт Альянса",
		[43417] = "Небогривый шимпанзе",
		[3873] = "Замученный офицер",
		[3877] = "Стенающий охранник",
		[35613] = "Тонконюхий брюхач",
		[7800] = "Анжинер Термоштепсель",
		[5761] = "Загадочный шаркун",
		[48279] = "Гоблин-надсмотрщик",
		[25203] = "Глрггл",
		[25427] = "Каганишу",
		[25523] = "Скадирский моряк",
		[47064] = "Похититель из племени Моходеров",
		[25619] = "Неруб'арский воин",
		[3977] = "Верховный инквизитор Вайтмейн",
		[25715] = "Застывший элементаль",
		[35294] = "Бунтующий тролль",
		[5977] = "Изверг из клана Молота Ужаса",
		[5985] = "Хохочущая гиена",
		[23956] = "Стратег из клана Укротителей драконов",
		[6009] = "Ткач ужаса из культа Приверженцев Тени",
		[6017] = "Тотем лавы <Оракул из племени Каменного Свода>",
		[24084] = "Туннельный вурдалак",
		[4053] = "Дочь Кенария",
		[30385] = "Сумеречный доброволец",
		[48664] = "Обреченный дух",
		[26451] = "Рагнар Драккарлунд",
		[26483] = "Глодатель драконьих костей",
		[26643] = "Бешеный гризли",
		[41116] = "Стализвон <Келси Стализвон>",
		[37086] = "Зубастый падальщик",
		[26771] = "Синок Ярость Тени",
		[6193] = "Крикунья из клана Бича Злобы",
		[30961] = "Лазурный захватчик",
		[6225] = "Механотанк",
		[6233] = "Механический караульный",
		[525] = "Валерчик",
		[29266] = "Ксевозз",
		[25204] = "Косатка Мерцающей бухты",
		[44315] = "Иссохший маг",
		[6329] = "Облученный погромщик",
		[4290] = "Охранник Алого ордена",
		[4298] = "Защитник из Алого ордена",
		[25396] = "Наксанарский маг-скелет",
		[25428] = "Магмот-шаман",
		[27539] = "Хладный некромант",
		[46938] = "Молдарр",
		[27635] = "Лазурный чароплет",
		[4378] = "Паук-отшельник Мглистой пещеры",
		[29874] = "Поджигатель Драккари",
		[27859] = "Вантрин Безжалостный",
		[4442] = "Защитник из племени Иглошкурых",
		[4458] = "Охотник из племени Черножабрых",
		[6521] = "Живое пламя",
		[8960] = "Падальщик-сквернолап",
		[24085] = "Надзиратель из клана Укротителей драконов",
		[4514] = "Разъяренный агам'ар",
		[4522] = "Пылеткач из племени Иглошкурых",
		[4530] = "Укротитель из племени Иглошкурых",
		[4538] = "Лабиринтовый нетопырь",
		[26452] = "Левирот",
		[11199] = "Пушка Багрового легиона <Трехоньне>",
		[24469] = "Охотница-магнатавр",
		[575] = "Элементаль огня",
		[47131] = "Яростный упырь",
		[26676] = "Ануб'арский захватчик",
		[4666] = "Скверноподданный из клана Пылающего Клинка",
		[4674] = "Тенелов племени Ярой Ненависти",
		[587] = "Воин из племени Кровавого Скальпа",
		[588] = "Разведчик из племени Кровавого Скальпа",
		[4714] = "Мирмидон из клана Скользящего Плавника",
		[11519] = "Баззалан",
		[595] = "Охотник из племени Кровавого Скальпа",
		[29331] = "Сифрельдарская хранительница рун",
		[25333] = "Неумирающий агрессор",
		[4810] = "Сумеречный разоритель",
		[4818] = "Мурлок из племени Мутной Воды",
		[25429] = "Магмот-добытчик",
		[42718] = "Луна",
		[4850] = "Скрытень из племени Каменного Свода",
		[27604] = "Хрупкое создание",
		[27636] = "Детеныш лазурного дракона",
		[47132] = "Страшный ползун",
		[9776] = "Огненный злопыхатель",
		[45277] = "Часовой Фераласа",
		[27860] = "Лютион Злобный",
		[4978] = "Слуга Аку'мая",
		[7041] = "Черная драконида",
		[2506] = "Горный пехотинец Гарн",
		[628] = "Черный опустошитель",
		[2522] = "Жагуар",
		[30419] = "Укрощенный элементаль воды",
		[7113] = "Джеденарский страж",
		[38753] = "Гоблин-зомби",
		[24566] = "Неруб'арский паук-быстролап",
		[2566] = "Громила из клана Тяжелого Кулака",
		[37090] = "Загадочный страхокус",
		[47389] = "Надсмотрщик улья",
		[26805] = "Священник Альянса",
		[5234] = "Изверг из клана Гордунни",
		[7321] = "Ткач Пламени из племени Каменного Свода",
		[2646] = "Кровопийца из племени Порочной Ветви",
		[7361] = "Грязнюк",
		[667] = "Воин из племени Дробителей Черепов",
		[25430] = "Магмотрегар",
		[669] = "Охотник из племени Дробителей Черепов",
		[670] = "Знахарь из племени Дробителей Черепов",
		[5362] = "Гарпия из стаи Студеных Ключей",
		[672] = "Духолов из племени Дробителей Черепов",
		[29684] = "Тикающая бомба <Стратег из клана Укротителей драконов>",
		[25622] = "Неруб'арский туннельщик",
		[25686] = "Горлок-бормотун",
		[39138] = "Стражник тераморской дороги",
		[678] = "Изверг из клана Мош'Огг",
		[5426] = "Хромоногая гиена",
		[680] = "Вождь Мош'Огг",
		[681] = "Молодой тигр Тернистой долины",
		[682] = "Тигр Тернистой долины",
		[683] = "Молодая пантера",
		[10928] = "Суккуб-прислужница",
		[685] = "Ящер Тернистой долины",
		[686] = "Ящер-кнутохвост",
		[23991] = "Гьялербронский воин",
		[17882] = "Черная Охотница",
		[689] = "Хрустальный василиск",
		[690] = "Ледоглазый василиск",
		[694] = "Метатель топоров из племени Кровавого Скальпа",
		[696] = "Метатель топоров из племени Дробителей Черепов",
		[697] = "Шаман из племени Кровавого Скальпа",
		[698] = "Тигр племени Кровавого Скальпа",
		[699] = "Повелитель зверей из племени Кровавого Скальпа",
		[701] = "Мистик из племени Кровавого Скальпа",
		[702] = "Падальщик из племени Кровавого Скальпа",
		[24567] = "Кобольд-вредитель из логова",
		[47135] = "Смрадный вурдалак",
		[34917] = "Вторгшееся щупальце",
		[39075] = "Ненормий",
		[709] = "Солдат-наемник из клана Мош'Огг",
		[26838] = "Коготь Ужаса",
		[45664] = "Пресноводный окунь",
		[26966] = "Мрачный мучитель",
		[5762] = "Загадочная болотная гадюка",
		[37924] = "Разведчик Степей",
		[48351] = "Разносчица напитков",
		[7849] = "Мобильная охранная система",
		[728] = "Баг'тира",
		[2926] = "Волк",
		[46] = "Мурлок-добытчик",
		[736] = "Пантера",
		[47136] = "Нестабильный опустошитель",
		[25687] = "Горлок-пародув",
		[7977] = "Гаммерита",
		[17723] = "Болотоход",
		[5978] = "Чернокнижник из клана Молота Ужаса",
		[35558] = "Выброс эктоплазмы",
		[23960] = "Заклинатель рун из клана Укротителей драконов",
		[26103] = "Омраченный смертомеч",
		[756] = "Пантера племени Дробителей Черепов",
		[42211] = "Тотем магмы <Бузотер из племени Зловещего Тотема>",
		[6066] = "Хватка земли <Тотемист племени Иглошкурых>",
		[26455] = "Высокорожденный из Садов Лунного Покоя",
		[36774] = "Посланник Серебряного союза",
		[47137] = "Безмозглый ужас",
		[772] = "Тигрица Тернистой долины",
		[39141] = "Командир Арингтон",
		[35111] = "Сбежавший крошшер",
		[6194] = "Змеестраж из клана Бича Злобы",
		[8338] = "Стрелок из клана Черного Железа",
		[3114] = "Боевой страж племени Иглогривых",
		[780] = "Мистик из племени Дробителей Черепов",
		[781] = "Охотник за головами из племени Дробителей Черепов",
		[782] = "Разведчик из племени Дробителей Черепов",
		[33704] = "Хладное поганище",
		[37926] = "Капитан форта Триумфа",
		[48289] = "Миниф",
		[44323] = "Темный магистр Гандлинг",
		[29366] = "Бруннхильдарская ратница",
		[4283] = "Караульный Алого ордена",
		[4291] = "Предсказатель из Алого ордена",
		[4299] = "Капеллан Алого ордена",
		[25432] = "Жена Магмотрегара",
		[6370] = "Клешнекоп макринни",
		[4331] = "Огнегривый пеплохвост",
		[3198] = "Ученик из клана Пылающего Клинка",
		[47138] = "Пустулезное чудовище",
		[4379] = "Паук-шелкопряд Мглистой пещеры",
		[39142] = "Цин Черный Клинок",
		[25752] = "Мусоробот 004-A8",
		[43364] = "Пьяница из шайки Кровавого Паруса",
		[33193] = "Застрельщик Ясеневого леса",
		[4427] = "Страж чертогов",
		[4435] = "Воин племени Иглошкурых",
		[4459] = "Оракул из племени Черножабрых",
		[4515] = "Послушница из племени Мертвой Головы",
		[4523] = "Землетряска из племени Иглошкурых",
		[4531] = "Дрессировщик из племени Иглошкурых",
		[4539] = "Большой лабиринтовый нетопырь",
		[26616] = "Гнилостный марал",
		[24601] = "Паровой яростень",
		[39143] = "Алексий Тихий Вой",
		[35177] = "Налетчик с заставы Талрендис",
		[4675] = "Призыватель огня из племени Ярой Ненависти",
		[13456] = "Порождение Ноксиона <Ноксион>",
		[3374] = "Бейл'данский землечерп",
		[3378] = "Бейл'данский офицер",
		[27064] = "Брошенный топливный бак",
		[29271] = "Бесплотная сфера <Ксевозз>",
		[25209] = "Клаксимус",
		[48419] = "Шахтер из Братства Справедливости",
		[44453] = "Тассариан",
		[4811] = "Сумеречный аквамант",
		[4819] = "Грязекоп из племени Мутной Воды",
		[4827] = "Глубинный крепкозуб",
		[25465] = "Кел'Тузад",
		[38696] = "Ингви",
		[27608] = "Лазурный драконоид",
		[11793] = "Селебрийская дриада",
		[43110] = "Соперник на арене Гурубаши",
		[9778] = "Огненный факельщик",
		[41191] = "Разрушитель из культа Приверженцев Тени",
		[37161] = "Пехотинец Заставы Чести",
		[33195] = "Стрелок Ясеневого леса",
		[27896] = "Супостат из рода Бесконечности",
		[25881] = "Мория",
		[17725] = "Скрытень Нижетопи",
		[26073] = "Верховный жрец Талет-Ка",
		[48420] = "Землекоп из Братства Справедливости",
		[7106] = "Разбойник из племени Нефритового Пламени",
		[42855] = "Дух волка",
		[47141] = "Жуткий провидец",
		[41064] = "Рифогрыз",
		[7226] = "Песчаная буря <Древний каменный хранитель>",
		[35307] = "Жрица Серебряного Авангарда",
		[35371] = "Мариус Танолаар",
		[24954] = "Чумной магнатавр",
		[7290] = "Тенегорнский меткий стрелок",
		[3654] = "Мутанус Пожиратель",
		[48229] = "Кобольд-землекоп",
		[29304] = "Слад'ран",
		[3670] = "Лорд Питонас",
		[3674] = "Шкам",
		[8563] = "Лесник",
		[25434] = "Магмот-сокрушитель",
		[25498] = "Аспата Праматерь",
		[45031] = "Пехотинец крепости Стражей Пустоты",
		[7442] = "Землепроходец из племени Зимней Спячки",
		[47270] = "Гравиус Грязнуля",
		[5419] = "Стеклошкурый василиск",
		[5427] = "Бешеный стертолап",
		[937] = "Партизан Курцена",
		[3750] = "Тотемист из племени Гиблой Чащи",
		[33389] = "Мудрец Колючего Меха",
		[41897] = "Горный пехотинец Дун Морога",
		[48230] = "Огр-надзиратель",
		[26202] = "Защитник зиккурата",
		[44328] = "Защитник Андорала",
		[3810] = "Старый медведь Ясеневого леса",
		[47143] = "Хрупкоребрый скелет",
		[26746] = "Безумный призрак маны",
		[47463] = "Пламенный призрак",
		[3870] = "Каменная соня",
		[35309] = "Светлый воин Серебряного Авангарда",
		[11442] = "Изверг из клана Гордок",
		[27002] = "Гром'тар Громовержец",
		[41898] = "Ружейник Дун Морога",
		[5763] = "Эктоплазма кошмаров",
		[13601] = "Ремонтник Гизлок",
		[46248] = "Крушитель из стаи Речной Лапы",
		[29305] = "Мураби",
		[44329] = "Костяной берсерк",
		[11714] = "Марош Бесчестный",
		[42858] = "Брэддок",
		[3974] = "Псарь Локси",
		[9779] = "Пламенеющий яростень",
		[39148] = "Зумонга",
		[11858] = "Грундиг Темное Облако",
		[27898] = "Хрономаг из рода Бесконечности",
		[17727] = "Караульный из клана Зловещего Плавника",
		[6035] = "Ловчий из племени Иглошкурых",
		[46249] = "Убийца из стаи Речной Лапы",
		[4054] = "Смеющаяся сестра",
		[1016] = "Кнутохвост нагорья",
		[28410] = "Спиритуалист из клана Укротителей драконов",
		[4070] = "Строитель Торговой Компании",
		[34415] = "Жрица клана Темной Чешуи",
		[12258] = "Бритвохлест",
		[40876] = "Келси Стализвон",
		[47145] = "Хрупкоребрый страж",
		[39149] = "Саринекс",
		[30873] = "Загробник огня",
		[45418] = "Грундиг Темное Облако",
		[41388] = "Живое ископаемое",
		[12418] = "Гиена клана Гордок",
		[6219] = "Едкий скрытень",
		[35503] = "Тень Ненависти",
		[27003] = "Дрегмар Рунический Знак",
		[1062] = "Неззилок Зловещий",
		[46250] = "Браконьер из стаи Речной Лапы",
		[29306] = "Гал'дара",
		[27355] = "Ротин Гниющий",
		[4292] = "Заступник из Алого ордена",
		[8596] = "Карликовый чумной пес",
		[4308] = "Освобожденный дух",
		[38574] = "Шаман Умлота",
		[4324] = "Опаляющий дракончик",
		[27611] = "Извергатель чумы",
		[47146] = "Хрупкоребрый свежеватель",
		[25660] = "Гнойный вурдалак",
		[6427] = "Блуждающий фантазм",
		[41389] = "Палеолитический элементаль",
		[35312] = "Саботажник с заставы Талрендис",
		[4428] = "Вестник смерти Джаргба",
		[4436] = "Свиностраж племени Иглошкурых",
		[30106] = "Огненная сфера",
		[32185] = "Искоренитель из рода Бесконечности",
		[26076] = "Верховный жрец Наферсет",
		[33777] = "Гайван Бредущий Тенью",
		[8996] = "Демон Бездны - прислужник",
		[46251] = "Добытчик из стаи Речной Лапы",
		[4516] = "Адепт из племени Мертвой Головы",
		[44332] = "Защитник Андорала",
		[4532] = "Повелитель зверей из племени Иглошкурых",
		[4540] = "Монах Алого ордена",
		[1142] = "Громила из клана Мош'Огг",
		[38575] = "Дикарь Умлота",
		[13282] = "Ноксион",
		[1152] = "Кроколиск-хрустогрыз",
		[26620] = "Страж Драккари",
		[26716] = "Лазурный хранитель",
		[47403] = "Жнец из Братства Справедливости",
		[41390] = "Гнолл из стаи Мохошкуров",
		[11443] = "Огр-маг из клана Гордок",
		[27004] = "Ледохват",
		[46252] = "Шаман из стаи Речной Лапы",
		[29307] = "Колосс Драккари",
		[27356] = "Некролит Пылающих Глубин",
		[38448] = "Безликий из глубин",
		[4820] = "Оракул из племени Мутной Воды",
		[25469] = "Безмозглая абберрация",
		[25501] = "Гаммот Скорбный",
		[4852] = "Оракул из племени Каменного Свода",
		[6907] = "Эрик \"Быстрый\"",
		[29819] = "Пикейщик Драккари",
		[47404] = "Наблюдатель из Братства Справедливости",
		[25789] = "Гаммотра Мучитель",
		[41391] = "Мистик из стаи Мохошкуров",
		[27900] = "Разрыватель времени из рода Бесконечности",
		[17729] = "Копейщик из племени Темной Крови",
		[37553] = "Потревоженный элементаль земли",
		[7011] = "Земельник-камнекрушитель",
		[39728] = "Воин из клана Гребня Ненависти",
		[32186] = "Нарушитель времени из рода Бесконечности",
		[2507] = "Горный пехотинец Утан",
		[46381] = "Изворотливый вор",
		[2523] = "Опаляющий тотем <Владьмир>",
		[12179] = "Истерзанный часовой",
		[2555] = "Знахарь из племени Сухокожих",
		[2559] = "Ящер с нагорья Арати",
		[2563] = "Бодька",
		[2567] = "Волхв из клана Тяжелого Кулака",
		[41072] = "Рубака из клана Драконьей Пасти",
		[41136] = "Душитель из клана Молота Ужаса",
		[2587] = "Налетчик из Синдиката",
		[24830] = "Погромщик из племени Каменного Свода",
		[5236] = "Шаман из клана Гордунни",
		[7291] = "Галганн Огнемолот",
		[35891] = "Секретный агент ШРУ",
		[2635] = "Старый кроколиск-хрустогрыз",
		[46254] = "Дробитель",
		[29308] = "Принц Талдарам",
		[46382] = "Жалкий злоумышленник",
		[8565] = "Разведчик дорог",
		[2667] = "Оберег лености <Знахарь из клана Мош'Огг>",
		[25470] = "Поджигатель из стаи Кровавых Спор",
		[25534] = "Кровавая сфера из Эн'кила",
		[34932] = "Высокорожденный-колдун",
		[25726] = "Вождь Бурблгубль",
		[5420] = "Стеклошкурый взорень",
		[43376] = "Беззаботный Джунц Фитцтютель",
		[30012] = "Дуэлянт-победитель",
		[17826] = "Владыка болот Мусел'ек",
		[7603] = "Прокаженный ассистент",
		[28477] = "Потомок Кетц'лун",
		[26622] = "Нетопырь Драккари",
		[26782] = "Кристаллический хранитель",
		[43377] = "Эфрам \"Кубики\" Закат Луны",
		[27006] = "Расщепитель костей",
		[5756] = "Загадочный крылояд",
		[29309] = "Старейшина Надокс",
		[36149] = "Матрос Альянса",
		[27358] = "Некромант Пылающих Глубин",
		[5844] = "Поработитель из клана Черного Железа",
		[27518] = "Пехотинец из Крепости Фордрагона",
		[7915] = "Ходячая бомба",
		[2951] = "Браконьер из стаи Бледногривов",
		[2959] = "Охотник прерий",
		[39156] = "Телохранитель Двукоссы",
		[33079] = "Мирмидон из клана Темной Чешуи",
		[25791] = "Запятнанный нефтью волк",
		[1488] = "Зомби Занзила",
		[1490] = "Знахарь Занзила",
		[1492] = "Горлаш",
		[1494] = "Неголаш",
		[17827] = "Коготь",
		[30333] = "Душегуб Забытых Глубин",
		[34295] = "Лорд Магматар",
		[32572] = "Охотник на магов Драконьего Погоста",
		[30621] = "Странное видение",
		[24576] = "Мирмидон из клана Терзающего Бича",
		[26655] = "Верховный сектант Зангус",
		[49264] = "Кровояд",
		[33016] = "Тлеющий скелет",
		[1548] = "Проклятый пес тьмы",
		[6196] = "Мирмидон из клана Бича Злобы",
		[6212] = "Посланник клана Черного Железа",
		[6220] = "Облученный ужас",
		[1562] = "Маг из шайки Кровавого Паруса",
		[39733] = "Колдунья из клана Гребня Ненависти",
		[29310] = "Джедога Искательница Теней",
		[4293] = "Провидец Алого ордена",
		[44595] = "Песчаный ползун",
		[17252] = "Дзузугул",
		[46962] = "Барон Эшбери",
		[25600] = "Неживой кабан",
		[33017] = "Тлеющее создание",
		[25760] = "Квалдир-налетчик",
		[27871] = "Плотоядный вурдалак",
		[4421] = "Чарлга Остробок",
		[29982] = "Мародер Драккари",
		[4437] = "Страж-смотритель из племени Иглошкурых",
		[8886] = "Загадочный питон",
		[6508] = "Ядошкурый равазавр",
		[41909] = "Стражник аэродрома",
		[3267] = "Водоискатель из племени Иглогривых",
		[35896] = "Ядоплюй",
		[4517] = "Жрица из племени Мертвой Головы",
		[4525] = "Землеломка из племени Иглошкурых",
		[4541] = "Кровь Агамаггана",
		[26496] = "Му'фа Торговец Ветром",
		[46963] = "Лорд Вальден",
		[26624] = "Гнусный изрыгатель",
		[33338] = "Часовой заставы Мейстры",
		[3375] = "Бейл'данский старшина",
		[27008] = "Кровавый Пир",
		[31134] = "Синигоса",
		[35897] = "Леденюка",
		[29311] = "Глашатай Волаж",
		[27360] = "Тлеющий скелет",
		[4805] = "Морская ведьма Непроглядной Пучины",
		[4813] = "Сумеречный темный маг",
		[4829] = "Аку'май",
		[4853] = "Геомант из племени Каменного Свода",
		[6908] = "Олаф",
		[25601] = "Принц Валанар",
		[27680] = "Далия Благословение Солнца",
		[29791] = "Дух люторога <Гал'дара>",
		[9862] = "Джеденарский легионер",
		[7012] = "Земельник-скульптор",
		[23970] = "Врайкул-скелет",
		[7036] = "Шпион Тауриссана",
		[7076] = "Земельник-страж",
		[5053] = "Загадочный кроколиск",
		[10198] = "Кашох Разоритель",
		[26625] = "Темнопутый паук-отшельник",
		[7228] = "Иронайа",
		[31007] = "Лазурная чародейка",
		[35451] = "Черный рыцарь",
		[27009] = "Дракров",
		[3671] = "Леди Анакондра",
		[25378] = "Некромант из Эн'кила",
		[7396] = "Земельник-камнелом",
		[1852] = "Араж Призыватель",
		[1860] = "Мецнаке",
		[49269] = "Дух Дун Гарока",
		[7452] = "Безумный совух",
		[5429] = "Огненный рух",
		[39354] = "Акула Хитрой Шестеренки",
		[17734] = "Болотник Нижетопи",
		[118] = "Лесной хищник",
		[30176] = "Ан'кахарский страж",
		[3783] = "Чащобный призыватель дождя",
		[17990] = "Гриб Нижетопи",
		[36092] = "Убийца из ШРУ",
		[3799] = "Покалеченный друид",
		[3803] = "Покалеченный хранитель",
		[26370] = "Арканимус",
		[26402] = "Ануб'арский душитель",
		[46711] = "Бузотер из племени Каменного Свода",
		[3823] = "Светлолапый бегун",
		[1922] = "Серый лесной волк",
		[5645] = "Шкуродер из племени Песчаной Бури",
		[26722] = "Лазурный волхв",
		[3875] = "Призрачный служитель",
		[31008] = "Лазурный захватчик",
		[3887] = "Барон Сильверлейн",
		[52021] = "Расплавий",
		[48119] = "Убийца из племени Тлеющего Терновника",
		[42042] = "Черный дракончик",
		[40059] = "Высокорожденный-полтергейст",
		[42170] = "Снежный леопард",
		[29313] = "Гнойрон",
		[27362] = "Тлеющее создание",
		[3939] = "Волк племени Иглогривых",
		[46712] = "Недотепа из племени Каменного Свода",
		[5853] = "Закаленный боевой голем",
		[27682] = "Лазурный дракон",
		[41083] = "Стализвон LX-506 <Келси Стализвон>",
		[3983] = "Дознаватель Вишас",
		[35134] = "Azshara Land Mine Bunny",
		[11910] = "Бузотер из племени Зловещего Тотема",
		[17735] = "Воин клана Зловещего Плавника",
		[28002] = "Геныч",
		[28034] = "Факир Драккари",
		[48120] = "Разрушитель из клана Огненного Чрева",
		[42043] = "Черный поработитель",
		[4051] = "Кенарийский ботаник",
		[32576] = "Орабус Кормчий",
		[2042] = "Кошка",
		[30625] = "Увечье",
		[38845] = "Дитя Вулканота",
		[26627] = "Хрустальный укротитель",
		[26723] = "Керистраза",
		[31009] = "Лазурный рушитель чар",
		[8408] = "Полководец Креллиан",
		[31233] = "Жилистый волк",
		[42044] = "Пиррисион",
		[4278] = "Командир Спрингвейл",
		[25316] = "Берилловый колдун",
		[4294] = "Колдун Алого ордена",
		[4302] = "Воитель из Алого ордена",
		[42620] = "Яйцо кнутохвоста",
		[25444] = "Магмотский тотем огня",
		[47162] = "Глубток",
		[25668] = "Мстительный дух таунки",
		[25700] = "Горлок-охотник",
		[29826] = "Целитель Драккари",
		[12902] = "Лоргус Джетт",
		[4422] = "Агателос Свирепый",
		[4438] = "Копьешкур из племени Иглошкурых",
		[6493] = "Иллюзорный фантазм <Блуждающий фантазм>",
		[10951] = "Хищный труп",
		[30114] = "Сумеречный посвященный",
		[6517] = "Смоляная тварь",
		[30178] = "Ан'кахарский паук",
		[24069] = "Костекрушитель из клана Укротителей драконов",
		[4510] = "Гералат Бурый Ручей",
		[4518] = "Ведунья из племени Мертвой Головы",
		[4526] = "Ветряной ревун",
		[4534] = "Прирученная гиена <Повелитель зверей из племени Иглошкурых>",
		[44476] = "Бульмастиф",
		[28419] = "Бесноватый упырь",
		[32577] = "Квалдир-матрос",
		[26628] = "Смертехват Драккари",
		[39039] = "Гномреганский истребитель-невидимка",
		[11319] = "Шаман Огненной пропасти",
		[4670] = "Разбойник из племени Ярой Ненависти",
		[35329] = "Чемпион Стальгорна",
		[15509] = "Оса",
		[47739] = "\"Капитан\" Пирожок",
		[41854] = "Стерегущий часовой",
		[4798] = "Тенелов из племени Змеящегося Корня",
		[4814] = "Сумеречный повелитель стихий",
		[25445] = "Неруб'арский собиратель трупов",
		[4846] = "Тенегорнский землекоп",
		[4854] = "Гримлок",
		[34818] = "Древо войны Когтистых гор",
		[25701] = "Горлок-черпатель",
		[11911] = "Наемник из племени Зловещего Тотема",
		[4958] = "Блуждающий дух <Нэмфисса>",
		[28036] = "Воитель Шшератуса",
		[30179] = "Сумеречный апостол",
		[7077] = "Земельник-строитель",
		[28388] = "Воин Джин'Алай",
		[7109] = "Скверноподданный из племени Нефритового Пламени",
		[32578] = "Квалдир-матрос",
		[2552] = "Тролль из племени Сухокожих",
		[39041] = "Гномреганский пилот",
		[35203] = "Гномобот-дробитель",
		[7309] = "Земельник-комендант",
		[2640] = "Знахарь из племени Порочной Ветви",
		[5286] = "Длиннозуб-охотник",
		[48445] = "Лакей-болванчик",
		[25350] = "Восставший выносливый гонец",
		[7397] = "Земельник-камнерез",
		[2680] = "Волчонок племени Порочной Ветви",
		[38850] = "Защитник Вулканота",
		[38914] = "Песчанокаменный голем",
		[27685] = "Хладный агрессивный вурдалак",
		[39042] = "Парашютист Альянса",
		[7453] = "Осененный луной совух",
		[53563] = "Страж-смотритель Лунной поляны",
		[41409] = "Зверолов из клана Черного Железа",
		[39426] = "Конфетка",
		[17770] = "Топеглад",
		[2748] = "Аркедас",
		[24071] = "Разрыватель сердец из клана Укротителей драконов",
		[30276] = "Ан'кахарский веретенщик",
		[24199] = "Зачумленный укротитель из клана Укротителей драконов",
		[32579] = "Квалдир-матрос",
		[36740] = "Тероящер-детеныш",
		[36868] = "Порабощенный сын Арккорока",
		[47231] = "Темный служитель",
		[11320] = "Землеед",
		[35205] = "Гном-пилот",
		[39363] = "Чип Идейл",
		[26918] = "Хаотический разлом",
		[5806] = "Древень-союзник",
		[25351] = "Фантомный ведун",
		[7885] = "Мастер битв Бича Злобы",
		[2924] = "Среброгривый волк",
		[5854] = "Тяжелый боевой голем",
		[25479] = "Квалдир-ткач туманов",
		[27654] = "Дракос Дознаватель",
		[27686] = "Хладный агрессивный упырь",
		[2960] = "Вожак луговых волков",
		[29829] = "Землетряс Драккари",
		[51518] = "Горный пехотинец Лок Модана",
		[17732] = "Оса ликулла",
		[19632] = "Светящийся острожал",
		[35334] = "Гном-инженер",
		[17731] = "Болотный скат",
		[18105] = "Газ'ан",
		[2992] = "Исцеляющий идол V <Тотемист племени Иглошкурых>",
		[43778] = "Врагорез-5000",
		[17771] = "Оракул из племени Темной Крови",
		[17730] = "Лекарь Темной Крови",
		[17728] = "Дикарь из племени Темной Крови",
		[28166] = "Нестабильная сфера",
		[17726] = "Мирмидон из клана Зловещего Плавника",
		[30277] = "Ан'кахарский измельчитель",
		[7039] = "Боевой разоритель",
		[24200] = "Скарвальд Строитель",
		[17724] = "Болотный скат",
		[7027] = "Душегуб из клана Черной горы",
		[27633] = "Лазурный инквизитор",
		[29838] = "Люторог Драккари",
		[29713] = "Слад'ранский душитель",
		[43050] = "Тарас",
		[12216] = "Ядовитый грелль",
		[4542] = "Верховный инквизитор Фэйрбанкс",
		[33458] = "Ловец из Ясеневого леса",
		[30661] = "Лазурный захватчик",
		[1554] = "Сумеречница-вампир",
		[26631] = "Новос Призыватель",
		[29573] = "Элементаль Дракарри",
		[35200] = "Пират-наемник",
		[4127] = "Зубастая гиена",
		[1511] = "Разъяренная седоспиная горилла",
		[6190] = "Воин из клана Бича Злобы",
		[25684] = "Талрамасское поганище",
		[6206] = "Землеглот из пещерных глубин",
		[29820] = "Охотник бога Драккари",
		[6222] = "Прокаженный техник",
		[6230] = "Защитный скафандр миротворца",
		[24198] = "Зачумленный руночар из клана Укротителей драконов",
		[23990] = "Гьялербронский руночар",
		[35119] = "Эдрик Чистый",
		[35311] = "Фонтан света <Жрица Серебряного Авангарда>",
		[41924] = "Захватчик из клана Черного Железа",
		[35305] = "Монах Серебряного Авангарда",
		[27709] = "Захватчик Драккари",
		[1493] = "Мок'раш Колун",
		[25216] = "Оракул племени Зимних Плавников",
		[36103] = "Сотрудник ШРУ",
		[30111] = "Сумеречный верующий",
		[27431] = "Командир Драккари",
		[4287] = "Орденоносец Алого ордена",
		[4295] = "Мирмидон Алого ордена",
		[4303] = "Аббат Алого ордена",
		[25416] = "Шкварчун",
		[898] = "Ворген из стаи Ночной Погибели",
		[27363] = "Тлеющий упырь",
		[47553] = "Раша'крак",
		[14268] = "Лорд Кондар",
		[7025] = "Солдат из клана Черной горы",
		[25615] = "Чумной магнатавр",
		[27687] = "Хладный агрессивный некромант",
		[35609] = "Вышибала с виллы",
		[12856] = "Вестница Ясеневого леса",
		[29830] = "Живое колдунство",
		[25768] = "Лорд Криксикс",
		[25728] = "Драконид Хладарры",
		[39582] = "Торговый принц Галливикс",
		[30174] = "Боевой медведь Круга хильд",
		[3240] = "Грозорыл",
		[6226] = "Механический огнемет",
		[11912] = "Громила из племени Зловещего Тотема",
		[25332] = "Шитый ужас клана Песни Войны",
		[47296] = "Хеликс Отломчикс",
		[6518] = "Смоляной скрытень",
		[38187] = "Костлявый ящер",
		[44433] = "Работник из Альянса",
		[26280] = "Охотник на магов Драконьего Погоста",
		[30278] = "Ан'кахарский метатель заклинаний",
		[4511] = "Агам'ар",
		[4519] = "Ясновидица из племени Мертвой Головы",
		[48450] = "Яснокрылый визгун",
		[50561] = "Кровожадный вурдалак",
		[4543] = "Волшебник крови Талнос",
		[26769] = "Анок'ра Манипулятор",
		[44612] = "Следопыт из шайки Скитальцев Пустыни",
		[27408] = "Хищник Ночного Воя",
		[28784] = "Хранитель алтаря",
		[7115] = "Джеденарский адепт",
		[3126] = "Панцирный скорпид",
		[25217] = "Воин племени Зимних Плавников",
		[38855] = "Вулканот",
		[26632] = "Пророк Тарон'джа",
		[4623] = "Иглостраж-воитель",
		[6021] = "Дух вепря <Аггем Терновое Проклятие>",
		[11321] = "Оплавленный элементаль",
		[28035] = "Жрец Шшератуса",
		[26792] = "Кристаллический заступник",
		[4663] = "Авгур из клана Пылающего Клинка",
		[38708] = "Королева дьявозавров",
		[679] = "Шаман из клана Мош'Огг",
		[27254] = "Изумрудный плеточник",
		[47747] = "Зараженный плеточник",
		[3376] = "Солдат Бейл'дана",
		[4711] = "Нага из клана Скользящего Плавника",
		[4535] = "Прирученный боевой вепрь <Дрессировщик из племени Иглошкурых>",
		[212] = "Воин из клана Дробящего Кулака",
		[38183] = "Хаггис Боутмердер",
		[44478] = "Гнолл из стаи Красной Сосны",
		[9690] = "Пепельный ворг",
		[11561] = "Нежить-опустошитель",
		[30664] = "Лазурный убийца магов",
		[46375] = "Буйный смутьян",
		[11324] = "Чернокнижник из клана Огненного Клинка",
		[4847] = "Тенегорнский охотник за реликвиями",
		[4799] = "Призыватель огня из племени Змеящегося Корня",
		[4807] = "Мирмидон Непроглядной Пучины",
		[4815] = "Мелководный клешнехват",
		[4823] = "Колючий членистоног",
		[4831] = "Леди Саревесс",
		[4855] = "Буян из племени Каменного Свода",
		[36681] = "Прожорливая рыщущая акула",
		[29639] = "Пленная бруннхильдарка",
		[6910] = "Ревелош",
		[25609] = "Некролорд из Эн'кила",
		[29735] = "Взбешенный ворг",
		[4887] = "Гхаму-ра",
		[25467] = "Жнец из стаи Кровавых Спор",
		[36682] = "Молот",
		[2923] = "Облезлый среброгрив",
		[37206] = "Равнинная хищница",
		[4461] = "Воин из племени Черножабрых",
		[11913] = "Колдун из племени Зловещего Тотема",
		[6234] = "Механический страж",
		[35466] = "Неугомонный дух",
		[44317] = "Равениан",
		[37560] = "Землепроходец из племени Иглогривых",
		[7022] = "Ядоносный скорпид",
		[7030] = "Тенегорнский геолог",
		[7038] = "Посланник Тауриссана",
		[11735] = "Камнехвостый скорпид",
		[7086] = "Проклятый слизнюк",
		[30279] = "Глубинный ползун",
		[6426] = "Тоскующий мертвец",
		[7078] = "Пещерный скорпид",
		[48452] = "Защитник Поляны Когтистых Ветвей",
		[35526] = "Бульдозер Дубника",
		[5055] = "Загадочный плеточник",
		[7110] = "Тенелов из племени Нефритового Пламени",
		[3560] = "Исцеляющий идол <Шаман из клана Мош'Огг>",
		[7126] = "Джеденарский охотник",
		[12217] = "Бес-осквернитель",
		[12178] = "Истерзанный друид",
		[46917] = "Пламенный клинок Летящей Тьмы",
		[23965] = "Ледяная могила",
		[30695] = "Хранитель портала",
		[12236] = "Лорд Злоязыкий",
		[9376] = "Яропламень",
		[24079] = "Выплавщик из клана Укротителей драконов",
		[26729] = "Оруженосец",
		[7206] = "Древний каменный хранитель",
		[26793] = "Кристаллический хлестун",
		[6243] = "Гелихаст",
		[34503] = "Погромщик из племени Иглогривых",
		[27483] = "Король Дред",
		[6211] = "Разоритель из пещерных глубин",
		[33420] = "Странное щупальце",
		[3825] = "Светлолапый вожак",
		[3636] = "Загадочный опустошитель",
		[3640] = "Изменчивая эктоплазма",
		[26623] = "Громила Плети",
		[2586] = "Проходимец из Синдиката",
		[10120] = "Страж подземелья",
		[23961] = "Железоголов из клана Укротителей драконов",
		[41361] = "Пехотинец Северной Стражи",
		[47140] = "Скелет колдуна",
		[25226] = "Скольдер",
		[29832] = "Голем Драккари",
		[42717] = "Димаприст",
		[44487] = "Трещащая тыква",
		[38327] = "Осадный инженер крепости Северной Стражи",
		[25386] = "Некрорахнид из Эн'кила",
		[25418] = "Вспеннер",
		[30338] = "Ан'кахарский паук",
		[42518] = "Воин клана Громового Молота",
		[46918] = "Заклинательница Летящей Тьмы",
		[25758] = "Защитанк 66Д",
		[26626] = "Воскреситель из Плети",
		[2681] = "Верховой волк племени Порочной Ветви",
		[26711] = "Раненый мамонт",
		[29768] = "Непреклонный душитель",
		[7454] = "Яростный совух",
		[23691] = "Взрослый черпорог",
		[5683] = "Корма Виллард",
		[45447] = "Арикара",
		[25215] = "Гарпунер племени Зимних Плавников",
		[25415] = "Разгневанная буря",
		[28600] = "Хеб'драккарский охотник за головами",
		[30024] = "Гаргорал Повелитель Воды",
		[37092] = "Вырост",
		[10954] = "Кровопускатель",
		[26730] = "Убийца магов",
		[25383] = "Поганище из Эн'кила",
		[4812] = "Сумеречный летописец",
		[26613] = "Детеныш полярного гризли",
		[25417] = "Гневный кипятень",
		[48262] = "Огр-телохранитель",
		[4286] = "Солдат Алого ордена",
		[2643] = "Берсерк из племени Порочной Ветви",
		[26824] = "Верховой ящер Драккари",
		[46379] = "Жестокий убийца",
		[44488] = "Дух стрелка",
		[46855] = "Эрик \"Быстрый\"",
		[30418] = "Укрощенный элементаль воздуха",
		[3377] = "Бейл'данский ружейник",
		[3824] = "Светлолапый ревун",
		[9163] = "Деметродон",
		[25802] = "Кау Гроза Мамонтов",
		[34701] = "Колосус",
		[3840] = "Друид-змея",
		[44473] = "Косматый черный медведь",
		[5647] = "Призыватель огня из племени Песчаной Бури",
		[35149] = "Снайпер с заставы Талрендис <Азшарское молодое деревце>",
		[11322] = "Сектант из клана Огненного Клинка",
		[36129] = "Пилот гиролета",
		[26794] = "Орморок Воспитатель Дерев",
		[5687] = "Пленное поганище",
		[26858] = "Сарастра",
		[25699] = "Горлок-грязеплеск",
		[25433] = "Отпрыск Магмотрегара",
		[27007] = "Ледоскал",
		[19423] = "Тузик",
		[30660] = "Страж портала",
		[4460] = "Вождь племени Черножабрых",
		[26637] = "Восставший укротитель Драккари",
		[52165] = "Болотное чудище",
		[39947] = "Погромщик из племени Зловещего Тотема",
		[5775] = "Вердан Вечноживущий",
		[7040] = "Черный драконоид",
		[24957] = "Прислужник Чумного Культа",
		[29321] = "Гнойная капля",
		[3928] = "Гниющая слизь",
		[34811] = "Rolling Rock 1",
		[25387] = "Горгулья из Эн'кила",
		[26344] = "Воин из деревни Инду'ле",
		[5839] = "Геолог из клана Черного Железа",
		[25419] = "Кипящий дух",
		[25451] = "Неруб'арский затмитель небес",
		[36621] = "Волшебник Альянса",
		[39069] = "Парашютист Альянса",
		[11697] = "Бичевательница Маннорока",
		[3265] = "Охотник из племени Иглогривых",
		[25611] = "Аберрация ферм Песни Войны",
		[3976] = "Командор Алого ордена Могрейн",
		[25675] = "Тундровый волк",
		[26349] = "Горамош",
		[7405] = "Смертоносный пещерный скорпид",
		[35150] = "Дарнасский метатель глеф",
		[6506] = "Равазавр-бегун",
		[13142] = "Загнивший плетун",
		[25521] = "Скадирский лодочник",
		[4008] = "Скалозавр",
		[4420] = "Властитель Злоклык",
		[26125] = "Молотохап",
		[4020] = "Сгустень",
		[24078] = "Металлорез из клана Укротителей драконов",
		[17871] = "Шаркун Нижетопи",
		[25514] = "Рокнар",
		[1096] = "Геолог Торговой Компании",
		[12676] = "Острокоготь",
		[26266] = "Хейгарр Душегуб",
		[6047] = "Водяной страж",
		[27957] = "Ангратарский упырь",
		[26283] = "Загробник льда",
		[3197] = "Фанатик из клана Пылающего Клинка",
		[47297] = "Болванчик",
		[29931] = "Люторог Драккари",
		[26411] = "Спятивший селянин Инду'ле",
		[8600] = "Чумной нетопырь",
		[12218] = "Мерзкая личинка",
		[46857] = "Олаф",
		[29444] = "Змея Драккари <Факир Драккари>",
		[34703] = "Лана Твердомолот",
		[23564] = "Зачумленный врайкул из клана Укротителей драконов",
		[26635] = "Восставший воин Драккари",
		[4300] = "Волшебник Алого ордена",
		[7209] = "Осколок обсидиана <Обсидиановый часовой>",
		[26731] = "Великая ведунья Телестра",
		[26763] = "Аномалус",
		[35151] = "Хранитель Когтистых гор",
		[2647] = "Пожиратель душ из племени Порочной Ветви",
		[6207] = "Душитель из пещерных глубин",
		[6215] = "Чавккер",
		[6223] = "Прокаженный защитник",
		[13141] = "Прогнивший топотун",
		[35838] = "Пигмей-знахарь",
		[31010] = "Лазурный убийца магов",
		[27564] = "Новобранец Альянса",
		[37212] = "Лиана Ежевичного оврага",
		[25453] = "Ит'рикс Жнец",
		[6218] = "Облученная слизь",
		[48201] = "Старшина Черной горы",
		[35234] = "Наемный грабитель",
		[40194] = "Долинная сова",
		[27531] = "Хладное агрессивное поганище",
		[4344] = "Крапчатый кроколиск-грязекуп",
		[48521] = "Ветроплет из Братства Справедливости",
		[4288] = "Зверолов из Алого ордена",
		[4296] = "Адепт Алого ордена",
		[4304] = "Ищейка Алого ордена",
		[3743] = "Воин из племени Гиблой Чащи",
		[25452] = "Порабощенный Плетью мамонт",
		[40717] = "Барханный плеточник",
		[1085] = "Старый тигр Тернистой долины",
		[6391] = "Воин зоны",
		[29323] = "Сифрельдарская дева штормов",
		[6407] = "Техник зоны",
		[27691] = "Бесноватая горгулья",
		[28231] = "Кристаллическая грация",
		[8764] = "Дымчатокрылый опустошитель",
		[29834] = "Бешенка Драккари",
		[26836] = "Гигантавр",
		[27430] = "Тотем уничтожения",
		[12922] = "Бес-прислужник",
		[47626] = "Адмирал Терзающий Рев",
		[6487] = "Чародей Доан",
		[4440] = "Тотемист племени Иглошкурых",
		[6224] = "Прокаженный машиностроитель",
		[43223] = "Раб Занзила",
		[25496] = "Квалдир-повелитель туманов",
		[6519] = "Смоляной дух",
		[6527] = "Смоляной ползун",
		[38808] = "Гаал",
		[27605] = "Исполинское поганище",
		[36176] = "Матрос Альянса",
		[4512] = "Гниющий агам'ар",
		[4520] = "Геомант племени Иглошкурых",
		[4528] = "Каменный грохотун <Геомант племени Иглошкурых>",
		[48522] = "Пират из Братства Справедливости",
		[36304] = "Скальный мокрокрыл",
		[25618] = "Варидус Свежеватель",
		[1150] = "Речной кроколиск",
		[4863] = "Нефритовый василиск",
		[26828] = "Магистр Кельдонус",
		[1165] = "Геомант из племени Камнедробов",
		[34705] = "Маршал Якоб Алерий",
		[30666] = "Лазурный капитан",
		[36816] = "Защитник с заставы Талрендис",
		[26636] = "Восставший энергетический маг Драккари",
		[1061] = "Ган'зулах",
		[34961] = "Вторгшийся крушитель",
		[11323] = "Головорез из клана Огненного Клинка",
		[25880] = "Прислужник Кау",
		[35153] = "Дреней-паладин",
		[1167] = "Землекоп из племени Камнедробов",
		[4672] = "Скверноподданный племени Ярой Ненависти",
		[41613] = "Часовой Стража Природы",
		[24201] = "Далронн Контролирующий",
		[4696] = "Крепкохват скорпаши",
		[6575] = "Новобранец Алого ордена",
		[4712] = "Колдунья из клана Скользящего Плавника",
		[8956] = "Медведь злобных когтей",
		[6375] = "Громоголовый гиппогриф",
		[510] = "Элементаль воды",
		[27897] = "Разрушитель из рода Бесконечности",
		[50250] = "Аватара льда",
		[9516] = "Лорд Гиблопуст",
		[4424] = "Аггем Терновое Проклятие",
		[1195] = "Лесной паук-скрытень",
		[38224] = "Механоцып",
		[32191] = "Лазурный ловец",
		[26630] = "Кровотролль",
		[44557] = "Зомби из племени Песчаной Бури",
		[4861] = "Крылан-охотник",
		[3713] = "Скользящий по волнам из клана Зловещего Хвоста",
		[4832] = "Повелитель сумрака Келрис",
		[9676] = "Звяк Пружиносвист",
		[4848] = "Тенегорнский черный маг",
		[34706] = "Тераморский снайпер",
		[3125] = "Гремучий скорпид",
		[25613] = "Скадирский ткач туманов",
		[36943] = "Налетчик из племени Дыбогривов",
		[46164] = "Пехотинец Болотных Волн",
		[39195] = "Вкуснита Хлестопорка",
		[4857] = "Каменный хранитель",
		[35154] = "Ночной эльф - маг",
		[45453] = "Собака",
		[39376] = "Нефтяной робот ТКК",
		[33569] = "Нападающий из Ясеневого леса",
		[44316] = "Иссохший копейщик",
		[46964] = "Лорд Годфри",
		[37585] = "Разведчик крепости Северной Стражи",
		[42041] = "Похититель детенышей из клана Драконьей Пасти",
		[7023] = "Обсидиановый часовой",
		[26727] = "Опытный охотник на магов",
		[41935] = "Захватчик из Северной Стражи",
		[1251] = "Огнетворец из клана Дробящего Кулака",
		[34177] = "Разведчик Ясеневого леса",
		[30283] = "Чумоброд",
		[1108] = "Горилла",
		[7079] = "Липкая муть",
		[2521] = "Небогривая горилла",
		[5048] = "Загадочный аспид",
		[5056] = "Загадочный страхозуб",
		[25836] = "Загребущий ныряльщик",
		[26413] = "Ануб'арский ткач ужаса",
		[11318] = "Трогг Огненной пропасти",
		[12219] = "Колючий хлыстолап",
		[1144] = "Знахарь из клана Мош'Огг",
		[50834] = "Ретилгор",
		[30667] = "Лазурная колдунья",
		[26605] = "Ануб'арский владыка подземелий",
		[7175] = "Душитель из племени Каменного Свода",
		[28630] = "Кровавая личинка-паразит <Кровавый Пир>",
		[25725] = "Вождь Гурглбугль",
		[25625] = "Аберрация ферм Песни Войны <Зараженный узник>",
		[48260] = "Охотник из стаи Кровавых Клыков",
		[26728] = "Посвященный охотник на магов",
		[25721] = "Волшебный змей",
		[51659] = "Монах Алого ордена",
		[4860] = "Каменный распорядитель",
		[47714] = "Пар",
		[46856] = "Бейлог",
		[22895] = "Призванный опаляющий тотем <Телох>",
		[48417] = "Кровавый волшебник из Братства Справедливости",
		[7886] = "Чародейка из клана Бича Злобы",
		[5755] = "Загадочная гадюка",
		[4457] = "Добытчик из племени Черножабрых",
		[25210] = "Хранитель ключей Ургргрл",
		[26281] = "Ловчий из Садов Лунного Покоя",
		[11794] = "Сестра Келебраса",
		[2641] = "Охотник за головами из племени Порочной Ветви",
		[26115] = "Омраченный кровопийца",
		[38624] = "Защитник крепости Северной Стражи",
		[25294] = "Неруб'арский властелин паутины",
		[6906] = "Бейлог",
		[33419] = "Щупальце Глубин",
		[26841] = "Оживленный ледяной змей",
		[25422] = "Загадочная паутина",
		[1550] = "Василиск-хвостохлест",
		[27533] = "Хладный упырь",
		[40785] = "Пулемет гномреганского истребителя-невидимки",
		[27597] = "Неповоротливое тело",
		[12876] = "Барон Акванис",
		[25584] = "Инквизитор Салранд",
		[35812] = "Умная обезьяна-рудокоп",
		[25678] = "Доктор Щербохмыл",
		[11518] = "Жергош Призыватель Духов",
		[29836] = "Боевой наездник Драккари",
		[37923] = "Передовой боец форта Триумфа",
		[25806] = "Загребущий браконьер",
		[51660] = "Капеллан Алого ордена",
		[27753] = "Захватчик Драккари",
		[27949] = "Командир Альянса",
		[6195] = "Сирена из клана Бича Злобы",
		[11790] = "Сатир из племени Тлетворных",
		[48665] = "Обреченный призрак",
		[25624] = "Зараженный узник",
		[38360] = "Сирена Вайш'элана",
		[41937] = "Маршал Полтроу",
		[26126] = "Костяной воин",
		[35590] = "Воскрешенный чемпион <Черный рыцарь>",
		[30284] = "Костомол",
		[5268] = "Медведь-сталемех",
		[39022] = "Приливный странник",
		[26286] = "Змей затаившегося пламени",
		[44432] = "Охотник на лис из Альянса",
		[4345] = "Грязекуп-острозуб",
		[38636] = "Охранник крепости Северной Стражи",
		[11791] = "Плут из племени Тлетворных",
		[7118] = "Джеденарский темноплет",
		[12222] = "Ползучий слякоч",
		[40722] = "Наваждение вуду <Ингви>",
		[25468] = "Обжарщик из стаи Кровавых Спор",
		[30668] = "Лазурный налетчик",
		[26606] = "Ануб'арский душегуб",
		[26638] = "Восставший всадник на нетопыре из Драккари",
		[48121] = "Пламевержец из клана Огненного Чрева",
		[39589] = "Громила-телохранитель",
		[26734] = "Лазурный головорез",
		[48502] = "Головорез из Братства Справедливости",
		[30892] = "Страж портала",
		[26830] = "Восставший рыцарь смерти Драккари",
		[47134] = "Пожиратель трупов",
		[33302] = "Капитан Элендилад",
		[26926] = "Герцог Валленхол",
		[51853] = "Охранник крепости Северной Стражи",
		[13136] = "Трутень из улья Аши <Истерзанный часовой>",
		[26045] = "Порыв шторма",
		[44400] = "Застрельщик Оперенной Луны",
		[1559] = "Король Мукла",
		[48505] = "Страж Тьмы из Братства Справедливости",
		[44587] = "Барханный ловец",
		[4802] = "Жрица прилива из Непроглядной Пучины",
		[38644] = "Шаман Умлота",
		[26621] = "Вурдалак-мучитель",
		[11792] = "Тенелов из племени Тлетворных",
		[3975] = "Ирод",
		[25295] = "Неруб'арский членистоног",
		[4500] = "Властитель Мок'Морокк",
		[25359] = "Командир соединения Стальная Челюсть",
		[48447] = "Страшный попугай",
		[27294] = "Тундровый мусорщик",
		[5856] = "Стеклопутый паук",
		[27534] = "Хладный вурдалак",
		[35330] = "Чемпион Экзодара",
		[27598] = "Зловонный труп тролля",
		[1514] = "Мокк Дикарь",
		[2949] = "Дубильщик из стаи Бледногривов",
		[4057] = "Сын Кенария",
		[35245] = "Серокаменный василиск",
		[41171] = "Обнадеживающий штейгер Стражей Пустоты",
		[25743] = "Гигантский самец шерстистого мамонта",
		[11520] = "Тарагаман Ненасытный",
		[1564] = "Чернокнижник из шайки Кровавого Паруса",
		[1489] = "Охотник Занзила",
		[1491] = "Нага Занзила",
		[8015] = "Часовой Ясеневого леса",
		[4462] = "Охотник из клана Черной горы",
		[4301] = "Центурион Алого ордена",
		[7037] = "Огнеход Тауриссана",
		[35328] = "Чемпион Штормграда",
		[6008] = "Чернокнижник культа Приверженцев Тени",
		[6016] = "Тотем защиты от стихий <Ведунья из племени Мертвой Головы>",
		[24080] = "Оружейник из клана Укротителей драконов",
		[29774] = "Плюющаяся кобра",
		[30285] = "Глаз Талдарама",
		[2535] = "Моури \"Деревянная Нога\" Уилкинс",
		[48418] = "Заклинательница из Братства Справедливости",
		[4306] = "Истязатель из Алого ордена",
		[26319] = "Ануб'арский сектант",
		[416] = "Азури",
		[44562] = "Пустобрюхая громадина",
		[39374] = "Бойцовый пес <Ненормий>",
		[34803] = "Древо войны Когтистых гор",
		[12220] = "Удушающая лоза",
		[7320] = "Изверг из племени Каменного Свода",
	},
	["death_recap"] = {
		["enabled"] = true,
		["show_segments"] = false,
		["show_life_percent"] = false,
		["relevance_time"] = 7,
	},
	["user_is_patreon_supporter"] = false,
	["spell_pool"] = {
		5, -- [1]
		5, -- [2]
		"Мир (падение)", -- [3]
		[89732] = 1,
		[6136] = "Морская ведьма Непроглядной Пучины",
		[53390] = 7,
		[41172] = "Следопыт Альянса",
		[8286] = "Аггем Терновое Проклятие",
		[14443] = "Прокаженный защитник",
		[47697] = "Священник Альянса",
		[43667] = "Принц Келесет",
		[8382] = "Грязекоп из племени Мутной Воды",
		[8398] = "Слуга Аку'мая",
		[93827] = 4,
		[33688] = "Кристаллический хранитель",
		[29166] = 11,
		[31405] = "Оракул из племени Темной Крови",
		[48721] = 6,
		[85256] = 2,
		[48849] = "Король Дред",
		[42772] = "Стратег из клана Укротителей драконов",
		[93828] = 3,
		[10733] = "Механический огнемет",
		[55502] = 5,
		[403] = 7,
		[84617] = 4,
		[8814] = "Волшебник крови Талнос",
		[49617] = 2,
		[47698] = "Кристаллический заступник",
		[89735] = "Испорченная кукуруза",
		[408] = 4,
		[48082] = "Кристаллический хлестун",
		[8990] = "Командор Алого ордена Могрейн",
		[6552] = 1,
		[68498] = "Боевой ворг Серебряного Авангарда <Копуша>",
		[20243] = 1,
		[28495] = 2,
		[93830] = 5,
		[22482] = 4,
		[32749] = "Волшебник Алого ордена",
		[67731] = "[*] Отсрочка смерти",
		[55503] = 2,
		[55567] = "Землетряс Драккари",
		[66196] = 6,
		[49618] = "Кровотролль",
		[421] = 7,
		[47699] = "Кристаллический хранитель",
		[20819] = "Колдун Алого ордена",
		[15547] = "Браконьер из стаи Речной Лапы",
		[9438] = "Чародей Доан",
		[54160] = "Бесплотная сфера <Ксевозз>",
		[58510] = "Страж портала",
		[84620] = 1,
		[95495] = "Пушка Братства Справедливости",
		[431] = 5,
		[34650] = "Исчадие Тьмы <Ваилетжизни>",
		[432] = 5,
		[83853] = 8,
		[31790] = 2,
		[434] = 5,
		[435] = 5,
		[66198] = 6,
		[49555] = "Кровотролль",
		[45525] = 11,
		[6984] = "Дрессировщик из племени Иглошкурых",
		[81039] = "Облученная слизь",
		[438] = 9,
		[23922] = 1,
		[11981] = "Предсказатель из Алого ордена",
		[89739] = "\"Капитан\" Пирожок",
		[440] = 8,
		[50131] = "Убийца магов",
		[441] = 8,
		[50259] = 11,
		[10094] = "Древний каменный хранитель",
		[34267] = "Газ'ан",
		[54801] = "Элементаль Дракарри",
		[53138] = 6,
		[32750] = "Волшебник Алого ордена",
		[98440] = 4,
		[35099] = 3,
		[55633] = "Голем Драккари",
		[45462] = 6,
		[76691] = 1,
		[20820] = "Адепт Алого ордена",
		[89485] = 5,
		[93707] = "Лорд Годфри",
		[27089] = 11,
		[16886] = 11,
		[58448] = 11,
		[62606] = 11,
		[1833] = 4,
		[31407] = "Копейщик из племени Темной Крови",
		[88974] = "Бомба-липучка",
		[31567] = "Охотник бога Драккари",
		[38618] = "Командир Альянса",
		[38682] = "Берсерк Альянса",
		[61391] = 11,
		[465] = 2,
		[467] = 1,
		[25778] = "Болотник Нижетопи",
		[68505] = 11,
		[47702] = 11,
		[93581] = "Барон Эшбери",
		[47958] = "Орморок Воспитатель Дерев",
		[43928] = "Металлорез из клана Укротителей драконов",
		[96268] = 6,
		[9007] = 11,
		[18070] = "Землеед",
		[24275] = 2,
		[54739] = 5,
		[15244] = "Опытный охотник на магов",
		[38619] = "Командир Альянса",
		[48982] = 6,
		[63375] = 7,
		[13341] = "Скелет колдуна",
		[35101] = 3,
		[84627] = 2,
		[53652] = 2,
		[7744] = 6,
		[15532] = "Морская ведьма Непроглядной Пучины",
		[81301] = 5,
		[1949] = 9,
		[33758] = 6,
		[60433] = 11,
		[58450] = 11,
		[88466] = 3,
		[46424] = 11,
		[17143] = "Воитель из Алого ордена",
		[50774] = "Дракос Дознаватель",
		[7896] = "Зверолов из Алого ордена",
		[5857] = 9,
		[11790] = 4,
		[498] = 2,
		[9791] = "Костекрушитель из клана Укротителей драконов",
		[55636] = "Голем Драккари",
		[55700] = "Плюющаяся кобра",
		[21749] = "Колючий хлыстолап",
		[8040] = "Леди Анакондра",
		[8056] = 7,
		[8072] = 7,
		[16188] = 7,
		[16236] = 7,
		[87189] = 2,
		[48792] = 6,
		[38621] = "Укротитель протодраконов",
		[48920] = "Король Дред",
		[2050] = 5,
		[96273] = 1,
		[72221] = 5,
		[49560] = 6,
		[105485] = 8,
		[57940] = 11,
		[20822] = "Адепт из племени Мертвой Головы",
		[2098] = 4,
		[56149] = "Ан'кахарский страж",
		[16856] = "Громила Плети",
		[58452] = 11,
		[105486] = 8,
		[63058] = 11,
		[23381] = "Леди Анакондра",
		[42780] = "Железоголов из клана Укротителей драконов",
		[67233] = "Монах Серебряного Авангарда",
		[42972] = "Стратег из клана Укротителей драконов",
		[67745] = "Черный рыцарь",
		[53463] = "Пророк Тарон'джа",
		[25780] = 2,
		[53655] = 2,
		[83098] = 8,
		[21910] = "Ремонтник Гизлок",
		[33697] = 7,
		[58517] = "Страж портала",
		[18072] = "Тарагаман Ненасытный",
		[44572] = 8,
		[87193] = 5,
		[28499] = 2,
		[67235] = "Монах Серебряного Авангарда",
		[9232] = "Верховный инквизитор Вайтмейн",
		[6673] = 1,
		[6713] = "Мелководный клешнехват",
		[91032] = "Разносчица напитков",
		[15501] = "Землеломка из племени Иглошкурых",
		[20791] = "Чернокнижник из клана Огненного Клинка",
		[20823] = "Окудник из Алого ордена",
		[589] = 5,
		[60181] = "Лазурная колдунья",
		[91800] = "Скалокрад <Блоумайвысл>",
		[16857] = 11,
		[6785] = 11,
		[18968] = "Вызыватель из Алого ордена",
		[16953] = 11,
		[31410] = "Мирмидон из клана Зловещего Плавника",
		[90905] = "Пират из Братства Справедливости",
		[11647] = "Верховный инквизитор Фэйрбанкс",
		[603] = 9,
		[50842] = 6,
		[53209] = 3,
		[67749] = "Воскрешенный Джерен Верный Солнцу",
		[21655] = "Лорд Злоязыкий",
		[21687] = "Липкая муть",
		[53657] = 2,
		[91034] = "Гоблин-надсмотрщик",
		[60182] = "Лазурная колдунья",
		[33763] = 11,
		[7057] = "Призрачный служитель",
		[56728] = "Глаз Талдарама",
		[30451] = 8,
		[635] = 2,
		[91419] = "Хрупкоребрый скелет",
		[83359] = 3,
		[92315] = 8,
		[8257] = "Ядоносный скорпид",
		[66216] = 6,
		[86814] = "Крушитель из стаи Речной Лапы",
		[91036] = "Гоблин-надсмотрщик",
		[20824] = "Геомант племени Иглошкурых",
		[43935] = "Костекрушитель из клана Укротителей драконов",
		[60503] = 1,
		[42208] = 8,
		[66217] = 6,
		[93468] = "Барон Эшбери",
		[97690] = 5,
		[91677] = "Пустулезное чудовище",
		[673] = 11,
		[41057] = "Лазурный капитан",
		[90398] = "Ветроплет из Братства Справедливости",
		[17530] = 7,
		[53595] = 2,
		[91038] = "Обезьяна-рудокоп",
		[12975] = 1,
		[79268] = 9,
		[686] = 9,
		[687] = 9,
		[43936] = "Костекрушитель из клана Укротителей драконов",
		[689] = 9,
		[22168] = "Медик зоны",
		[2782] = 11,
		[5570] = 11,
		[56858] = "Сумеречный верующий",
		[40546] = "Пикейщик Драккари",
		[18266] = "Сектант из клана Огненного Клинка",
		[91551] = 5,
		[77478] = 7,
		[81700] = 5,
		[2818] = 4,
		[88481] = "Врагорез-5000",
		[76583] = "Монах Алого ордена",
		[83108] = 1,
		[20825] = "Волшебник крови Талнос",
		[15550] = "Болотоход",
		[29077] = 8,
		[16827] = "Федя <Бондиш>",
		[54172] = 2,
		[48095] = "[*] Лютый холод",
		[21049] = "Берсерк Альянса",
		[54428] = 2,
		[23224] = "Барон Сильверлейн",
		[90913] = "Страшный попугай",
		[21337] = "Загнивший плетун",
		[19386] = 3,
		[11824] = "Сумеречный повелитель стихий",
		[17531] = 2,
		[86820] = "Добытчик из стаи Речной Лапы",
		[55964] = "Принц Талдарам",
		[11968] = "Оплавленный элементаль",
		[8041] = "Друид-змея",
		[93857] = "Барон Сильверлейн",
		[93985] = 11,
		[48096] = "Керистраза",
		[73899] = 7,
		[88484] = "Врагорез-5000",
		[50463] = 6,
		[20154] = 2,
		[89252] = "\"Капитан\" Пирожок",
		[66863] = "Эдрик Чистый",
		[67247] = "Светлый воин Серебряного Авангарда",
		[768] = 11,
		[6146] = "Колдун Алого ордена",
		[49184] = 6,
		[772] = 1,
		[8258] = "Свиностраж племени Иглошкурых",
		[57628] = "Странное видение",
		[47585] = 5,
		[49696] = "Восставший энергетический маг Драккари",
		[779] = 11,
		[783] = 11,
		[52127] = 7,
		[12544] = "Морская ведьма Непроглядной Пучины",
		[58460] = "Лазурный головорез",
		[62618] = 5,
		[17116] = 11,
		[91045] = "Огр-надзиратель",
		[54878] = "Элементаль Дракарри",
		[66865] = "Эдрик Чистый",
		[85416] = 2,
		[97954] = 1,
		[67761] = "Черный рыцарь",
		[34984] = "Болотный скат",
		[57629] = "Странное видение",
		[57821] = 8,
		[3242] = "Нестабильный опустошитель",
		[12976] = 1,
		[69041] = 5,
		[85673] = 2,
		[15087] = "Тенелов из племени Тлетворных",
		[33833] = "Жуткий провидец",
		[50401] = 6,
		[20187] = 2,
		[87081] = "Хрупкоребрый страж",
		[56926] = "Джедога Искательница Теней",
		[66867] = "Эдрик Чистый",
		[81708] = 11,
		[15407] = 5,
		[13376] = "Большой элементаль огня <Танаватонти>",
		[39207] = "Укрощенный элементаль воды",
		[53600] = 2,
		[90920] = "Страшный попугай",
		[13440] = 4,
		[66868] = 1,
		[845] = 1,
		[77487] = 5,
		[58526] = "Страж портала",
		[853] = 2,
		[81070] = 11,
		[81326] = 6,
		[29655] = 3,
		[11825] = "Механический страж",
		[51490] = 7,
		[871] = 1,
		[63900] = "Вепрь <Зурбай>",
		[3490] = "Аку'май",
		[9874] = "Каменный хранитель",
		[55968] = "Принц Талдарам",
		[11969] = "Галганн Огнемолот",
		[4971] = "Тотемист племени Иглошкурых",
		[56160] = 5,
		[4987] = 2,
		[73651] = 4,
		[35946] = "Охотник бога Драккари",
		[5019] = 5,
		[7074] = "Стенающий охранник",
		[26297] = 11,
		[56736] = "Костомол",
		[30455] = 8,
		[89388] = 3,
		[30615] = "Каменная соня",
		[10258] = "Аркедас",
		[20572] = 3,
		[55521] = "Боевой наездник Драккари",
		[8275] = "Повелитель зверей из племени Иглошкурых",
		[5171] = 4,
		[24858] = 11,
		[57952] = "[*] Трепет",
		[5211] = 11,
		[22907] = "Владыка болот Мусел'ек",
		[52067] = "Кристаллический хлестун",
		[8435] = "Леди Саревесс",
		[77747] = 7,
		[8515] = 7,
		[90925] = "Головорез из Братства Справедливости",
		[91053] = "Огр-телохранитель",
		[7386] = 1,
		[12737] = "Опытный охотник на магов",
		[3714] = 6,
		[88495] = "Врагорез-5000",
		[101033] = 7,
		[57761] = 8,
		[49637] = "Кровотролль",
		[72887] = 5,
		[69305] = 5,
		[60512] = 11,
		[15248] = "Добытчик из стаи Речной Лапы",
		[42729] = "Ингвар Расхититель",
		[13281] = "Землетряска из племени Иглошкурых",
		[53220] = 3,
		[16511] = 4,
		[90928] = "Головорез из Братства Справедливости",
		[22812] = 11,
		[11426] = 8,
		[974] = 7,
		[20925] = 2,
		[48103] = 11,
		[16959] = 11,
		[980] = 9,
		[19134] = "Костомол",
		[44457] = 8,
		[42730] = "Ингвар Расхититель",
		[7922] = 1,
		[87859] = "Глубток",
		[17439] = "Глаз Талдарама",
		[69820] = 2,
		[68285] = 11,
		[47528] = 6,
		[49639] = "Кровотролль",
		[11922] = "Удушающая лоза",
		[89267] = 5,
		[47784] = "Опытный охотник на магов",
		[11970] = "Тарагаман Ненасытный",
		[8042] = 7,
		[8050] = 7,
		[32216] = 1,
		[67774] = "Воскрешенный Джерен Верный Солнцу",
		[8122] = 5,
		[55077] = "Взбешенный ворг",
		[87861] = "Глубток",
		[24604] = 3,
		[28730] = 2,
		[8260] = "Агателос Свирепый",
		[98864] = 8,
		[8292] = "Чарлга Остробок",
		[90932] = "Кровавый волшебник из Братства Справедливости",
		[49704] = "Темнопутый паук-отшельник",
		[12466] = "Опытный охотник на магов",
		[89653] = 9,
		[89909] = "Укрощенный элементаль воды",
		[50216] = 11,
		[1064] = 7,
		[6307] = 9,
		[64801] = 11,
		[50536] = 6,
		[60835] = "Позабытый",
		[63010] = "Чемпион Штормграда",
		[48873] = "Король Дред",
		[55078] = 6,
		[8676] = 4,
		[51240] = "Восставший рыцарь смерти Драккари",
		[31801] = 2,
		[29882] = "Безумный манаплеск",
		[87096] = 1,
		[47722] = 11,
		[85433] = 2,
		[54119] = 11,
		[50089] = "Новос Призыватель",
		[67778] = "Черный рыцарь",
		[1130] = 3,
		[32409] = "[*] Слово Тьмы: Смерть",
		[1134] = 1,
		[26364] = 7,
		[81340] = 6,
		[13298] = "Плут из племени Тлетворных",
		[1160] = 1,
		[22686] = "Король Дред",
		[15473] = 5,
		[91064] = "Яростный упырь",
		[55847] = "Восставший энергетический маг Драккари",
		[47723] = "Великая ведунья Телестра",
		[51945] = 7,
		[15585] = "Лекарь Темной Крови",
		[2367] = 3,
		[33778] = 11,
		[54312] = "Гнойрон",
		[31290] = "Браконьер из стаи Речной Лапы",
		[58534] = "Хранитель портала",
		[82365] = 11,
		[17057] = 11,
		[75] = 3,
		[44461] = 8,
		[34290] = "Газ'ан",
		[95799] = 5,
		[51178] = 11,
		[53353] = 3,
		[31930] = 2,
		[90938] = "Кровавый волшебник из Братства Справедливости",
		[33395] = "Элементаль воды <Габлен>",
		[2479] = 5,
		[11971] = "Мурлок из племени Мутной Воды",
		[14034] = "Геомант из племени Каменного Свода",
		[78] = 1,
		[94009] = 1,
		[48108] = 8,
		[12051] = 8,
		[50347] = 11,
		[42223] = 9,
		[10132] = "Древний каменный хранитель",
		[5116] = 3,
		[53290] = 3,
		[90556] = "\"Капитан\" Пирожок",
		[88765] = 7,
		[33268] = 11,
		[49708] = "Темнопутый паук-отшельник",
		[20800] = "Жергош Призыватель Духов",
		[47789] = "Опытный охотник на магов",
		[67016] = 8,
		[10452] = "Земельник-скульптор",
		[47981] = "Орморок Воспитатель Дерев",
		[48045] = 5,
		[48301] = 5,
		[2643] = 3,
		[1330] = 4,
		[31547] = "Владыка болот Мусел'ек",
		[54954] = "Тикающая бомба <Стратег из клана Укротителей драконов>",
		[12739] = "Темный служитель",
		[23455] = 5,
		[51052] = 6,
		[31707] = "Элементаль воды <Тулайв>",
		[67529] = "Колосус",
		[90174] = 2,
		[31803] = 2,
		[14914] = 5,
		[51500] = 11,
		[88767] = 7,
		[33269] = 11,
		[47790] = "Опытный охотник на магов",
		[93629] = "Лорд Годфри",
		[89663] = "Кобольд-землекоп",
		[67530] = "Колосус",
		[54379] = "Гнойрон",
		[32379] = 5,
		[97340] = 5,
		[48878] = "Король Дред",
		[32731] = "Хрупкоребрый свежеватель",
		[88129] = "Глубток",
		[34933] = "Опытный охотник на магов",
		[43185] = 2,
		[18562] = 11,
		[5676] = 9,
		[7739] = "Ткач Пламени из племени Каменного Свода",
		[51693] = 4,
		[49710] = "Потрошитель Драккари",
		[5740] = 9,
		[87874] = "Глубток",
		[2895] = 7,
		[50414] = "Восставший всадник на нетопыре из Драккари",
		[92736] = 8,
		[81094] = 11,
		[55276] = "Гал'дара",
		[7947] = "Загадочная гадюка",
		[31804] = 2,
		[17539] = 7,
		[11876] = "Прогнивший топотун",
		[11892] = "Гримлок",
		[2983] = 4,
		[93505] = "Лорд Вальден",
		[11972] = "Хрупкоребрый страж",
		[9941] = "Обсидиановый часовой",
		[77769] = 3,
		[10101] = "Иронайа",
		[8147] = "Лорд Питонас",
		[6] = "Мир (огонь)",
		[8187] = "Тотем магмы <Нормасбомбас>",
		[55277] = 7,
		[71757] = 8,
		[18499] = 1,
		[57516] = 1,
		[51439] = 11,
		[55597] = "Целитель Драккари",
		[10341] = "Облученная слизь",
		[49712] = "Восставший укротитель Драккари",
		[47729] = "Великая ведунья Телестра",
		[8374] = "Сумеречный разоритель",
		[60203] = 2,
		[6268] = "Прирученный боевой вепрь <Дрессировщик из племени Иглошкурых>",
		[12548] = "Сумеречный повелитель стихий",
		[50288] = 11,
		[99] = 11,
		[52719] = "Лазурный налетчик",
		[101568] = 6,
		[59052] = 6,
		[42740] = "Заклинатель рун из клана Укротителей драконов",
		[25504] = 7,
		[100] = 1,
		[1604] = "Чемпион Штормграда",
		[88263] = 2,
		[414207] = "Восставший воин Драккари",
		[59820] = "Гнойрон",
		[47666] = 5,
		[74958] = 1,
		[15043] = "Барон Акванис",
		[45875] = 11,
		[6524] = "Землетряска из племени Иглошкурых",
		[77773] = "Провидец Алого ордена",
		[67666] = 11,
		[6572] = 1,
		[90951] = "Страж Тьмы из Братства Справедливости",
		[6660] = "Прокаженный защитник",
		[88521] = "Врагорез-5000",
		[51505] = 7,
		[55663] = "Люторог Драккари",
		[47731] = "Великая ведунья Телестра",
		[62124] = 2,
		[15571] = 3,
		[3391] = "Монах Алого ордена",
		[6788] = 5,
		[15667] = "Сатир из племени Тлетворных",
		[88522] = "Врагорез-5000",
		[70483] = 5,
		[56815] = 6,
		[17253] = "Волк <Мупхсинка>",
		[13812] = 3,
		[67541] = "Маршал Якоб Алерий",
		[67669] = 2,
		[9798] = "Облученный погромщик",
		[86604] = "Дробитель",
		[51698] = 4,
		[49715] = "Громила Плети",
		[1752] = 4,
		[26017] = 2,
		[73427] = 5,
		[50163] = 6,
		[20004] = 7,
		[1766] = 4,
		[7068] = "Тоскующий мертвец",
		[42231] = 11,
		[34171] = "Болотный скат",
		[105284] = 7,
		[34299] = 11,
		[40504] = "Бритвохлест",
		[1784] = 4,
		[7164] = "Иглостраж-воитель",
		[22595] = "Ползучий слякоч",
		[68055] = 2,
		[57648] = "Странное видение",
		[90956] = "Страж Тьмы из Братства Справедливости",
		[59887] = 5,
		[79058] = 8,
		[14516] = "Убийца из стаи Речной Лапы",
		[7268] = 8,
		[3639] = "Солдат Алого ордена",
		[1822] = 11,
		[25058] = "Капеллан Алого ордена",
		[5277] = 4,
		[31704] = "Черная Охотница",
		[15785] = "Послушница из племени Мертвой Головы",
		[31429] = "Коготь",
		[34298] = "Коготь",
		[8599] = "Лакей-болванчик",
		[31551] = "Всадник на протодраконе",
		[54962] = "Стратег из клана Укротителей драконов",
		[1850] = 11,
		[55090] = 6,
		[116] = 8,
		[1856] = 4,
		[14032] = "Дознаватель Вишас",
		[31615] = "Владыка болот Мусел'ек",
		[7384] = 1,
		[5405] = 8,
		[5413] = "Бес-осквернитель",
		[55602] = "Непреклонный душитель",
		[86736] = "Дробитель",
		[90958] = "Страж Тьмы из Братства Справедливости",
		[59888] = 5,
		[88819] = 2,
		[83154] = 8,
		[703] = 4,
		[15716] = "Газ'ан",
		[10966] = "Ноксион",
		[118] = 8,
		[32223] = 2,
		[67546] = "Маршал Якоб Алерий",
		[34268] = "Газ'ан",
		[24131] = 3,
		[29427] = "Лекарь Темной Крови",
		[50421] = 6,
		[48438] = 11,
		[20165] = 2,
		[50613] = 6,
		[88453] = 3,
		[3815] = "Аку'май",
		[79061] = 11,
		[15284] = "Лазурный головорез",
		[5605] = "Оракул из племени Каменного Свода",
		[50997] = "Керистраза",
		[120] = 8,
		[22887] = "Копейщик из племени Темной Крови",
		[57330] = 6,
		[49206] = 6,
		[20549] = 2,
		[34423] = "Лекарь Темной Крови",
		[85509] = 2,
		[5677] = 7,
		[86738] = "Жестокий убийца",
		[90960] = "Страж Тьмы из Братства Справедливости",
		[91088] = "Пожиратель трупов",
		[36554] = 4,
		[20805] = "Лорд Питонас",
		[54648] = 8,
		[1943] = 4,
		[15572] = "Иглостраж-воитель",
		[122] = 8,
		[34874] = "Топеглад",
		[15620] = "Следопыт Альянса",
		[52419] = 6,
		[60067] = "Командир Альянса",
		[56222] = 6,
		[36093] = "Восставший воин Драккари",
		[56453] = 3,
		[48503] = 11,
		[59754] = 6,
		[32065] = "Болотоход",
		[49576] = 6,
		[79063] = 2,
		[93520] = "Лорд Годфри",
		[1978] = 3,
		[54131] = "Котёнок <Энилин>",
		[13797] = 3,
		[13813] = 3,
		[25603] = "Сумеречный летописец",
		[7948] = "Загадочный шаркун",
		[53365] = 6,
		[13877] = 4,
		[54149] = 2,
		[20050] = 2,
		[86740] = "Буйный смутьян",
		[90962] = "Страж Тьмы из Братства Справедливости",
		[8004] = 7,
		[19750] = 2,
		[31665] = 4,
		[51701] = 4,
		[91021] = 4,
		[25914] = 2,
		[32192] = "Оракул из племени Темной Крови",
		[81751] = 5,
		[34161] = "Скрытень Нижетопи",
		[8076] = 7,
		[89775] = 4,
		[8092] = 5,
		[36094] = "Восставший воин Драккари",
		[25912] = 2,
		[15548] = "Свиностраж племени Иглошкурых",
		[16244] = "Надзиратель из клана Укротителей драконов",
		[55220] = "Дух люторога <Гал'дара>",
		[424340] = "Большой элементаль огня <Лагрож>",
		[8148] = "Загадочный опустошитель",
		[54965] = "Заклинатель рун из клана Укротителей драконов",
		[6117] = 8,
		[55249] = "Гал'дара",
		[49016] = 6,
		[88148] = 8,
		[12294] = 1,
		[55250] = "Гал'дара",
		[2060] = 5,
		[64904] = 5,
		[30849] = "Убийца магов",
		[55605] = "Непреклонный душитель",
		[49528] = "Пророк Тарон'джа",
		[55348] = "Боевой наездник Драккари",
		[48400] = "Ледяная могила",
		[48287] = "Слад'ран",
		[47737] = "Хаотический разлом <Аномалус>",
		[24932] = 11,
		[49380] = "Кровотролль",
		[6253] = "Восставший укротитель Драккари",
		[55635] = "Голем Драккари",
		[54819] = "Элементаль Дракарри",
		[77787] = "Орденоносец Алого ордена",
		[2120] = 8,
		[133] = 8,
		[54237] = "Гнойрон",
		[49711] = "Восставший укротитель Драккари",
		[2136] = 8,
		[48505] = 11,
		[91778] = "Кишколиц <Гладрокс>",
		[93697] = "Лорд Вальден",
		[23602] = 1,
		[49807] = "Командир Драккари",
		[54966] = "Заклинатель рун из клана Укротителей драконов",
		[88839] = "Адмирал Терзающий Рев",
		[59914] = 8,
		[136] = 3,
		[31713] = "Заступник из Алого ордена",
		[67781] = "[*] Осквернение",
		[17619] = 5,
		[5221] = 11,
		[51470] = 7,
		[45477] = 6,
		[67808] = "Черный рыцарь",
		[68321] = "Маршал Якоб Алерий",
		[57781] = "Странное видение",
		[55798] = "Охотник бога Драккари",
		[49721] = "Восставший рыцарь смерти Драккари",
		[139] = 5,
		[67725] = "Черный рыцарь",
		[17800] = 9,
		[66905] = 2,
		[8936] = 11,
		[87896] = "Глубток",
		[6533] = "Гелихаст",
		[20007] = 2,
		[66862] = "Эдрик Чистый",
		[36032] = 8,
		[96206] = 11,
		[34941] = "Жрица Серебряного Авангарда",
		[20167] = 2,
		[9080] = "Жестокий убийца",
		[15237] = 5,
		[88009] = "Глубток",
		[66787] = 1,
		[57949] = "Глашатай Волаж",
		[16870] = 11,
		[55095] = 6,
		[97691] = 5,
		[50702] = "Лазурный чароплет",
		[25054] = "Верховный инквизитор Вайтмейн",
		[68301] = "Маршал Якоб Алерий",
		[9256] = "Верховный инквизитор Вайтмейн",
		[88836] = "Адмирал Терзающий Рев",
		[59637] = "Зеркальное изображение <Кулатта>",
		[13398] = "Прокаженный техник",
		[770] = 11,
		[50653] = "Порабощенный протодракон",
		[57846] = "Громила из клана Мош'Огг",
		[49722] = "Порабощенный протодракон",
		[55927] = "Огненная сфера",
		[93527] = "Лорд Вальден",
		[93655] = "Анжинер Термоштепсель",
		[50799] = 2,
		[64371] = 9,
		[9464] = "Колючий хлыстолап",
		[67724] = "Черный рыцарь",
		[2139] = 8,
		[97341] = 1,
		[3166] = 5,
		[91776] = "Кишколиц <Гладрокс>",
		[33661] = "Восставший воин Драккари",
		[44413] = 8,
		[2948] = 8,
		[43665] = "Всадник на протодраконе",
		[68504] = "Маршал Якоб Алерий",
		[93400] = 11,
		[49678] = "Вурдалак-мучитель",
		[57941] = "Глашатай Волаж",
		[47774] = "Берсерк Альянса",
		[55627] = "Живое колдунство",
		[87899] = "Глубток",
		[55563] = "Землетряс Драккари",
		[17941] = 9,
		[90047] = "Заклинательница из Братства Справедливости",
		[39104] = 7,
		[59638] = "Зеркальное изображение <Кулатта>",
		[86620] = "Дробитель",
		[52752] = 7,
		[77830] = 7,
		[45470] = 6,
		[49723] = "Восставший рыцарь смерти Драккари",
		[11986] = "Шаман Огненной пропасти",
		[8259] = "Копьешкур из племени Иглошкурых",
		[78674] = 11,
		[48846] = 11,
		[54137] = "Ксевозз",
		[40505] = "Огглфлинт",
		[12039] = "Аббат Алого ордена",
		[52212] = 6,
		[60089] = 11,
		[51185] = 11,
		[55582] = "Целитель Драккари",
		[56632] = "Ан'кахарский веретенщик",
		[90559] = "\"Капитан\" Пирожок",
		[68436] = 5,
		[12167] = "Лорд Серпентис",
		[11431] = "Лорд Питонас",
		[93402] = 11,
		[49020] = 6,
		[67722] = "Черный рыцарь",
		[10] = 8,
		[20424] = 2,
		[87901] = "Глубток",
		[5782] = 9,
		[58470] = "Лазурный ловец",
		[57912] = "Оборонительная система",
		[43931] = "Порабощенный протодракон",
		[2580] = 7,
		[8281] = "Большой лабиринтовый нетопырь",
		[45438] = 8,
		[57784] = "Странное видение",
		[60343] = 2,
		[49724] = "Командир Драккари",
		[8361] = "Чарлга Остробок",
		[14518] = "Командор Алого ордена Могрейн",
		[51963] = "Вороная горгулья <Гладрокс>",
		[12550] = "Лоргус Джетт",
		[33668] = 1,
		[54202] = "Ксевозз",
		[43664] = "Укротитель протодраконов",
		[8242] = "Головорез из клана Огненного Клинка",
		[84993] = 1,
		[41425] = 8,
		[91213] = "Безмозглый ужас",
		[63148] = "Командор Алого ордена Могрейн",
		[339] = 11,
		[101168] = 7,
		[101423] = 2,
		[47780] = "Оруженосец",
		[53301] = 3,
		[54970] = "Слад'ран",
		[17290] = "Сумеречный верующий",
		[55098] = "Мураби",
		[55610] = 6,
		[23038] = "Волшебник крови Талнос",
		[68445] = 1,
		[55050] = 6,
		[50572] = "Лазурный чароплет",
		[56969] = "Лазурный чешуеплет",
		[90929] = "Головорез из Братства Справедливости",
		[57657] = "Странное видение",
		[55218] = "Гал'дара",
		[50422] = 6,
		[64901] = 5,
		[31403] = "Командир Альянса",
		[331] = 7,
		[19506] = 3,
		[58504] = "Страж портала",
		[8921] = 11,
		[172] = 9,
		[60344] = 2,
		[20295] = "Леди Анакондра",
		[17962] = 9,
		[88288] = "Болванчик",
		[16914] = 11,
		[6795] = 11,
		[8376] = "Тотемист племени Иглошкурых",
		[56698] = "Ан'кахарский метатель заклинаний",
		[9081] = "Тенегорнский черный маг",
		[44544] = 8,
		[22959] = 8,
		[65142] = 6,
		[15286] = 5,
		[48894] = "Шаман Драккари",
		[93691] = "[*] Осквернение",
		[2812] = 2,
		[32739] = 11,
		[60103] = 7,
		[88161] = 1,
		[9257] = "Командор Алого ордена Могрейн",
		[8365] = "Сумеречный летописец",
		[63735] = 5,
		[100955] = 7,
		[20178] = 2,
		[3583] = "Изворотливый вор",
		[46202] = "Плотоядный вурдалак",
		[49548] = "Пророк Тарон'джа",
		[55931] = "Принц Талдарам",
		[93535] = "Лорд Вальден",
		[585] = 5,
		[63529] = 2,
		[64343] = 8,
		[73066] = 5,
		[9481] = "Верховный инквизитор Вайтмейн",
		[48191] = "Следопыт Альянса",
		[50302] = "Кристаллический заступник",
		[67719] = "Черный рыцарь",
		[10252] = "Аркедас",
		[86627] = 1,
		[2908] = 11,
		[2912] = 11,
		[2944] = 5,
		[56891] = "Джедога Искательница Теней",
		[46989] = 8,
		[83301] = 8,
		[48895] = "Шаман Драккари",
		[586] = 5,
		[59578] = 2,
		[19434] = 3,
		[77800] = 7,
		[63544] = 5,
		[12536] = 8,
		[57531] = 8,
		[51454] = "Лазурный инквизитор",
		[85948] = 6,
		[16408] = 2,
		[21833] = "Ремонтник Гизлок",
		[16006] = "Ревелош",
		[41056] = "Лазурный капитан",
		[43650] = "Далронн Контролирующий",
		[83302] = 8,
		[11976] = "Трогг Огненной пропасти",
		[63560] = 6,
		[89420] = 9,
		[42705] = "Ингвар Расхититель",
		[30213] = "Джутеми <Иварик>",
		[35395] = 2,
		[16166] = 7,
		[50132] = "Убийца магов",
		[67718] = "Черный рыцарь",
		[43651] = "Скарвальд Строитель",
		[35570] = "Надзиратель из клана Укротителей драконов",
		[16246] = 7,
		[3044] = 3,
		[46657] = 11,
		[70893] = 3,
		[81256] = 6,
		[89652] = "Огр-надзиратель",
		[83559] = 3,
		[83582] = 8,
		[48054] = "Безумный манаплеск",
		[71661] = 5,
		[47765] = "[*] Гравитационный колодец",
		[67823] = "Черный рыцарь",
		[8265] = "Тотем лавы <Оракул из племени Каменного Свода>",
		[61882] = 7,
		[8282] = "Верховный инквизитор Фэйрбанкс",
		[57724] = 7,
		[28902] = "Сумеречный апостол",
		[61336] = 11,
		[11366] = 8,
		[8362] = "Оракул из племени Мутной Воды",
		[12472] = 8,
		[62626] = 11,
		[6254] = "Шкам",
		[55624] = "Охотник бога Драккари",
		[60347] = 7,
		[12471] = "Призыватель огня из племени Змеящегося Корня",
		[69743] = 1,
		[33667] = 11,
		[53385] = 2,
		[91562] = "Смрадный вурдалак",
		[31661] = 8,
		[56701] = "Ан'кахарский метатель заклинаний",
		[527] = 5,
		[82921] = 3,
		[57942] = "Глашатай Волаж",
		[81130] = 6,
		[31589] = 8,
		[22568] = 11,
		[33721] = 7,
		[42702] = "Туннельный вурдалак",
		[31717] = "Черная Охотница",
		[81022] = 11,
		[12355] = 8,
		[9128] = "Властитель Злоклык",
		[42724] = "Оружейник из клана Укротителей драконов",
		[633] = 2,
		[34914] = 5,
		[49537] = "Пророк Тарон'джа",
		[50378] = "Воскреситель из Плети",
		[57655] = "Странное видение",
		[64058] = 5,
		[23881] = 1,
		[3248] = "Защитник из племени Иглошкурых",
		[67032] = 1,
		[15063] = "Стужень",
		[88490] = "Врагорез-5000",
		[49703] = "Гнусный изрыгатель",
		[67570] = 5,
		[8986] = "Блуждающий фантазм",
		[8393] = "Колючий членистоног",
		[60833] = "Позабытый",
		[9034] = "Дознаватель Вишас",
		[50705] = "Детеныш лазурного дракона",
		[11113] = 8,
		[11129] = 8,
		[47773] = "Великая ведунья Телестра",
		[54847] = "Элементаль Дракарри",
		[47755] = 5,
		[81021] = 11,
		[89007] = 5,
		[54158] = 2,
		[34428] = 1,
		[36808] = "Опытный охотник на магов",
		[57647] = "Странное видение",
		[88169] = "Глубток",
		[1082] = 11,
		[63675] = 5,
		[543] = 8,
		[53351] = 3,
		[3356] = "Галганн Огнемолот",
		[22427] = "Оружейник из клана Укротителей драконов",
		[6726] = "Лазурный хранитель",
		[10072] = "Обсидиановый часовой",
		[6742] = "Псарь Локси",
		[2024] = 1,
		[49034] = "Новос Призыватель",
		[45529] = 6,
		[5118] = 3,
		[60341] = 2,
		[9482] = "Галганн Огнемолот",
		[50334] = 11,
		[21067] = "Ядовитый грелль",
		[20271] = 2,
		[55530] = "Люторог Драккари",
		[50498] = "Ящер <Афигенная>",
		[12611] = "Жуткий провидец",
		[88084] = "Зеркальное изображение <Подорванец>",
		[82925] = 3,
		[48707] = 6,
		[58693] = "Синигоса",
		[81262] = 11,
		[55040] = "Опытный охотник на магов",
		[55104] = "Мураби",
		[5229] = 11,
		[33891] = 11,
		[77808] = "Псарь Локси",
		[67701] = "Лана Твердомолот",
		[13864] = "Медик зоны",
		[53751] = 2,
		[90602] = "\"Капитан\" Пирожок",
		[68213] = 5,
		[21707] = "Ноксион",
		[9906] = "Нефритовый василиск",
		[51714] = 6,
		[17741] = "Лазурный хранитель",
		[47748] = "Аномалус",
		[3826] = "Оберег лености <Знахарь из клана Мош'Огг>",
		[60158] = "Лазурный налетчик",
		[413841] = 8,
		[45957] = 11,
		[7038] = 1,
		[92266] = "Облученный погромщик",
		[7054] = "Замученный офицер",
		[88300] = "Болванчик",
		[56640] = "Ан'кахарский веретенщик",
		[90603] = "\"Капитан\" Пирожок",
		[413843] = 8,
		[80861] = 11,
		[3827] = "Знахарь из клана Мош'Огг",
		[59071] = 11,
		[44614] = 8,
		[24394] = "Волк <Алстейн>",
		[66935] = "Эдрик Чистый",
		[48053] = "Кристаллический хлестун",
		[50198] = "Посвященный охотник на магов",
		[68338] = 5,
		[55233] = 6,
		[8267] = "Гниющий агам'ар",
		[100977] = 11,
		[32908] = "Разрыватель сердец из клана Укротителей драконов",
		[3600] = "Тотем оков земли <Лагрож>",
		[90604] = "\"Капитан\" Пирожок",
		[8858] = "Техник зоны",
		[10346] = "Механотанк",
		[57514] = 1,
		[49668] = "Хрустальный укротитель",
		[413848] = 3,
		[57984] = "Большой элементаль огня <Танаватонти>",
		[5215] = 11,
		[93675] = "Лорд Годфри",
		[16346] = "Гнусный изрыгатель",
		[19503] = 3,
		[7294] = 2,
		[54274] = 9,
		[58688] = "Синигоса",
		[21068] = "Бес-осквернитель",
		[64701] = 7,
		[90605] = "\"Капитан\" Пирожок",
		[7342] = "Загадочный плеточник",
		[48517] = 11,
		[89263] = "\"Капитан\" Пирожок",
		[43649] = "Далронн Контролирующий",
		[54850] = "Колосс Драккари",
		[10666] = "Земельник-комендант",
		[96231] = 2,
		[12746] = "Чернокнижник из клана Огненного Клинка",
		[55106] = "Мураби",
		[3716] = "Зангдоко <Кромго>",
		[1079] = 11,
		[12809] = 1,
		[68212] = 5,
		[91420] = "Хрупкоребрый скелет",
		[47743] = "Аномалус",
		[51460] = 6,
		[79102] = 2,
		[32244] = 3,
		[56581] = "Глубинный ползун",
		[82930] = 8,
		[87152] = 5,
		[47750] = 5,
		[67194] = "Жрица Серебряного Авангарда",
		[51972] = "Кристаллическая грация",
		[5487] = 11,
		[69369] = 11,
		[54211] = "Бесплотная сфера <Ксевозз>",
		[1066] = 11,
		[67706] = "Лана Твердомолот",
		[8680] = 4,
		[66896] = 1,
		[74720] = "Анжинер Термоштепсель",
		[51587] = "Спиритуалист из клана Укротителей драконов",
		[48518] = 11,
		[46968] = 1,
		[56641] = 3,
		[56898] = "Сумеречный черный маг",
		[66811] = 1,
		[8262] = "Ведунья из племени Мертвой Головы",
		[47753] = 5,
		[413861] = 3,
		[49527] = "Пророк Тарон'джа",
		[81297] = 2,
		[90096] = "[*] Взрыв",
		[88177] = "Глубток",
		[89906] = 2,
		[9275] = "Истязатель из Алого ордена",
		[37132] = "Лазурный волхв",
		[24907] = 11,
		[53148] = "Вепрь <Зурбай>",
		[47751] = "Аномалус",
		[15496] = "Разоритель из пещерных глубин",
		[45768] = 2,
		[93423] = "Барон Эшбери",
		[39627] = 5,
		[9435] = "Чародей Доан",
		[56131] = 5,
		[324] = 7,
		[48263] = 6,
		[50182] = "Опытный охотник на магов",
		[56643] = "Ан'кахарский измельчитель",
		[21069] = "Мерзкая личинка",
		[56707] = "Чумоброд",
		[48391] = 11,
		[58690] = "Синигоса",
		[50566] = "Лазурный чароплет",
		[11642] = "Адепт Алого ордена",
		[80886] = 11,
		[71] = 1,
		[93424] = "[*] Удушить",
		[48017] = "Орморок Воспитатель Дерев",
		[1133] = 8,
		[81016] = 11,
		[8142] = "Вердан Вечноживущий",
		[47668] = "Страж Драккари",
		[90098] = "Лакей-болванчик",
		[67709] = "Лана Твердомолот",
		[55428] = 8,
		[55748] = 6,
		[13897] = 7,
		[25771] = 2,
		[15976] = "Бритвохлест",
		[90994] = "Землекоп из Братства Справедливости",
		[51886] = 7,
		[47688] = "Хаотический разлом",
		[9143] = "Ремонтник Гизлок",
		[57994] = 7,
		[5176] = 11,
		[58179] = 11,
		[30153] = "Джутеми <Иварик>",
		[33743] = 8,
		[12042] = 8,
		[67710] = "Лана Твердомолот",
		[86261] = 8,
		[47944] = "[*] Кристальный шип",
		[56580] = "Глубинный ползун",
		[30482] = 8,
		[56708] = 11,
		[48058] = "Кристаллический хлестун",
		[3606] = "Опаляющий тотем <Кноккз>",
		[50759] = "Нестабильная сфера",
		[8150] = "Мутанус Пожиратель",
		[47747] = "Аномалус",
		[9770] = "Облученный погромщик",
		[30633] = "Кристаллический заступник",
		[48583] = "Скарвальд Строитель",
		[44425] = 8,
		[528] = 5,
		[51271] = 6,
		[2061] = 5,
		[51399] = 6,
		[8268] = "Гниющий агам'ар",
		[81269] = 11,
		[49544] = "Пророк Тарон'джа",
		[30931] = "Аггем Терновое Проклятие",
		[49222] = 6,
		[81017] = 11,
		[8364] = "Морская ведьма Непроглядной Пучины",
		[21062] = "Сатир из племени Тлетворных",
		[8264] = "Оракул из племени Каменного Свода",
		[58180] = 11,
		[17364] = 7,
		[90923] = "Головорез из Братства Справедливости",
		[22187] = "Капеллан Алого ордена",
		[13165] = 3,
		[48265] = 6,
		[56130] = "Старейшина Надокс",
		[25228] = 9,
		[56645] = "Ан'кахарский измельчитель",
		[56709] = "Чумоброд",
		[74434] = 9,
		[6343] = 1,
		[50933] = "Плотоядный вурдалак",
		[63106] = 9,
		[34913] = 8,
		[21390] = "Лорд Злоязыкий",
		[17] = 5,
		[34945] = "Медик зоны",
		[56702] = "Ан'кахарский метатель заклинаний",
		[2383] = 9,
		[14873] = "Баззалан",
		[51336] = "Дракос Дознаватель",
		[3636] = "Нефритовый василиск",
		[62078] = 11,
		[57669] = 2,
		[3604] = "Загадочный кроколиск",
		[49609] = 2,
		[55501] = 8,
		[8272] = "Землеломка из племени Иглошкурых",
		[50155] = "Керистраза",
		[90560] = "\"Капитан\" Пирожок",
		[93685] = "Командир Спрингвейл",
		[15801] = "Ревелош",
		[12057] = "Земельник-камнекрушитель",
		[87532] = "Сумеречный призрак <Ваилетжизни>",
		[3018] = 1,
		[8988] = "Чародей Доан",
		[48266] = 6,
		[52424] = 6,
		[89769] = "Порох",
		[36176] = "Жрица Серебряного Авангарда",
		[56710] = "Чумоброд",
		[56646] = "Ан'кахарский измельчитель",
		[12540] = "Сатир из племени Тлетворных",
		[32553] = 9,
		[28491] = 11,
		[54983] = "Укротитель протодраконов",
		[73531] = 5,
		[91050] = "Огр-телохранитель",
		[81660] = 5,
		[12470] = "Волшебник крови Талнос",
		[94472] = 5,
		[13338] = "Сумеречный черный маг",
		[83381] = "Волк <Алстейн>",
		[1161] = 1,
		[51987] = 6,
		[61295] = 7,
		[45334] = 11,
		[75999] = 5,
		[15497] = "Скелет колдуна",
		[16689] = 11,
		[20815] = "Предсказатель из Алого ордена",
		[90557] = "\"Капитан\" Пирожок",
		[93687] = "Командир Спрингвейл",
		[54719] = "Колосс Драккари",
		[81661] = 5,
		[81170] = 11,
		[57825] = "Стужень",
		[67716] = "Маршал Якоб Алерий",
		[6807] = 11,
		[9532] = "Шаман Огненной пропасти",
		[91565] = 11,
		[55959] = "Принц Талдарам",
		[23246] = 1,
		[29419] = "Ремонтник Гизлок",
		[38232] = "Надзиратель из клана Укротителей драконов",
		[17201] = "Селебрийская дриада",
		[13738] = "Смертехват Драккари",
		[73090] = 5,
		[7645] = "Вестник смерти Джаргба",
		[15290] = 5,
		[54049] = "Мадхоно <Жесткобахаю>",
		[42746] = "Ан'кахарский измельчитель",
		[774] = 11,
		[88501] = "Врагорез-5000",
		[31818] = 9,
		[31850] = 2,
		[50227] = 1,
		[2457] = 1,
		[31946] = "Владыка болот Мусел'ек",
		[45517] = 11,
		[588] = 5,
		[51124] = 6,
		[55342] = 8,
		[6770] = 4,
		[25997] = 2,
		[52042] = 7,
		[31935] = 2,
		[56716] = "Стужень",
		[12043] = 8,
		[50251] = 11,
		[32330] = "Оса ликулла",
		[58567] = 1,
		[10060] = 5,
		[68230] = 5,
		[10092] = "Песчаная буря <Древний каменный хранитель>",
		[7965] = "Лорд Кобран",
		[55703] = "Плюющаяся кобра",
		[879] = 2,
		[79105] = 5,
		[81280] = "Кровавый червь <Кокк-Хроми>",
		[33702] = 9,
		[30108] = 9,
		[26573] = 2,
		[54226] = "Ксевозз",
		[2565] = 1,
		[8221] = 7,
		[49143] = 6,
		[49356] = "Пророк Тарон'джа",
		[8269] = "Облученный погромщик",
		[8285] = "Агателос Свирепый",
		[10348] = "Прокаженный техник",
		[91004] = "Заклинательница из Братства Справедливости",
		[105461] = 8,
		[8349] = 7,
		[93435] = 3,
		[49868] = 5,
		[10444] = 7,
		[45902] = 6,
		[73477] = 1,
		[87098] = 8,
		[12555] = "Воин зоны",
		[33876] = 11,
		[73989] = 5,
		[17843] = "Священник Альянса",
		[2645] = 7,
		[2649] = "Федя <Бондиш>",
		[23247] = 5,
		[17195] = "Укрощенный элементаль огня",
		[79683] = 8,
		[92735] = 8,
		[79107] = 5,
		[36563] = 4,
		[7399] = "Загадочный страхозуб",
		[46012] = 11,
		[49037] = "Новос Призыватель",
		[8391] = "Хрустогрыз Аку'мая",
		[88063] = 2,
		[96379] = 9,
		[70890] = 6,
		[80964] = 11,
		[25742] = 2,
		[55626] = "Живое колдунство",
		[90555] = "\"Капитан\" Пирожок",
		[49613] = 2,
		[17682] = "Посвященный охотник на магов",
		[91706] = "Джутеми <Иварик>",
		[49805] = "Воскреситель из Плети",
		[67254] = "Монах Серебряного Авангарда",
		[8185] = 7,
		[43265] = 6,
		[80965] = 11,
		[5697] = 9,
		[67594] = "Лана Твердомолот",
		[8989] = "Ирод",
		[9005] = 11,
		[88448] = 9,
		[67542] = "Маршал Якоб Алерий",
		[49821] = 5,
		[348] = 9,
		[5568] = "Каменный хранитель",
		[84994] = 1,
		[55599] = "Целитель Драккари",
		[94686] = 2,
		[34517] = "Чародей Доан",
		[56733] = "Глаз Талдарама",
		[13446] = "Прогнивший топотун",
		[14517] = "Орденоносец Алого ордена",
		[32747] = 2,
		[13323] = "Чародей Доан",
		[2825] = 7,
		[94462] = 9,
		[38056] = 11,
		[355] = 1,
		[66188] = 6,
		[73747] = 5,
		[57802] = "Странное видение",
		[59913] = 3,
		[71914] = 5,
		[15530] = "Лазурный волхв",
		[51917] = "Вурдалак-мучитель",
		[2974] = 3,
		[49998] = 6,
		[52109] = 7,
		[50461] = 6,
		[744] = "Баззалан",
		[33878] = 11,
		[94463] = 7,
		[1449] = 8,
		[1120] = 9,
		[379] = 7,
		[56715] = "Бесчинствующий упырь",
		[17139] = "Священник Альянса",
		[9613] = "Провидец Алого ордена",
		[83077] = 3,
		[1463] = 8,
		[48847] = 6,
		[16000] = "Селебрийская дриада",
		[3110] = "Кузтуке <Эфо>",
		[5217] = 11,
		[48865] = 11,
		[21331] = "Загнивший плетун",
		[7951] = "Загадочный крылояд",
		[11820] = "Механический страж",
		[7967] = "Мутанус Пожиратель",
		[31884] = 2,
		[47779] = "Оруженосец",
		[2973] = 3,
		[42463] = 2,
		[47632] = 6,
		[47696] = "Безумный манаплеск",
		[91394] = 8,
		[91522] = "Страшный ползун",
		[11980] = "Жергош Призыватель Духов",
		[93825] = 3,
		[48016] = "Орморок Воспитатель Дерев",
		[52128] = 7,
		[57755] = 1,
		[48101] = 11,
		[33943] = 11,
		[67751] = "Черный рыцарь",
		[10061] = "Обсидиановый часовой",
		[53] = 4,
		[10093] = "Песчаная буря <Древний каменный хранитель>",
		[19975] = 11,
		[3045] = 3,
		[56862] = "Укрощенный элементаль воды",
		[66987] = 5,
		[33143] = 5,
		[1953] = 8,
	},
	["shield_spellid_cache"] = {
	},
	["latest_encounter_spell_pool_access"] = 1715417907,
	["auto_open_news_window"] = true,
	["encounter_journal_cache"] = {
	},
	["got_first_run"] = true,
	["breakdown_general"] = {
		["font_size"] = 11,
		["font_color"] = {
			0.9, -- [1]
			0.9, -- [2]
			0.9, -- [3]
			0.923, -- [4]
		},
		["font_face"] = "DEFAULT",
		["font_outline"] = "NONE",
		["bar_texture"] = "Skyline",
	},
	["raid_data"] = {
	},
	["spell_category_latest_sent"] = 0,
	["merge_pet_abilities"] = false,
	["custom"] = {
		{
			["source"] = false,
			["tooltip"] = "				local actorObject, combatObject, instanceObject = ...\n\n				local iconSize = 20\n				\n				local buffUptimeContainer = actorObject:GetSpellContainer(\"buff\")\n				if (buffUptimeContainer) then\n					for spellId, potionPower in pairs(LIB_OPEN_RAID_ALL_POTIONS) do\n						local spellTable = buffUptimeContainer:GetSpell(spellId)\n						if (spellTable) then\n							local used = spellTable.activedamt\n							if (used and used > 0) then\n								local spellName, _, spellIcon = GetSpellInfo(spellId)\n								GameCooltip:AddLine(spellName, used)\n								GameCooltip:AddIcon(spellIcon, 1, 1, iconSize, iconSize)\n								Details:AddTooltipBackgroundStatusbar()\n							end\n						end\n					end\n				end\n			",
			["import_string"] = "1EvBVnkoq4FlxKwDWDjCn6Q0kfD7kL(YwruUMOLK7JaoGPX3rSrgZwLV4F73yJ5LMxjPDfBBzHXZZZmEMhg7p0FHVxoRGhH9x57HkeRzCFVhWcejn)x89YWWROIG8iojt47LYIqPYWFGslW9LHcwM(3cuk83i2MvibCdHMlq0iSm8lYqhhh5e5e9s0pydsS2jjLX4w6hAREnhlk4uzyVEYWbdYfCc9fNeghm2Q3NCgM0RVb2)qd3Vn8MBSvohwYN6P8GCIVxmopY3ZBn7vz4RRzkMid3cXNmKJiXYWICm8BKmmJjim4LXfkKGyynqomnIvqfyUJVNgLpG4UkW2pQljV6Fg2tIyu)Nh(N3(5H367rrBW(EZn8CjqCyRkdNMsIv7vce)fSqD3oCSKnZw9V4ifNIkYfSn3ZOWwkfZBXYstA4Qz9vrvzmI2OYiAJUPV5hfBhmaq3K22qYJalJemUcEds1omLKlMLSuqsjITJvwLR9xBIo6jSq)QPGXwp84IXUt9cgVyX3DVB5Ihd(BxV7TlXnMzGfYLzJKtsuOg03qGQGsTXtYqeEU1bWhs(GBMidlVgmGrt3cffPOTaX1l(foRiRXesIm0QfcJCZFszXC9sSST1KI2SGQltsy13G8yC1Uje9jO0C8(MV)tANP17)a3XRksacvKjiBWVjNFe4lxXsT911cAE0oMGnbpfc1wy1RCH9S33Z6mYb97rZfnHuv7hdCscdQrbFfHO)Qq3IcScEqghBSd2CZzQkxrEtfjrDF6ROTWFhECSmjaniTs)hK41jG6kWVn7(LEbZNTWD2ZbUpyFCC0PJwOC2Kq1LUFtZjZD)(jJNQR9kOe8c85xMMMqRTm8Vay6mjBiBMgSoqqmn(8gnyakoUzpvu1BB6ep763rDB0444)rPU2UvTVoqNCr88WKVl9MxAN5v2xEYUYRPNulJQJb34(vFFCo71k9WsT0PU3fmB(Jph89XUpemE6utVH3okQNPBuJZc0Q0YpvEYwrdNS7yTDJRV4IBd5kNr4lTzPdSBq(bogTr0D3PPJzGdA9ShFf(a6fZStPvOD7f7PRu(4eX4x1QdxDOTRcZ1fwDs05891)SLTUszmvoXU7EVtjJtA07rBSujQvz2zlnAnRz1Th(BHVHb6)t5tGPdlh3EuZC3hCCw942ibCkJvfc9rFemwQGKvpf9Bt87mt9XMGUEK33POENfX)5iA)HksFPIYVtr4par32H)ZWHW6xE8IYqmYixwf5U0e2f8jQNqQ0NUut1KpfYIwTbQJD474gfRSQ5NAEhZpMdY7yQUDsb8cwJjVSwC632boywTc)fLo4ou0)Po2engoDQOiFfcoy07rCPQ12x47))d",
			["author"] = "Terciob",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				value = math.floor(value)\n				return \"\"\n			",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return math.floor(value) .. \" \"\n			",
			["script"] = "				local combatObject, customContainer, instanceObject = ...\n				local total, top, amount = 0, 0, 0\n				\n				--get the misc actor container\n				local listOfUtilityActors = combatObject:GetActorList(DETAILS_ATTRIBUTE_MISC)\n				\n				--do the loop:\n				for _, actorObject in ipairs(listOfUtilityActors) do\n					--only player in group\n					if (actorObject:IsGroupPlayer()) then\n						local bFoundPotion = false\n						\n						--get the spell debuff uptime container\n						local debuffUptimeContainer = actorObject:GetSpellContainer(\"debuff\")\n						if (debuffUptimeContainer) then\n							--potion of focus (can't use as pre-potion, so, its amount is always 1\n							local focusPotion = debuffUptimeContainer:GetSpell(DETAILS_FOCUS_POTION_ID)\n							if (focusPotion) then\n								total = total + 1\n								bFoundPotion = true\n								if (top < 1) then\n									top = 1\n								end\n								--add amount to the player\n								customContainer:AddValue(actorObject, 1)\n							end\n						end\n						\n						--get the spell buff uptime container\n						local buffUptimeContainer = actorObject:GetSpellContainer(\"buff\")\n						if (buffUptimeContainer) then\n							for spellId, potionPower in pairs(LIB_OPEN_RAID_ALL_POTIONS) do\n								local spellTable = buffUptimeContainer:GetSpell(spellId)\n								if (spellTable) then\n									local used = spellTable.activedamt\n									if (used and used > 0) then\n										total = total + used\n										bFoundPotion = true\n										if (used > top) then\n											top = used\n										end\n										\n										--add amount to the player\n										customContainer:AddValue(actorObject, used)\n									end\n								end\n							end\n						end\n						\n						if (bFoundPotion) then\n							amount = amount + 1\n						end\n					end\n				end\n				\n				--return:\n				return total, top, amount\n				",
			["desc"] = "Показать, кто в вашем рейде использовал зелье во время сражения.",
			["name"] = "Использовано зелий",
			["attribute"] = false,
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\INV_Potion_03",
			["script_version"] = 8,
		}, -- [1]
		{
			["source"] = false,
			["desc"] = "Показать, кто в вашей рейдовой группе использовал камень здоровья или целебное зелье.",
			["author"] = "Terciob",
			["percent_script"] = false,
			["total_script"] = false,
			["attribute"] = false,
			["tooltip"] = "				local actorObject, combatObject, instanceObject = ...\n				local spellContainer = actorObject:GetSpellContainer(\"spell\")\n				\n				local iconSize = 20\n				\n				local allHealingPotions = {6262}\n				for spellId, potionPower in pairs(LIB_OPEN_RAID_ALL_POTIONS) do\n					allHealingPotions[#allHealingPotions+1] = spellId\n				end\n				\n				for i = 1, #allHealingPotions do\n					local spellId = allHealingPotions[i]\n					local spellTable = spellContainer:GetSpell(spellId)\n					if (spellTable) then\n						local spellName, _, spellIcon = GetSpellInfo(spellId)\n						GameCooltip:AddLine(spellName, Details:ToK(spellTable.total))\n						GameCooltip:AddIcon(spellIcon, 1, 1, iconSize, iconSize)\n						GameCooltip:AddStatusBar (100, 1, 0, 0, 0, 0.75)\n					end\n				end\n			",
			["name"] = "Лечебное зелье и камень",
			["script"] = "				local combatObject, instanceContainer, instanceObject = ...\n				local total, top, amount = 0, 0, 0\n				\n				local listOfHealingActors = combatObject:GetActorList(DETAILS_ATTRIBUTE_HEAL)\n				for _, actorObject in ipairs(listOfHealingActors) do\n					local listOfSpells = actorObject:GetSpellList()\n					local found = false\n					\n					for spellId, spellTable in pairs(listOfSpells) do\n						if (LIB_OPEN_RAID_HEALING_POTIONS[spellId]) then\n							instanceContainer:AddValue(actorObject, spellTable.total)\n							total = total + spellTable.total\n							if (top < spellTable.total) then\n								top = spellTable.total\n							end\n							found = true\n						end\n					end\n					\n					if (found) then\n						amount = amount + 1\n					end\n				end\n				\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\INV_Stone_04",
			["script_version"] = 18,
		}, -- [2]
		{
			["source"] = false,
			["tooltip"] = "\n			",
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format(\"%.1f\", value/top*100)\n			",
			["desc"] = "Сообщает, сколько времени каждый персонаж провел на нанесение урона.",
			["attribute"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor(value/60), math.floor(value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["name"] = "Урон (активность)",
			["script"] = "				local combatObject, instanceContainer, instanceObject = ...\n				local total, amount = 0, 0\n\n				--get the damager actors\n				local listOfDamageActors = combatObject:GetActorList(DETAILS_ATTRIBUTE_DAMAGE)\n\n				for _, actorObject in ipairs(listOfDamageActors) do\n					if (actorObject:IsGroupPlayer()) then\n						local activity = actorObject:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player\n						instanceContainer:AddValue(actorObject, activity)\n					end\n				end\n\n				--return:\n				return total, combatObject:GetCombatTime(), amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\Buttons\\UI-MicroStream-Red",
			["script_version"] = 4,
		}, -- [3]
		{
			["source"] = false,
			["tooltip"] = "\n			",
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format(\"%.1f\", value/top*100)\n			",
			["desc"] = "Сообщает, сколько времени каждый персонаж провел, делая исцеление.",
			["attribute"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor(value/60), math.floor(value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["name"] = "Исцеление (активность)",
			["script"] = "				local combatObject, instanceContainer, instanceObject = ...\n				local total, amount = 0, 0\n\n				--get the healing actors\n				local listOfHealingActors = combatObject:GetActorList(DETAILS_ATTRIBUTE_HEAL)\n\n				for _, actorObject in ipairs(listOfHealingActors) do\n					if (actorObject:IsGroupPlayer()) then\n						local activity = actorObject:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player\n						instanceContainer:AddValue (actorObject, activity)\n					end\n				end\n\n				--return:\n				return total, combatObject:GetCombatTime(), amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\Buttons\\UI-MicroStream-Green",
			["script_version"] = 3,
		}, -- [4]
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor(value)\n			",
			["desc"] = "Show the crowd control amount for each player.",
			["attribute"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs(misc_actors) do\n					if (character.cc_done and character:IsPlayer()) then\n						local cc_done = floor(character.cc_done)\n						instance_container:AddValue (character, cc_done)\n						total = total + cc_done\n						if (cc_done > top) then\n							top = cc_done\n						end\n						amount = amount + 1\n					end\n				end\n\n				return total, top, amount\n			",
			["name"] = "Контроль толпы сделано",
			["tooltip"] = "				local actor, combat, instance = ...\n				local spells = {}\n				for spellid, spell in pairs(actor.cc_done_spells._ActorTable) do\n				    tinsert(spells, {spellid, spell.counter})\n				end\n\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs(spells) do\n				    local name, _, icon = GetSpellInfo(spell [1])\n				    GameCooltip:AddLine(name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				end\n\n				local targets = {}\n				for playername, amount in pairs(actor.cc_done_targets) do\n				    tinsert(targets, {playername, amount})\n				end\n\n				table.sort (targets, _detalhes.Sort2)\n\n				_detalhes:AddTooltipSpellHeaderText (\"Targets\", \"yellow\", #targets)\n				local class, _, _, _, _, r, g, b = _detalhes:GetClass(actor.nome)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, target in ipairs(targets) do\n				    GameCooltip:AddLine(target[1], target [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n\n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass(target [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon(class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end\n				    --\n				end\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Frost_FreezingBreath",
			["script_version"] = 11,
		}, -- [5]
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor(value)\n			",
			["desc"] = "Show the amount of crowd control received for each player.",
			["attribute"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amt = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n				DETAILS_CUSTOM_CC_RECEIVED_CACHE = DETAILS_CUSTOM_CC_RECEIVED_CACHE or {}\n				wipe (DETAILS_CUSTOM_CC_RECEIVED_CACHE)\n\n				for index, character in ipairs(misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n\n					for player_name, amount in pairs(character.cc_done_targets) do\n					    local target = combat (1, player_name) or combat (2, player_name)\n					    if (target and target:IsPlayer()) then\n						instance_container:AddValue (target, amount)\n						total = total + amount\n						if (amount > top) then\n						    top = amount\n						end\n						if (not DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name]) then\n						    DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name] = true\n						    amt = amt + 1\n						end\n					    end\n					end\n\n				    end\n				end\n\n				return total, top, amt\n			",
			["name"] = "Контроль толпы получено",
			["tooltip"] = "				local actor, combat, instance = ...\n				local name = actor:name()\n				local spells, from = {}, {}\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs(misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					local on_actor = character.cc_done_targets [name]\n					if (on_actor) then\n					    tinsert(from, {character:name(), on_actor})\n\n					    for spellid, spell in pairs(character.cc_done_spells._ActorTable) do\n\n						local spell_on_actor = spell.targets [name]\n						if (spell_on_actor) then\n						    local has_spell\n						    for index, spell_table in ipairs(spells) do\n							if (spell_table [1] == spellid) then\n							    spell_table [2] = spell_table [2] + spell_on_actor\n							    has_spell = true\n							end\n						    end\n						    if (not has_spell) then\n							tinsert(spells, {spellid, spell_on_actor})\n						    end\n						end\n\n					    end\n					end\n				    end\n				end\n\n				table.sort (from, _detalhes.Sort2)\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs(spells) do\n				    local name, _, icon = GetSpellInfo(spell [1])\n				    GameCooltip:AddLine(name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				end\n\n				_detalhes:AddTooltipSpellHeaderText (\"From\", \"yellow\", #from)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, t in ipairs(from) do\n				    GameCooltip:AddLine(t[1], t[2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n\n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass(t [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon(class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end\n\n				end\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Frost_ChainsOfIce",
			["script_version"] = 3,
		}, -- [6]
		{
			["source"] = false,
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				local dps = _detalhes:ToK (floor(value) / combat:GetCombatTime())\n				local percent = string.format(\"%.1f\", value/total*100)\n				return dps .. \", \" .. percent\n			",
			["desc"] = "Показать свои заклинания в окне.",
			["tooltip"] = "			--config:\n			--Background RBG and Alpha:\n			local R, G, B, A = 0, 0, 0, 0.75\n			local R, G, B, A = 0.1960, 0.1960, 0.1960, 0.8697\n\n			--get the parameters passed\n			local spell, combat, instance = ...\n\n			--get the cooltip object (we dont use the convencional GameTooltip here)\n			local GC = GameCooltip\n			GC:SetOption(\"YSpacingMod\", 0)\n\n			local role = DetailsFramework.UnitGroupRolesAssigned(\"player\")\n\n			if (spell.n_total) then\n\n			    local spellschool, schooltext = spell.spellschool, \"\"\n			    if (spellschool) then\n				local t = Details.spells_school [spellschool]\n				if (t and t.name) then\n				    schooltext = t.formated\n				end\n			    end\n\n			    local total_hits = spell.counter\n			    local combat_time = instance.showing:GetCombatTime()\n\n			    local debuff_uptime_total, cast_string = \"\", \"\"\n			    local misc_actor = instance.showing (4, Details.playername)\n			    if (misc_actor) then\n				local debuff_uptime = misc_actor.debuff_uptime_spells and misc_actor.debuff_uptime_spells._ActorTable [spell.id] and misc_actor.debuff_uptime_spells._ActorTable [spell.id].uptime\n				if (debuff_uptime) then\n				    debuff_uptime_total = floor(debuff_uptime / instance.showing:GetCombatTime() * 100)\n				end\n\n				local spellName = GetSpellInfo(spell.id)\n				local amountOfCasts = combat:GetSpellCastAmount(Details.playername, spellName)\n\n				if (amountOfCasts == 0) then\n				    amountOfCasts = \"(|cFFFFFF00?|r)\"\n				end\n				cast_string = cast_string .. amountOfCasts\n			    end\n\n			    --Cooltip code\n			    GC:AddLine(\"Casts:\", cast_string or \"?\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    if (debuff_uptime_total ~= \"\") then\n				GC:AddLine(\"Uptime:\", (debuff_uptime_total or \"?\") .. \"%\")\n				GC:AddStatusBar (100, 1, R, G, B, A)\n			    end\n\n			    GC:AddLine(\"Hits:\", spell.counter)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    local average = spell.total / total_hits\n			    GC:AddLine(\"Average:\", _detalhes:ToK (average))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    GC:AddLine(\"E-Dps:\", _detalhes:ToK (spell.total / combat_time))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    GC:AddLine(\"School:\", schooltext)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    --GC:AddLine(\" \")\n\n			    GC:AddLine(\"Normal Hits: \", spell.n_amt .. \" (\" ..floor( spell.n_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    local n_average = spell.n_total / spell.n_amt\n			    local T = (combat_time*spell.n_total)/spell.total\n			    local P = average/n_average*100\n			    T = P*T/100\n\n			    GC:AddLine(\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format(\"%.1f\",spell.n_total / T ))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    --GC:AddLine(\" \")\n\n			    GC:AddLine(\"Critical Hits: \", spell.c_amt .. \" (\" ..floor( spell.c_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    if (spell.c_amt > 0) then\n				local c_average = spell.c_total/spell.c_amt\n				local T = (combat_time*spell.c_total)/spell.total\n				local P = average/c_average*100\n				T = P*T/100\n				local crit_dps = spell.c_total / T\n\n				GC:AddLine(\"Average / E-Dps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n			    else\n				GC:AddLine(\"Average / E-Dps: \",  \"0 / 0\")\n			    end\n\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n\n			elseif (spell.n_total) then\n\n			    local spellschool, schooltext = spell.spellschool, \"\"\n			    if (spellschool) then\n				local t = _detalhes.spells_school [spellschool]\n				if (t and t.name) then\n				    schooltext = t.formated\n				end\n			    end\n\n			    local total_hits = spell.counter\n			    local combat_time = instance.showing:GetCombatTime()\n\n			    --Cooltip code\n			    GC:AddLine(\"Hits:\", spell.counter)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    local average = spell.total / total_hits\n			    GC:AddLine(\"Average:\", _detalhes:ToK (average))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    GC:AddLine(\"E-Hps:\", _detalhes:ToK (spell.total / combat_time))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    GC:AddLine(\"School:\", schooltext)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    --GC:AddLine(\" \")\n\n			    GC:AddLine(\"Normal Hits: \", spell.n_amt .. \" (\" ..floor( spell.n_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    local n_average = spell.n_total / spell.n_amt\n			    local T = (combat_time*spell.n_total)/spell.total\n			    local P = average/n_average*100\n			    T = P*T/100\n\n			    GC:AddLine(\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format(\"%.1f\",spell.n_total / T ))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    --GC:AddLine(\" \")\n\n			    GC:AddLine(\"Critical Hits: \", spell.c_amt .. \" (\" ..floor( spell.c_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    if (spell.c_amt > 0) then\n				local c_average = spell.c_total/spell.c_amt\n				local T = (combat_time*spell.c_total)/spell.total\n				local P = average/c_average*100\n				T = P*T/100\n				local crit_dps = spell.c_total / T\n\n				GC:AddLine(\"Average / E-Hps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n			    else\n				GC:AddLine(\"Average / E-Hps: \",  \"0 / 0\")\n			    end\n\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			end\n			",
			["attribute"] = false,
			["name"] = "Мои заклинания",
			["script"] = "				--get the parameters passed\n				local combat, instance_container, instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				local player\n				local pet_attribute\n\n				local role = DetailsFramework.UnitGroupRolesAssigned(\"player\")\n				local spec = DetailsFramework.GetSpecialization()\n				role = spec and DetailsFramework.GetSpecializationRole (spec) or role\n\n				if (role == \"DAMAGER\") then\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				elseif (role == \"HEALER\") then\n					player = combat (DETAILS_ATTRIBUTE_HEAL, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_HEAL\n				else\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				end\n\n				--do the loop\n\n				if (player) then\n					local spells = player:GetSpellList()\n					for spellid, spell in pairs(spells) do\n						instance_container:AddValue (spell, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						amount = amount + 1\n					end\n\n					for _, PetName in ipairs(player.pets) do\n						local pet = combat (pet_attribute, PetName)\n						if (pet) then\n							for spellid, spell in pairs(pet:GetSpellList()) do\n								instance_container:AddValue (spell, spell.total, nil, \" (\" .. PetName:gsub((\" <.*\"), \"\") .. \")\")\n								total = total + spell.total\n								if (top < spell.total) then\n									top = spell.total\n								end\n								amount = amount + 1\n							end\n						end\n					end\n				end\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\CHATFRAME\\UI-ChatIcon-Battlenet",
			["script_version"] = 10,
		}, -- [7]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Показывает количество наносимого урона по целям, меткой с черепом.",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [128]\n				if (DamageOnStar) then\n				    --RAID_TARGET_8 is the built-in localized word for 'Skull'.\n				    GameCooltip:AddLine(RAID_TARGET_8 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_8\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["attribute"] = false,
			["name"] = "Наносимый урон по метки с черепом",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--raid target flags:\n				-- 128: skull\n				-- 64: cross\n				-- 32: square\n				-- 16: moon\n				-- 8: triangle\n				-- 4: diamond\n				-- 2: circle\n				-- 1: star\n\n				--do the loop\n				for _, actor in ipairs(Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					if (actor.raid_targets [128]) then\n					    CustomContainer:AddValue (actor, actor.raid_targets [128])\n					end\n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_8",
			["script_version"] = 3,
		}, -- [8]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Показывает количество наносимого урона по целям, отмеченным любой другой меткой.",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object\n				local GameCooltip = GameCooltip\n\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [1]\n				if (DamageOnStar) then\n				    GameCooltip:AddLine(RAID_TARGET_1 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_1\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCircle = RaidTargets [2]\n				if (DamageOnCircle) then\n				    GameCooltip:AddLine(RAID_TARGET_2 .. \":\", format_func (_, DamageOnCircle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_2\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnDiamond = RaidTargets [4]\n				if (DamageOnDiamond) then\n				    GameCooltip:AddLine(RAID_TARGET_3 .. \":\", format_func (_, DamageOnDiamond))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_3\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnTriangle = RaidTargets [8]\n				if (DamageOnTriangle) then\n				    GameCooltip:AddLine(RAID_TARGET_4 .. \":\", format_func (_, DamageOnTriangle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_4\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnMoon = RaidTargets [16]\n				if (DamageOnMoon) then\n				    GameCooltip:AddLine(RAID_TARGET_5 .. \":\", format_func (_, DamageOnMoon))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_5\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnSquare = RaidTargets [32]\n				if (DamageOnSquare) then\n				    GameCooltip:AddLine(RAID_TARGET_6 .. \":\", format_func (_, DamageOnSquare))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_6\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCross = RaidTargets [64]\n				if (DamageOnCross) then\n				    GameCooltip:AddLine(RAID_TARGET_7 .. \":\", format_func (_, DamageOnCross))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_7\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["attribute"] = false,
			["name"] = "Наносимый урон на другие помеченные метки",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for _, actor in ipairs(Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					local total = (actor.raid_targets [1] or 0) --star\n					total = total + (actor.raid_targets [2] or 0) --circle\n					total = total + (actor.raid_targets [4] or 0) --diamond\n					total = total + (actor.raid_targets [8] or 0) --tiangle\n					total = total + (actor.raid_targets [16] or 0) --moon\n					total = total + (actor.raid_targets [32] or 0) --square\n					total = total + (actor.raid_targets [64] or 0) --cross\n\n					if (total > 0) then\n					    CustomContainer:AddValue (actor, total)\n					end\n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_5",
			["script_version"] = 3,
		}, -- [9]
		{
			["source"] = false,
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip2\n\n				--Cooltip code\n				--get the overall combat\n				local OverallCombat = Details:GetCombat(-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat(0)\n\n				local AllSpells = {}\n\n				local playerTotal = 0\n\n				--overall\n				local player = OverallCombat [1]:GetActor(actor.nome)\n				if (player) then\n					playerTotal = playerTotal + player.total\n					local playerSpells = player:GetSpellList()\n					for spellID, spellTable in pairs(playerSpells) do\n						AllSpells [spellID] = spellTable.total\n					end\n				end\n				--current\n				if (Details.in_combat) then\n					local player = CurrentCombat [1]:GetActor(actor.nome)\n					if (player) then\n						playerTotal = playerTotal + player.total\n						local playerSpells = player:GetSpellList()\n						for spellID, spellTable in pairs(playerSpells) do\n							AllSpells [spellID] = (AllSpells [spellID] or 0) + (spellTable.total or 0)\n						end\n					end\n				end\n\n				local sortedList = {}\n				for spellID, total in pairs(AllSpells) do\n					tinsert(sortedList, {spellID, total})\n				end\n				table.sort (sortedList, Details.Sort2)\n\n				local format_func = Details:GetCurrentToKFunction()\n\n				--build the tooltip\n\n				local topSpellTotal = sortedList and sortedList[1] and sortedList[1][2] or 0\n\n				for i, t in ipairs(sortedList) do\n					local spellID, total = unpack(t)\n					if (total > 1) then\n						local spellName, _, spellIcon = Details.GetSpellInfo(spellID)\n\n						local spellPercent = total / playerTotal * 100\n						local formatedSpellPercent = format(\"%.1f\", spellPercent)\n\n						if (string.len(formatedSpellPercent) < 4) then\n							formatedSpellPercent = formatedSpellPercent  .. \"0\"\n						end\n\n						GameCooltip:AddLine(spellName, format_func (_, total) .. \"    \" .. formatedSpellPercent  .. \"%\")\n\n						Details:AddTooltipBackgroundStatusbar(false, total / topSpellTotal * 100)\n						GameCooltip:AddIcon (spellIcon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, 0.078125, 0.921875, 0.078125, 0.921875)\n\n					end\n				end\n			",
			["attribute"] = false,
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n\n				--get the time of overall combat\n				local OverallCombatTime = Details:GetCombat(-1):GetCombatTime()\n\n				--get the time of current combat if the player is in combat\n				if (Details.in_combat) then\n					local CurrentCombatTime = Details:GetCombat(0):GetCombatTime()\n					OverallCombatTime = OverallCombatTime + CurrentCombatTime\n				end\n\n				--calculate the DPS and return it as percent\n				local totalValue = value\n\n				--build the string\n				local ToK = Details:GetCurrentToKFunction()\n				local s = ToK (_, value / OverallCombatTime)\n\n				return s\n			",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return value\n			",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the overall combat\n				local OverallCombat = Details:GetCombat(-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat(0)\n\n				if (not OverallCombat.GetActorList or not CurrentCombat.GetActorList) then\n					return 0, 0, 0\n				end\n\n				--get the damage actor container for overall\n				local damage_container_overall = OverallCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				--get the damage actor container for current\n				local damage_container_current = CurrentCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n\n				--do the loop:\n				for _, player in ipairs( damage_container_overall ) do\n					--only player in group\n					if (player:IsGroupPlayer()) then\n						instance_container:AddValue (player, player.total)\n					end\n				end\n\n				if (Details.in_combat) then\n					for _, player in ipairs( damage_container_current ) do\n						--only player in group\n						if (player:IsGroupPlayer()) then\n							instance_container:AddValue (player, player.total)\n						end\n					end\n				end\n\n				total, top =  instance_container:GetTotalAndHighestValue()\n				amount =  instance_container:GetNumActors()\n\n				--return:\n				return total, top, amount\n			",
			["displayName"] = "Нанесённый урон",
			["name"] = "Динамический общий урон",
			["desc"] = "Show overall damage done on the fly.",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\Buttons\\Spell-Reset",
			["script_version"] = 8,
		}, -- [10]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Damage done to shields",
			["tooltip"] = "				--get the parameters passed\n				local actor, Combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				--get the actor total damage absorbed\n				local totalAbsorb = actor.totalabsorbed\n				local format_func = Details:GetCurrentToKFunction()\n\n				--get the damage absorbed by all the actor pets\n				for petIndex, petName in ipairs(actor.pets) do\n				    local pet = Combat :GetActor(1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n				    end\n				end\n\n				GameCooltip:AddLine(actor:Name(), format_func (_, actor.totalabsorbed))\n				Details:AddTooltipBackgroundStatusbar()\n\n				for petIndex, petName in ipairs(actor.pets) do\n				    local pet = Combat :GetActor(1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n\n					GameCooltip:AddLine(petName, format_func (_, pet.totalabsorbed))\n					Details:AddTooltipBackgroundStatusbar()\n\n				    end\n				end\n			",
			["attribute"] = false,
			["name"] = "Наносимый урон по щитам",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for index, actor in ipairs(Combat:GetActorList(1)) do\n				    if (actor:IsPlayer()) then\n\n					--get the actor total damage absorbed\n					local totalAbsorb = actor.totalabsorbed\n\n					--get the damage absorbed by all the actor pets\n					for petIndex, petName in ipairs(actor.pets) do\n					    local pet = Combat :GetActor(1, petName)\n					    if (pet) then\n						totalAbsorb = totalAbsorb + pet.totalabsorbed\n					    end\n					end\n\n					--add the value to the actor on the custom container\n					CustomContainer:AddValue (actor, totalAbsorb)\n\n				    end\n				end\n				--loop end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Holy_PowerWordShield",
			["script_version"] = 1,
		}, -- [11]
	},
	["all_switch_config"] = {
		["scale"] = 1,
		["font_size"] = 10,
	},
	["latest_news_saw"] = "4.4.0 12755",
	["__profiles"] = {
		["Триксес-Пламегор"] = {
			["overall_clear_newtorghast"] = true,
			["use_realtimedps"] = false,
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["use_animation_accel"] = true,
				["disable_mythic_dungeon"] = false,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["show_crowdcontrol_pvm"] = false,
				["show_crowdcontrol_pvp"] = true,
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.1921, -- [1]
						0.1921, -- [2]
						0.1921, -- [3]
						0.3869, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[1467] = {
					0.5, -- [1]
					0.625, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[1468] = {
					0.625, -- [1]
					0.75, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[1473] = {
					0.75, -- [1]
					0.875, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
			},
			["all_in_one_windows"] = {
			},
			["tooltip"] = {
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["bar_color"] = {
					0.149, -- [1]
					0.149, -- [2]
					0.149, -- [3]
					0.87, -- [4]
				},
				["tooltip_max_pets"] = 2,
				["abbreviation"] = 2,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["background"] = {
					0.0941, -- [1]
					0.0941, -- [2]
					0.0941, -- [3]
					0.8, -- [4]
				},
				["rounded_corner"] = true,
				["divisor_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["fontshadow"] = false,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 17,
					["H"] = 17,
				},
				["anchor_relative"] = "top",
				["anchored_to"] = 1,
				["fontsize"] = 10,
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["commands"] = {
				},
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["tooltip_max_abilities"] = 8,
				["icon_border_texcoord"] = {
					["B"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["R"] = 0.921875,
				},
				["show_amount"] = false,
				["border_size"] = 14,
				["maximize_method"] = 1,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["pvp_as_group"] = true,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = false,
			["fade_speed"] = 0.15,
			["death_tooltip_spark"] = false,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["use_self_color"] = false,
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["grouping_horizontal_gap"] = 0,
			["death_log_colors"] = {
				["heal"] = "green",
				["buff"] = "silver",
				["friendlyfire"] = "darkorange",
				["debuff"] = "purple",
				["cooldown"] = "yellow",
				["damage"] = "red",
			},
			["deadlog_limit"] = 16,
			["trash_concatenate"] = false,
			["deny_score_messages"] = false,
			["instances_segments_locked"] = true,
			["instances_no_libwindow"] = false,
			["animation_speed"] = 33,
			["data_broker_text"] = "",
			["standard_skin"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["use_battleground_server_parser"] = false,
			["death_tooltip_width"] = 350,
			["disable_window_groups"] = false,
			["numerical_system_symbols"] = "auto",
			["report_schema"] = 1,
			["instances_suppress_trash"] = 0,
			["update_speed"] = 0.2,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["time_type"] = 2,
			["numerical_system"] = 1,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["show_arena_role_icon"] = false,
			["overall_clear_pvp"] = true,
			["segments_amount"] = 40,
			["report_lines"] = 5,
			["overall_clear_newboss"] = true,
			["overall_flag"] = 16,
			["skin"] = "Minimalistic",
			["override_spellids"] = true,
			["use_scroll"] = false,
			["color_by_arena_team"] = true,
			["overall_clear_logout"] = false,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["minimum_combat_time"] = 5,
			["memory_threshold"] = 3,
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["chat_tab_embed"] = {
				["enabled"] = false,
				["tab_name"] = "",
				["x_offset"] = 0,
				["y_offset"] = 0,
				["single_window"] = false,
			},
			["deadlog_events"] = 32,
			["default_bg_color"] = 0.0941,
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				["MAGE"] = {
					0.125, -- [1]
					0.248046875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["PET"] = {
					0.125, -- [1]
					0.248046875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["DRUID"] = {
					0.37109375, -- [1]
					0.494140625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["MONK"] = {
					0.25, -- [1]
					0.369140625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["SHAMAN"] = {
					0.125, -- [1]
					0.248046875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				["UNKNOW"] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["PRIEST"] = {
					0.248046875, -- [1]
					0.37109375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["Alliance"] = {
					0.248046875, -- [1]
					0.02968748, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["DEMONHUNTER"] = {
					0.36914063, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				["Horde"] = {
					0.37109375, -- [1]
					0.494140625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["WARLOCK"] = {
					0.37109375, -- [1]
					0.494140625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				["EVOKER"] = {
					0.50390625, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["ROGUE"] = {
					0.248046875, -- [1]
					0.37109375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
			},
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["SELF"] = {
					0.89019, -- [1]
					0.32156, -- [2]
					0.89019, -- [3]
				},
				["ARENA_GREEN"] = {
					0.686, -- [1]
					0.372, -- [2]
					0.905, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["EVOKER"] = {
					0.2, -- [1]
					0.5764, -- [2]
					0.498, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
			},
			["disable_alldisplays_window"] = false,
			["total_abbreviation"] = 2,
			["segments_amount_to_save"] = 40,
			["trash_auto_remove"] = false,
			["animation_speed_triggertravel"] = 5,
			["clear_graphic"] = true,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["segments_auto_erase"] = 1,
			["options_group_edit"] = true,
			["broadcaster_enabled"] = false,
			["minimap"] = {
				["minimapPos"] = 46.10636810548913,
				["radius"] = 160,
				["text_type"] = 1,
				["onclick_what_todo"] = 1,
				["text_format"] = 3,
				["hide"] = false,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["realtimedps_always_arena"] = false,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["segments_panic_mode"] = false,
			["realtimedps_order_bars"] = false,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -402.1850719451904,
							["x"] = -669.4939270019531,
							["w"] = 178.0492553710938,
							["h"] = 44.22213745117188,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["hide_in_combat_type"] = 1,
					["menu_icons_size"] = 0.82,
					["titlebar_shown"] = false,
					["menu_anchor"] = {
						20, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.243,
					["fullborder_size"] = 0.5,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons_2_shadow",
					["bars_sort_direction"] = 1,
					["use_auto_align_multi_fontstrings"] = true,
					["rowareaborder_shown"] = false,
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["clickthrough_rows"] = false,
					["titlebar_texture"] = "Details Serenity",
					["ignore_mass_showhide"] = false,
					["plugins_grow_direction"] = 1,
					["icon_desaturated"] = false,
					["switch_damager"] = false,
					["micro_displays_side"] = 2,
					["window_scale"] = 1,
					["attribute_icon_size"] = 0,
					["hide_icon"] = false,
					["toolbar_side"] = 1,
					["bg_g"] = 0.2352,
					["menu_icons_alpha"] = 0.92,
					["bg_b"] = 0.2588,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.1215, -- [1]
						0.1176, -- [2]
						0.1294, -- [3]
						0.91, -- [4]
					},
					["hide_on_context"] = {
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [1]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [2]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [3]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [4]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [5]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [6]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [7]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [8]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [9]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [10]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [11]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [12]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [13]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [14]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [15]
					},
					["switch_all_roles_after_wipe"] = false,
					["menu_icons_color"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
					},
					["bars_inverted"] = false,
					["skin"] = "Minimalistic",
					["fontstrings_text3_anchor"] = 38,
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["stretch_button_side"] = 1,
					["switch_healer"] = false,
					["fontstrings_text2_anchor"] = 73,
					["backdrop_texture"] = "Details Ground",
					["fontstrings_text_limit_offset"] = -10,
					["fullborder_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						1, -- [4]
					},
					["attribute_text"] = {
						["enabled"] = true,
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 12,
						["custom_text"] = "{name}",
						["show_timer_arena"] = true,
						["text_face"] = "Accidental Presidency",
						["show_timer_always"] = true,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = {
							1.4, -- [1]
							2, -- [2]
						},
						["show_timer"] = true,
						["enable_custom_text"] = false,
						["show_timer_bg"] = true,
					},
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textYMod"] = 1,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 3,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 0,
								["textStyle"] = 2,
								["textAlign"] = 1,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textYMod"] = 1,
								["textXMod"] = 6,
								["textFace"] = "Accidental Presidency",
								["timeType"] = 1,
								["textStyle"] = 2,
								["textAlign"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["fullborder_shown"] = false,
					["clickthrough_window"] = false,
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["version"] = 3,
					["fontstrings_text4_anchor"] = 0,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["show_statusbar"] = false,
					["micro_displays_locked"] = true,
					["bg_alpha"] = 0.6,
					["rowareaborder_size"] = 0.5,
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["skin_custom"] = "",
					["hide_in_combat_alpha"] = 0,
					["switch_damager_in_combat"] = false,
					["rounded_corner_enabled"] = false,
					["libwindow"] = {
						["y"] = 2.370543718338013,
						["x"] = 0,
						["point"] = "BOTTOMLEFT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["row_offsets"] = {
							["top"] = 0,
							["right"] = 0,
							["left"] = 0,
							["bottom"] = 0,
						},
						["textR_outline_small"] = true,
						["textL_outline_small"] = true,
						["percent_type"] = 1,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["textL_offset"] = 0,
						["text_yoffset"] = 0,
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\FRIZQT___CYR.TTF",
						["faction_icon_size_offset"] = -10,
						["textL_enable_custom_text"] = false,
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["font_size"] = 16,
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["show_faction_icon"] = true,
						["textL_translit_text"] = false,
						["texture_custom_file"] = "Interface\\",
						["texture_file"] = "Interface\\AddOns\\Details\\images\\bar_hyanda",
						["icon_size_offset"] = 0,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["icon_mask"] = "",
						["overlay_color"] = {
							0.7, -- [1]
							0.7, -- [2]
							0.7, -- [3]
							0, -- [4]
						},
						["show_arena_role_icon"] = false,
						["textR_bracket"] = "(",
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textR_enable_custom_text"] = false,
						["use_spec_icons"] = true,
						["texture_custom"] = "",
						["textR_class_colors"] = false,
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["alpha"] = 1,
						["textL_class_colors"] = false,
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "Details Hyanda",
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["overlay_texture"] = "Details D'ictum",
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["arena_role_icon_size_offset"] = -10,
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["height"] = 21,
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["backdrop"] = {
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
							["enabled"] = false,
							["size"] = 12,
						},
					},
					["bars_grow_direction"] = 1,
					["strata"] = "LOW",
					["rowareaborder_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						1, -- [4]
					},
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["grab_on_top"] = false,
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["switch_tank"] = false,
					["auto_current"] = true,
					["switch_tank_in_combat"] = false,
					["desaturated_menu"] = false,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -402.1850719451904,
							["x"] = -669.4939270019531,
							["w"] = 178.0492553710938,
							["h"] = 44.22213745117188,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["show_sidebars"] = false,
					["wallpaper"] = {
						["enabled"] = false,
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["level"] = 2,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["titlebar_height"] = 16,
					["__was_opened"] = true,
					["use_multi_fontstrings"] = true,
					["titlebar_texture_color"] = {
						0.2, -- [1]
						0.2, -- [2]
						0.2, -- [3]
						0.8, -- [4]
					},
				}, -- [1]
			},
			["auto_swap_to_dynamic_overall"] = false,
			["player_details_window"] = {
				["scale"] = 1,
				["bar_texture"] = "Skyline",
				["skin"] = "ElvUI",
			},
			["time_type_original"] = 2,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["force_activity_time_pvp"] = true,
			["clear_ungrouped"] = true,
			["death_tooltip_texture"] = "Details Serenity",
			["disable_reset_button"] = false,
			["animate_scroll"] = false,
			["realtime_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = false,
				["frame_settings"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["point"] = "TOP",
					["scale"] = 1,
					["width"] = 300,
					["y"] = -110,
					["x"] = 0,
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = true,
					["height"] = 23,
				},
				["sample_size"] = 3,
				["update_interval"] = 0.3,
				["text_offset"] = 2,
				["font_face"] = "Friz Quadrata TT",
				["options_frame"] = {
				},
			},
			["disable_stretch_from_toolbar"] = false,
			["default_bg_alpha"] = 0.5,
			["profile_save_pos"] = true,
		},
		["Абенд-Пламегор"] = {
			["overall_clear_newtorghast"] = true,
			["use_realtimedps"] = false,
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["disable_mythic_dungeon"] = false,
				["use_animation_accel"] = true,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["show_crowdcontrol_pvm"] = false,
				["show_crowdcontrol_pvp"] = true,
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.1921, -- [1]
						0.1921, -- [2]
						0.1921, -- [3]
						0.3869, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[1467] = {
					0.5, -- [1]
					0.625, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[1468] = {
					0.625, -- [1]
					0.75, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[1473] = {
					0.75, -- [1]
					0.875, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
			},
			["all_in_one_windows"] = {
			},
			["tooltip"] = {
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["bar_color"] = {
					0.149, -- [1]
					0.149, -- [2]
					0.149, -- [3]
					0.87, -- [4]
				},
				["tooltip_max_pets"] = 2,
				["abbreviation"] = 2,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["background"] = {
					0.0941, -- [1]
					0.0941, -- [2]
					0.0941, -- [3]
					0.8, -- [4]
				},
				["rounded_corner"] = true,
				["divisor_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["fontshadow"] = false,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 17,
					["H"] = 17,
				},
				["anchor_relative"] = "top",
				["anchored_to"] = 1,
				["fontsize"] = 10,
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["commands"] = {
				},
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["tooltip_max_abilities"] = 8,
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["show_amount"] = false,
				["border_size"] = 14,
				["maximize_method"] = 1,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["icon_border_texcoord"] = {
					["R"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["B"] = 0.921875,
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["pvp_as_group"] = true,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = false,
			["fade_speed"] = 0.15,
			["death_tooltip_spark"] = false,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["use_self_color"] = false,
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["grouping_horizontal_gap"] = 0,
			["profile_save_pos"] = true,
			["default_bg_alpha"] = 0.5,
			["trash_concatenate"] = false,
			["deny_score_messages"] = false,
			["standard_skin"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["animation_speed"] = 33,
			["animate_scroll"] = false,
			["disable_stretch_from_toolbar"] = false,
			["realtime_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = false,
				["frame_settings"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["point"] = "TOP",
					["scale"] = 1,
					["width"] = 300,
					["y"] = -110,
					["x"] = 0,
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = true,
					["height"] = 23,
				},
				["sample_size"] = 3,
				["font_face"] = "Friz Quadrata TT",
				["text_offset"] = 2,
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["memory_ram"] = 64,
			["use_battleground_server_parser"] = false,
			["death_tooltip_width"] = 350,
			["disable_window_groups"] = false,
			["clear_ungrouped"] = true,
			["force_activity_time_pvp"] = true,
			["instances_suppress_trash"] = 0,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["time_type_original"] = 2,
			["player_details_window"] = {
				["scale"] = 1,
				["skin"] = "ElvUI",
				["bar_texture"] = "Skyline",
			},
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["auto_swap_to_dynamic_overall"] = false,
			["segments_amount"] = 40,
			["report_lines"] = 5,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -423.166635274887,
							["x"] = 683.5186767578125,
							["w"] = 150,
							["h"] = 7.000001430511475,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["hide_in_combat_type"] = 1,
					["menu_icons_size"] = 0.82,
					["titlebar_shown"] = false,
					["menu_anchor"] = {
						20, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.243,
					["fullborder_size"] = 0.5,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons_2_shadow",
					["bars_sort_direction"] = 1,
					["use_auto_align_multi_fontstrings"] = true,
					["rowareaborder_shown"] = false,
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["clickthrough_rows"] = false,
					["titlebar_texture"] = "Details Serenity",
					["ignore_mass_showhide"] = false,
					["plugins_grow_direction"] = 1,
					["icon_desaturated"] = false,
					["switch_damager"] = false,
					["micro_displays_side"] = 2,
					["window_scale"] = 1,
					["attribute_icon_size"] = 0,
					["hide_icon"] = false,
					["toolbar_side"] = 1,
					["bg_g"] = 0.2352,
					["menu_icons_alpha"] = 0.92,
					["bg_b"] = 0.2588,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.1215, -- [1]
						0.1176, -- [2]
						0.1294, -- [3]
						0.91, -- [4]
					},
					["hide_on_context"] = {
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [1]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [2]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [3]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [4]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [5]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [6]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [7]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [8]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [9]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [10]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [11]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [12]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [13]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [14]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [15]
					},
					["switch_all_roles_after_wipe"] = false,
					["menu_icons_color"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
					},
					["bars_inverted"] = false,
					["skin"] = "Minimalistic",
					["fontstrings_text3_anchor"] = 38,
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["stretch_button_side"] = 1,
					["switch_healer"] = false,
					["fontstrings_text2_anchor"] = 73,
					["backdrop_texture"] = "Details Ground",
					["fontstrings_text_limit_offset"] = -10,
					["fullborder_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						1, -- [4]
					},
					["attribute_text"] = {
						["enabled"] = true,
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 12,
						["custom_text"] = "{name}",
						["show_timer_arena"] = true,
						["text_face"] = "Accidental Presidency",
						["show_timer_always"] = true,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = {
							1.4, -- [1]
							2, -- [2]
						},
						["show_timer"] = true,
						["enable_custom_text"] = false,
						["show_timer_bg"] = true,
					},
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["StatusBarSaved"] = {
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textYMod"] = 1,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 3,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 0,
								["textStyle"] = 2,
								["textAlign"] = 1,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textYMod"] = 1,
								["textXMod"] = 6,
								["textFace"] = "Accidental Presidency",
								["timeType"] = 1,
								["textStyle"] = 2,
								["textAlign"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
						},
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
					},
					["fullborder_shown"] = false,
					["clickthrough_window"] = false,
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["version"] = 3,
					["fontstrings_text4_anchor"] = 0,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["show_statusbar"] = false,
					["micro_displays_locked"] = true,
					["bg_alpha"] = 0.6,
					["rowareaborder_size"] = 0.5,
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["skin_custom"] = "",
					["hide_in_combat_alpha"] = 0,
					["switch_damager_in_combat"] = false,
					["rounded_corner_enabled"] = false,
					["libwindow"] = {
						["y"] = 5.10624740854837e-05,
						["x"] = 0,
						["point"] = "BOTTOMRIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["row_offsets"] = {
							["top"] = 0,
							["right"] = 0,
							["left"] = 0,
							["bottom"] = 0,
						},
						["textR_outline_small"] = true,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["percent_type"] = 1,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["textL_offset"] = 0,
						["text_yoffset"] = 0,
						["texture_background_class_color"] = false,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["font_face_file"] = "Fonts\\FRIZQT___CYR.TTF",
						["faction_icon_size_offset"] = -10,
						["backdrop"] = {
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
							["enabled"] = false,
							["size"] = 12,
						},
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["font_size"] = 16,
						["start_after_icon"] = true,
						["height"] = 21,
						["textL_translit_text"] = false,
						["texture_custom_file"] = "Interface\\",
						["texture_file"] = "Interface\\AddOns\\Details\\images\\bar_hyanda",
						["icon_size_offset"] = 0,
						["textL_outline_small"] = true,
						["icon_mask"] = "",
						["overlay_color"] = {
							0.7, -- [1]
							0.7, -- [2]
							0.7, -- [3]
							0, -- [4]
						},
						["show_arena_role_icon"] = false,
						["use_spec_icons"] = true,
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textR_enable_custom_text"] = false,
						["textR_bracket"] = "(",
						["texture_custom"] = "",
						["textR_class_colors"] = false,
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["alpha"] = 1,
						["textL_class_colors"] = false,
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "Details Hyanda",
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["overlay_texture"] = "Details D'ictum",
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["arena_role_icon_size_offset"] = -10,
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["show_faction_icon"] = true,
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["textL_enable_custom_text"] = false,
					},
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["strata"] = "LOW",
					["rowareaborder_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						1, -- [4]
					},
					["bars_grow_direction"] = 1,
					["grab_on_top"] = false,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["switch_tank"] = false,
					["auto_current"] = true,
					["switch_tank_in_combat"] = false,
					["desaturated_menu"] = false,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -423.166635274887,
							["x"] = 683.5186767578125,
							["w"] = 150,
							["h"] = 7.000001430511475,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["show_sidebars"] = false,
					["wallpaper"] = {
						["enabled"] = false,
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["level"] = 2,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["titlebar_height"] = 16,
					["__was_opened"] = true,
					["use_multi_fontstrings"] = true,
					["titlebar_texture_color"] = {
						0.2, -- [1]
						0.2, -- [2]
						0.2, -- [3]
						0.8, -- [4]
					},
				}, -- [1]
			},
			["overall_clear_pvp"] = true,
			["overall_clear_newboss"] = true,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["skin"] = "Minimalistic",
			["override_spellids"] = true,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["minimum_combat_time"] = 5,
			["realtimedps_always_arena"] = false,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["overall_clear_logout"] = false,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["chat_tab_embed"] = {
				["enabled"] = false,
				["tab_name"] = "",
				["x_offset"] = 0,
				["y_offset"] = 0,
				["single_window"] = false,
			},
			["deadlog_events"] = 32,
			["default_bg_color"] = 0.0941,
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["SHAMAN"] = {
					0.125, -- [1]
					0.248046875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				["MAGE"] = {
					0.125, -- [1]
					0.248046875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["PET"] = {
					0.125, -- [1]
					0.248046875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["DRUID"] = {
					0.37109375, -- [1]
					0.494140625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["MONK"] = {
					0.25, -- [1]
					0.369140625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				["ROGUE"] = {
					0.248046875, -- [1]
					0.37109375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				["UNKNOW"] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["PRIEST"] = {
					0.248046875, -- [1]
					0.37109375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				["WARLOCK"] = {
					0.37109375, -- [1]
					0.494140625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				["Alliance"] = {
					0.248046875, -- [1]
					0.02968748, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["DEMONHUNTER"] = {
					0.36914063, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				["Horde"] = {
					0.37109375, -- [1]
					0.494140625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["EVOKER"] = {
					0.50390625, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["disable_alldisplays_window"] = false,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["version"] = 1,
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["ARENA_GREEN"] = {
					0.686, -- [1]
					0.372, -- [2]
					0.905, -- [3]
				},
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["EVOKER"] = {
					0.2, -- [1]
					0.5764, -- [2]
					0.498, -- [3]
				},
				["SELF"] = {
					0.89019, -- [1]
					0.32156, -- [2]
					0.89019, -- [3]
				},
			},
			["broadcaster_enabled"] = false,
			["total_abbreviation"] = 2,
			["segments_auto_erase"] = 1,
			["clear_graphic"] = true,
			["trash_auto_remove"] = false,
			["animation_speed_triggertravel"] = 5,
			["options_group_edit"] = true,
			["segments_amount_to_save"] = 40,
			["minimap"] = {
				["minimapPos"] = 51.35765210904506,
				["radius"] = 160,
				["hide"] = false,
				["onclick_what_todo"] = 1,
				["text_format"] = 3,
				["text_type"] = 1,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["memory_threshold"] = 3,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["color_by_arena_team"] = true,
			["use_scroll"] = false,
			["overall_flag"] = 16,
			["segments_panic_mode"] = false,
			["realtimedps_order_bars"] = false,
			["show_arena_role_icon"] = false,
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["numerical_system"] = 1,
			["time_type"] = 2,
			["update_speed"] = 0.2,
			["report_schema"] = 1,
			["numerical_system_symbols"] = "auto",
			["death_tooltip_texture"] = "Details Serenity",
			["disable_reset_button"] = false,
			["data_broker_text"] = "",
			["instances_no_libwindow"] = false,
			["instances_segments_locked"] = true,
			["deadlog_limit"] = 16,
			["death_log_colors"] = {
				["heal"] = "green",
				["buff"] = "silver",
				["friendlyfire"] = "darkorange",
				["debuff"] = "purple",
				["cooldown"] = "yellow",
				["damage"] = "red",
			},
		},
		["Флексотрон-Пламегор"] = {
			["overall_clear_newtorghast"] = true,
			["use_realtimedps"] = false,
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["disable_mythic_dungeon"] = false,
				["use_animation_accel"] = true,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["show_crowdcontrol_pvm"] = false,
				["show_crowdcontrol_pvp"] = true,
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.1921, -- [1]
						0.1921, -- [2]
						0.1921, -- [3]
						0.3869, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[1467] = {
					0.5, -- [1]
					0.625, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[1468] = {
					0.625, -- [1]
					0.75, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[1473] = {
					0.75, -- [1]
					0.875, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
			},
			["all_in_one_windows"] = {
			},
			["tooltip"] = {
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["bar_color"] = {
					0.149, -- [1]
					0.149, -- [2]
					0.149, -- [3]
					0.87, -- [4]
				},
				["tooltip_max_pets"] = 2,
				["abbreviation"] = 2,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["background"] = {
					0.0941, -- [1]
					0.0941, -- [2]
					0.0941, -- [3]
					0.8, -- [4]
				},
				["rounded_corner"] = true,
				["divisor_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["fontshadow"] = false,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 13,
					["H"] = 13,
				},
				["anchor_relative"] = "top",
				["anchored_to"] = 1,
				["fontsize"] = 10,
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["commands"] = {
				},
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["tooltip_max_abilities"] = 8,
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["show_amount"] = false,
				["border_size"] = 14,
				["maximize_method"] = 1,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["icon_border_texcoord"] = {
					["R"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["B"] = 0.921875,
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["pvp_as_group"] = true,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = false,
			["fade_speed"] = 0.15,
			["death_tooltip_spark"] = false,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["use_self_color"] = false,
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["grouping_horizontal_gap"] = 0,
			["profile_save_pos"] = true,
			["default_bg_alpha"] = 0.5,
			["trash_concatenate"] = false,
			["deny_score_messages"] = false,
			["disable_stretch_from_toolbar"] = false,
			["realtime_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = false,
				["frame_settings"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["point"] = "TOP",
					["scale"] = 1,
					["width"] = 300,
					["y"] = -110,
					["x"] = 0,
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = true,
					["height"] = 23,
				},
				["sample_size"] = 3,
				["font_face"] = "Friz Quadrata TT",
				["text_offset"] = 2,
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["animation_speed"] = 33,
			["animate_scroll"] = false,
			["standard_skin"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["use_battleground_server_parser"] = false,
			["death_tooltip_width"] = 350,
			["disable_window_groups"] = false,
			["clear_ungrouped"] = true,
			["force_activity_time_pvp"] = true,
			["instances_suppress_trash"] = 0,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["time_type_original"] = 2,
			["player_details_window"] = {
				["scale"] = 1,
				["skin"] = "ElvUI",
				["bar_texture"] = "Skyline",
			},
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["auto_swap_to_dynamic_overall"] = false,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -404.8951530456543,
							["x"] = -683.5185546875,
							["w"] = 150,
							["h"] = 7.000000953674316,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["hide_in_combat_type"] = 1,
					["menu_icons_size"] = 0.82,
					["titlebar_shown"] = false,
					["menu_anchor"] = {
						20, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.243,
					["fullborder_size"] = 0.5,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons_2_shadow",
					["bars_sort_direction"] = 1,
					["use_auto_align_multi_fontstrings"] = true,
					["rowareaborder_shown"] = false,
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["clickthrough_rows"] = false,
					["titlebar_texture"] = "Details Serenity",
					["ignore_mass_showhide"] = false,
					["plugins_grow_direction"] = 1,
					["icon_desaturated"] = false,
					["switch_damager"] = false,
					["micro_displays_side"] = 2,
					["window_scale"] = 1,
					["attribute_icon_size"] = 0,
					["hide_icon"] = false,
					["toolbar_side"] = 1,
					["bg_g"] = 0.2352,
					["menu_icons_alpha"] = 0.92,
					["bg_b"] = 0.2588,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.1215, -- [1]
						0.1176, -- [2]
						0.1294, -- [3]
						0.91, -- [4]
					},
					["hide_on_context"] = {
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [1]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [2]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [3]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [4]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [5]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [6]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [7]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [8]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [9]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [10]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [11]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [12]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [13]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [14]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [15]
					},
					["switch_all_roles_after_wipe"] = false,
					["backdrop_texture"] = "Details Ground",
					["__was_opened"] = true,
					["skin"] = "Minimalistic",
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["fontstrings_text3_anchor"] = 38,
					["switch_healer"] = false,
					["fontstrings_text2_anchor"] = 73,
					["bars_grow_direction"] = 1,
					["use_multi_fontstrings"] = true,
					["show_sidebars"] = false,
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 3,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 0,
								["textAlign"] = 1,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 6,
								["textAlign"] = 2,
								["textStyle"] = 2,
								["timeType"] = 1,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["attribute_text"] = {
						["enabled"] = true,
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 12,
						["custom_text"] = "{name}",
						["show_timer_arena"] = true,
						["text_face"] = "Accidental Presidency",
						["show_timer_always"] = true,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = {
							1.4, -- [1]
							2, -- [2]
						},
						["show_timer"] = true,
						["enable_custom_text"] = false,
						["show_timer_bg"] = true,
					},
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["version"] = 3,
					["fontstrings_text4_anchor"] = 0,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["desaturated_menu"] = false,
					["show_statusbar"] = false,
					["rowareaborder_size"] = 0.5,
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["micro_displays_locked"] = true,
					["hide_in_combat_alpha"] = 0,
					["switch_tank"] = false,
					["rounded_corner_enabled"] = false,
					["libwindow"] = {
						["y"] = 18.27153396606445,
						["x"] = 0,
						["point"] = "BOTTOMLEFT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["skin_custom"] = "",
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["rowareaborder_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						1, -- [4]
					},
					["strata"] = "LOW",
					["row_info"] = {
						["show_arena_role_icon"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["row_offsets"] = {
							["top"] = 0,
							["right"] = 0,
							["left"] = 0,
							["bottom"] = 0,
						},
						["textR_outline_small"] = true,
						["textL_outline_small"] = true,
						["percent_type"] = 1,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["textL_offset"] = 0,
						["text_yoffset"] = 0,
						["texture_background_class_color"] = false,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["font_face_file"] = "Fonts\\FRIZQT___CYR.TTF",
						["faction_icon_size_offset"] = -10,
						["textL_enable_custom_text"] = false,
						["backdrop"] = {
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
							["enabled"] = false,
							["size"] = 12,
						},
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["font_size"] = 16,
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["show_faction_icon"] = true,
						["textL_translit_text"] = false,
						["height"] = 21,
						["texture_file"] = "Interface\\AddOns\\Details\\images\\bar_hyanda",
						["icon_size_offset"] = 0,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["icon_mask"] = "",
						["overlay_color"] = {
							0.7, -- [1]
							0.7, -- [2]
							0.7, -- [3]
							0, -- [4]
						},
						["arena_role_icon_size_offset"] = -10,
						["use_spec_icons"] = true,
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textR_enable_custom_text"] = false,
						["textR_bracket"] = "(",
						["texture_custom"] = "",
						["texture_background"] = "Details D'ictum (reverse)",
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["alpha"] = 1,
						["textR_class_colors"] = false,
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "Details Hyanda",
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["overlay_texture"] = "Details D'ictum",
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textL_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["textR_outline"] = false,
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["start_after_icon"] = true,
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["texture_custom_file"] = "Interface\\",
					},
					["grab_on_top"] = false,
					["bg_alpha"] = 0.6,
					["switch_tank_in_combat"] = false,
					["auto_current"] = true,
					["clickthrough_window"] = false,
					["switch_damager_in_combat"] = false,
					["fullborder_shown"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -404.8951530456543,
							["x"] = -683.5185546875,
							["w"] = 150,
							["h"] = 7.000000953674316,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["fullborder_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						1, -- [4]
					},
					["fontstrings_text_limit_offset"] = -10,
					["wallpaper"] = {
						["enabled"] = false,
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["level"] = 2,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["stretch_button_side"] = 1,
					["titlebar_height"] = 16,
					["bars_inverted"] = false,
					["menu_icons_color"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
					},
					["titlebar_texture_color"] = {
						0.2, -- [1]
						0.2, -- [2]
						0.2, -- [3]
						0.8, -- [4]
					},
				}, -- [1]
			},
			["report_lines"] = 5,
			["segments_amount"] = 40,
			["overall_clear_pvp"] = true,
			["overall_clear_newboss"] = true,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["skin"] = "Minimalistic",
			["override_spellids"] = true,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["realtimedps_always_arena"] = false,
			["minimum_combat_time"] = 5,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["overall_clear_logout"] = false,
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["memory_threshold"] = 3,
			["deadlog_events"] = 32,
			["default_bg_color"] = 0.0941,
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["SHAMAN"] = {
					0.125, -- [1]
					0.248046875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				["MAGE"] = {
					0.125, -- [1]
					0.248046875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["PET"] = {
					0.125, -- [1]
					0.248046875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["DRUID"] = {
					0.37109375, -- [1]
					0.494140625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["MONK"] = {
					0.25, -- [1]
					0.369140625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["ROGUE"] = {
					0.248046875, -- [1]
					0.37109375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["UNKNOW"] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["PRIEST"] = {
					0.248046875, -- [1]
					0.37109375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["Alliance"] = {
					0.248046875, -- [1]
					0.02968748, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["WARLOCK"] = {
					0.37109375, -- [1]
					0.494140625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				["DEMONHUNTER"] = {
					0.36914063, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				["Horde"] = {
					0.37109375, -- [1]
					0.494140625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				["EVOKER"] = {
					0.50390625, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["total_abbreviation"] = 2,
			["disable_alldisplays_window"] = false,
			["trash_auto_remove"] = false,
			["broadcaster_enabled"] = false,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["segments_auto_erase"] = 1,
			["clear_graphic"] = true,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["ARENA_GREEN"] = {
					0.686, -- [1]
					0.372, -- [2]
					0.905, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["version"] = 1,
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["EVOKER"] = {
					0.2, -- [1]
					0.5764, -- [2]
					0.498, -- [3]
				},
				["SELF"] = {
					0.89019, -- [1]
					0.32156, -- [2]
					0.89019, -- [3]
				},
			},
			["animation_speed_triggertravel"] = 5,
			["options_group_edit"] = true,
			["segments_amount_to_save"] = 40,
			["minimap"] = {
				["minimapPos"] = 304.3743377528688,
				["radius"] = 160,
				["hide"] = false,
				["onclick_what_todo"] = 1,
				["text_format"] = 3,
				["text_type"] = 1,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["chat_tab_embed"] = {
				["enabled"] = false,
				["tab_name"] = "",
				["x_offset"] = 0,
				["y_offset"] = 0,
				["single_window"] = false,
			},
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["color_by_arena_team"] = true,
			["use_scroll"] = false,
			["overall_flag"] = 16,
			["segments_panic_mode"] = false,
			["realtimedps_order_bars"] = false,
			["show_arena_role_icon"] = false,
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["numerical_system"] = 1,
			["time_type"] = 2,
			["update_speed"] = 0.2,
			["report_schema"] = 1,
			["numerical_system_symbols"] = "auto",
			["death_tooltip_texture"] = "Details Serenity",
			["disable_reset_button"] = false,
			["data_broker_text"] = "",
			["instances_no_libwindow"] = false,
			["instances_segments_locked"] = true,
			["deadlog_limit"] = 16,
			["death_log_colors"] = {
				["heal"] = "green",
				["buff"] = "silver",
				["friendlyfire"] = "darkorange",
				["debuff"] = "purple",
				["cooldown"] = "yellow",
				["damage"] = "red",
			},
		},
	},
	["immersion_special_units"] = true,
	["plater"] = {
		["realtime_dps_enabled"] = false,
		["realtime_dps_size"] = 12,
		["realtime_dps_player_shadow"] = true,
		["realtime_dps_player_enabled"] = false,
		["realtime_dps_player_size"] = 12,
		["damage_taken_size"] = 12,
		["realtime_dps_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["damage_taken_shadow"] = true,
		["damage_taken_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_player_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["damage_taken_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["damage_taken_enabled"] = false,
		["realtime_dps_shadow"] = true,
	},
	["boss_mods_timers"] = {
		["encounter_timers_bw"] = {
		},
		["latest_boss_mods_access"] = 1715417907,
		["encounter_timers_dbm"] = {
			["nil"] = {
				"nil", -- [1]
				"DBMLFGTimer", -- [2]
				"Приглашение в подземелье", -- [3]
				40, -- [4]
				"237538", -- [5]
				"extratimer", -- [6]
				nil, -- [7]
				0, -- [8]
				["id"] = 369,
			},
		},
	},
	["check_stuttering"] = false,
	["latest_spell_pool_access"] = 1715417907,
	["played_class_time"] = true,
	["details_auras"] = {
	},
	["class_time_played"] = {
		[3] = {
			["DRUID"] = 155004.3500000003,
			["PALADIN"] = 1979.184999999998,
			["PRIEST"] = 61967.29900000012,
		},
	},
	["report_where"] = "SAY",
	["frame_background_color"] = {
		0.1215, -- [1]
		0.1176, -- [2]
		0.1294, -- [3]
		0.8, -- [4]
	},
	["slash_me_used"] = false,
	["show_warning_id1"] = true,
	["spell_category_latest_save"] = 0,
	["run_code"] = {
		["on_groupchange"] = "\n-- this code runs when the player enter or leave a group",
		["on_zonechanged"] = "\n-- when the player changes zone, this code will run",
		["on_init"] = "\n-- code to run when Details! initializes, put here code which only will run once\n-- this also will run then the profile is changed\n\n--size of the death log tooltip in the Deaths display (default 350)\nDetails.death_tooltip_width = 350;\n\n--when in arena or battleground, details! silently switch to activity time (goes back to the old setting on leaving, default true)\nDetails.force_activity_time_pvp = true;\n\n--speed of the bar animations (default 33)\nDetails.animation_speed = 33;\n\n--threshold to trigger slow or fast speed (default 0.45)\nDetails.animation_speed_mintravel = 0.45;\n\n--call to update animations\nDetails:RefreshAnimationFunctions();\n\n--max window size, does require a /reload to work (default 480 x 450)\nDetails.max_window_size.width = 480;\nDetails.max_window_size.height = 450;\n\n--use the arena team color as the class color (default true)\nDetails.color_by_arena_team = true;\n\n--how much time the update warning is shown (default 10)\nDetails.update_warning_timeout = 10;",
		["on_specchanged"] = "\n-- run when the player changes its spec",
		["on_leavecombat"] = "\n-- this code runs when the player leave combat",
		["on_entercombat"] = "\n-- this code runs when the player enters in combat",
	},
	["latest_npcid_pool_access"] = 1715417907,
	["exit_errors"] = {
		"Saving Profile | 2024-05-12 13:20:43 | VWD 12044 RELEASE 4.4.0 | Interface/AddOns/Details/functions/profiles.lua:536: bad argument #1 to 'ipairs' (table expected, got nil) | [string \"@Interface/AddOns/Details/core/parser.lua\"]:6290: in function <Interface/AddOns/Details/core/parser.lua:6288>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6294: in function <Interface/AddOns/Details/core/parser.lua:6287>\n[string \"=[C]\"]: in function `ipairs'\n[string \"@Interface/AddOns/Details/functions/profiles.lua\"]:536: in function <Interface/AddOns/Details/functions/profiles.lua:505>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6360: in function <Interface/AddOns/Details/core/parser.lua:6246>\n", -- [1]
		"Saving Config | 2024-05-12 13:20:43 | VWD 12044 RELEASE 4.4.0 | Interface/AddOns/Details/classes/class_instance.lua:690: bad argument #1 to 'ipairs' (table expected, got nil) | [string \"@Interface/AddOns/Details/core/parser.lua\"]:6290: in function <Interface/AddOns/Details/core/parser.lua:6288>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6294: in function <Interface/AddOns/Details/core/parser.lua:6287>\n[string \"=[C]\"]: ?\n[string \"@Interface/AddOns/Details/classes/class_instance.lua\"]:690: in function `ListInstances'\n[string \"@Interface/AddOns/Details/functions/savedata.lua\"]:34: in function `SaveLocalInstanceConfig'\n[string \"@Interface/AddOns/Details/functions/savedata.lua\"]:83: in function <Interface/AddOns/Details/functions/savedata.lua:81>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6356: in function <Interface/AddOns/Details/core/parser.lua:6246>\n", -- [2]
		"not _detalhes.tabela_instancias", -- [3]
		"Saving Profile | 2024-05-11 18:09:08 | VWD 12044 RELEASE 4.4.0 | Interface/AddOns/Details/functions/profiles.lua:536: bad argument #1 to 'ipairs' (table expected, got nil) | [string \"@Interface/AddOns/Details/core/parser.lua\"]:6290: in function <Interface/AddOns/Details/core/parser.lua:6288>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6294: in function <Interface/AddOns/Details/core/parser.lua:6287>\n[string \"=[C]\"]: in function `ipairs'\n[string \"@Interface/AddOns/Details/functions/profiles.lua\"]:536: in function <Interface/AddOns/Details/functions/profiles.lua:505>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6360: in function <Interface/AddOns/Details/core/parser.lua:6246>\n", -- [4]
		"Saving Config | 2024-05-11 18:09:08 | VWD 12044 RELEASE 4.4.0 | Interface/AddOns/Details/classes/class_instance.lua:690: bad argument #1 to 'ipairs' (table expected, got nil) | [string \"@Interface/AddOns/Details/core/parser.lua\"]:6290: in function <Interface/AddOns/Details/core/parser.lua:6288>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6294: in function <Interface/AddOns/Details/core/parser.lua:6287>\n[string \"=[C]\"]: ?\n[string \"@Interface/AddOns/Details/classes/class_instance.lua\"]:690: in function `ListInstances'\n[string \"@Interface/AddOns/Details/functions/savedata.lua\"]:34: in function `SaveLocalInstanceConfig'\n[string \"@Interface/AddOns/Details/functions/savedata.lua\"]:83: in function <Interface/AddOns/Details/functions/savedata.lua:81>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6356: in function <Interface/AddOns/Details/core/parser.lua:6246>\n", -- [5]
		"not _detalhes.tabela_instancias", -- [6]
		"Saving Profile | 2024-05-11 12:05:34 | VWD 12044 RELEASE 4.4.0 | Interface/AddOns/Details/functions/profiles.lua:536: bad argument #1 to 'ipairs' (table expected, got nil) | [string \"@Interface/AddOns/Details/core/parser.lua\"]:6290: in function <Interface/AddOns/Details/core/parser.lua:6288>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6294: in function <Interface/AddOns/Details/core/parser.lua:6287>\n[string \"=[C]\"]: in function `ipairs'\n[string \"@Interface/AddOns/Details/functions/profiles.lua\"]:536: in function <Interface/AddOns/Details/functions/profiles.lua:505>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6360: in function <Interface/AddOns/Details/core/parser.lua:6246>\n", -- [7]
		"Saving Config | 2024-05-11 12:05:34 | VWD 12044 RELEASE 4.4.0 | Interface/AddOns/Details/classes/class_instance.lua:690: bad argument #1 to 'ipairs' (table expected, got nil) | [string \"@Interface/AddOns/Details/core/parser.lua\"]:6290: in function <Interface/AddOns/Details/core/parser.lua:6288>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6294: in function <Interface/AddOns/Details/core/parser.lua:6287>\n[string \"=[C]\"]: ?\n[string \"@Interface/AddOns/Details/classes/class_instance.lua\"]:690: in function `ListInstances'\n[string \"@Interface/AddOns/Details/functions/savedata.lua\"]:34: in function `SaveLocalInstanceConfig'\n[string \"@Interface/AddOns/Details/functions/savedata.lua\"]:83: in function <Interface/AddOns/Details/functions/savedata.lua:81>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6356: in function <Interface/AddOns/Details/core/parser.lua:6246>\n", -- [8]
		"not _detalhes.tabela_instancias", -- [9]
	},
	["realm_sync"] = true,
	["spellid_ignored"] = {
	},
	["createauraframe"] = {
	},
	["data_wipes_exp"] = {
		["9"] = false,
		["14"] = false,
		["13"] = false,
		["12"] = false,
		["11"] = false,
		["10"] = false,
	},
	["item_level_pool"] = {
		["Player-4474-05699A49"] = {
			["time"] = 1716219701,
			["name"] = "Критмаз",
			["ilvl"] = 27,
		},
		["Player-4474-05755D00"] = {
			["time"] = 1716219624,
			["name"] = "Тисоночка",
			["ilvl"] = 63,
		},
		["Player-4474-056F18BF"] = {
			["name"] = "Чарджеслав",
			["time"] = 1716204619,
			["ilvl"] = 28,
		},
		["Player-4474-05632424"] = {
			["time"] = 1716205556,
			["name"] = "Эллк",
			["ilvl"] = 161,
		},
		["Player-4474-036B462F"] = {
			["time"] = 1716206617,
			["name"] = "Триксес",
			["ilvl"] = 152,
		},
		["Player-4474-05628D72"] = {
			["time"] = 1716205556,
			["name"] = "Пвемутант",
			["ilvl"] = 136,
		},
		["Player-4474-0570D6B0"] = {
			["time"] = 1716206617,
			["name"] = "Рамбобес",
			["ilvl"] = 152,
		},
		["Player-4474-029CA104"] = {
			["time"] = 1716205556,
			["name"] = "Копуша",
			["ilvl"] = 163,
		},
		["Player-4474-057004D5"] = {
			["time"] = 1716219644,
			["name"] = "Асквес",
			["ilvl"] = 72,
		},
		["Player-4474-05399267"] = {
			["name"] = "Поннитейл",
			["time"] = 1716204316,
			["ilvl"] = 31,
		},
		["Player-4474-054100F6"] = {
			["time"] = 1716206608,
			["name"] = "Лагрож",
			["ilvl"] = 106,
		},
		["Player-4474-056ED0D1"] = {
			["name"] = "Абенд",
			["time"] = 1716204630,
			["ilvl"] = 27,
		},
		["Player-4474-02F8B9D2"] = {
			["time"] = 1716206617,
			["name"] = "Гравви",
			["ilvl"] = 145,
		},
		["Player-4474-036F09A7"] = {
			["time"] = 1716219673,
			["name"] = "Энилин",
			["ilvl"] = 63,
		},
		["Player-4474-057006DB"] = {
			["name"] = "Мейкан",
			["time"] = 1716204347,
			["ilvl"] = 30,
		},
		["Player-4474-05516371"] = {
			["name"] = "Алёшакотик",
			["time"] = 1716204289,
			["ilvl"] = 35,
		},
		["Player-4474-0357E13D"] = {
			["time"] = 1716219701,
			["name"] = "Флексотрон",
			["ilvl"] = 91,
		},
	},
	["spell_category_latest_query"] = 0,
	["tutorial"] = {
		["unlock_button"] = 0,
		["main_help_button"] = 49,
		["logons"] = 49,
		["version_announce"] = 0,
		["MIN_COMBAT_TIME"] = true,
		["ctrl_click_close_tutorial"] = false,
		["alert_frames"] = {
			false, -- [1]
			false, -- [2]
			false, -- [3]
			false, -- [4]
			false, -- [5]
			false, -- [6]
		},
		["bookmark_tutorial"] = false,
	},
	["switchSaved"] = {
		["slots"] = 6,
		["table"] = {
			{
				["atributo"] = 1,
				["sub_atributo"] = 1,
			}, -- [1]
			{
				["atributo"] = 2,
				["sub_atributo"] = 1,
			}, -- [2]
			{
				["atributo"] = 1,
				["sub_atributo"] = 6,
			}, -- [3]
			{
				["atributo"] = 4,
				["sub_atributo"] = 5,
			}, -- [4]
			{
			}, -- [5]
			{
			}, -- [6]
		},
	},
	["show_totalhitdamage_on_overkill"] = false,
	["aura_tracker_frame"] = {
		["position"] = {
		},
		["scaletable"] = {
			["scale"] = 1,
		},
	},
	["mythic_plus"] = {
		["make_overall_boss_only"] = false,
		["mythicrun_chart_frame_ready"] = {
		},
		["merge_boss_trash"] = true,
		["delay_to_show_graphic"] = 10,
		["mythicrun_time_type"] = 1,
		["finished_run_frame"] = {
		},
		["make_overall_when_done"] = true,
		["reverse_death_log"] = false,
		["show_damage_graphic"] = true,
		["mythicrun_chart_frame_minimized"] = {
		},
		["boss_dedicated_segment"] = true,
		["mythicrun_chart_frame"] = {
		},
		["last_mythicrun_chart"] = {
		},
	},
	["savedStyles"] = {
	},
	["always_use_profile_exception"] = {
	},
	["merge_player_abilities"] = false,
	["parser_options"] = {
		["energy_overflow"] = false,
		["shield_overheal"] = false,
	},
	["savedTimeCaptures"] = {
	},
	["spell_category_savedtable"] = {
	},
	["damage_scroll_position"] = {
		["scale"] = 1,
	},
	["performance_profiles"] = {
		["Dungeon"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["aura"] = true,
			["miscdata"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["RaidFinder"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["aura"] = true,
			["miscdata"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["aura"] = true,
			["miscdata"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["aura"] = true,
			["miscdata"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Mythic"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["aura"] = true,
			["miscdata"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Arena"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["aura"] = true,
			["miscdata"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid30"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["aura"] = true,
			["miscdata"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground40"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["aura"] = true,
			["miscdata"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
	},
	["exit_log"] = {
		"1 - Closing Breakdown Window.", -- [1]
		"2 - Clearing user placed position from instance windows.", -- [2]
		"  - 1 has baseFrame: yes.", -- [3]
		"4 - Reversing switches.", -- [4]
		"6 - Saving Config.", -- [5]
		"7 - Saving Profiles.", -- [6]
		"8 - Saving nicktag cache.", -- [7]
		"9 - Saving Auto Run Code.", -- [8]
	},
	["installed_skins_cache"] = {
	},
	["update_warning_timeout"] = 10,
	["deathlog_line_height"] = 16,
}
__details_backup = {
	["_instance_backup"] = {
	},
	["_general_logs"] = {
		"2024-05-20 17:17:57 | actor removed Мир (огонь) (ungrouped)", -- [1]
		"2024-05-20 16:13:38 | actor removed Покусает (ungrouped)", -- [2]
		"2024-05-20 16:13:38 | actor removed Гамаржобакен (ungrouped)", -- [3]
		"2024-05-20 16:13:38 | actor removed Палвейдер (ungrouped)", -- [4]
		"2024-05-20 16:13:38 | actor removed Отвечаювар (ungrouped)", -- [5]
		"2024-05-20 16:13:38 | actor removed Ривенрай (ungrouped)", -- [6]
		"2024-05-20 16:13:38 | actor removed Скуфпотаскун (ungrouped)", -- [7]
		"2024-05-20 16:13:38 | actor removed Мишкабекес (ungrouped)", -- [8]
		"2024-05-20 16:13:38 | actor removed Скуфпотаскун (ungrouped)", -- [9]
		"2024-05-20 16:13:38 | actor removed Жаяна (ungrouped)", -- [10]
		"2024-05-20 16:13:38 | actor removed Гамаржобакен (ungrouped)", -- [11]
		"2024-05-20 16:13:38 | actor removed Фазузу (ungrouped)", -- [12]
		"2024-05-20 16:13:38 | actor removed Бзк (ungrouped)", -- [13]
		"2024-05-20 16:13:38 | actor removed Фишфаер (ungrouped)", -- [14]
		"2024-05-20 16:13:38 | actor removed Ботлсветлого (ungrouped)", -- [15]
		"2024-05-20 16:13:38 | actor removed Отвечаювар (ungrouped)", -- [16]
		"2024-05-20 14:31:56 | actor removed Мёртво (ungrouped)", -- [17]
		"2024-05-20 14:31:56 | actor removed Мёртво (ungrouped)", -- [18]
		"2024-05-20 14:31:56 | actor removed Мёртво (ungrouped)", -- [19]
		"2024-05-20 14:31:56 | actor removed Мёртво (ungrouped)", -- [20]
		"2024-05-20 14:31:56 | actor removed Мёртво (ungrouped)", -- [21]
		"2024-05-20 14:31:56 | actor removed Горбайло (ungrouped)", -- [22]
		"2024-05-20 14:31:56 | actor removed Горбайло (ungrouped)", -- [23]
		"2024-05-20 14:31:56 | actor removed Мёртво (ungrouped)", -- [24]
		"2024-05-20 14:31:56 | actor removed Горбайло (ungrouped)", -- [25]
		"2024-05-20 14:31:56 | actor removed Нникс (ungrouped)", -- [26]
		"2024-05-20 14:31:56 | actor removed Пайрос (ungrouped)", -- [27]
		"2024-05-20 14:31:56 | actor removed Чсвнаваре (ungrouped)", -- [28]
		"2024-05-20 14:31:56 | actor removed Зулексс (ungrouped)", -- [29]
	},
	["_exit_error"] = {
		"2024-05-12 13:20:43 | Saving Profile | 2024-05-12 13:20:43 | VWD 12044 RELEASE 4.4.0 | Interface/AddOns/Details/functions/profiles.lua:536: bad argument #1 to 'ipairs' (table expected, got nil) | [string \"@Interface/AddOns/Details/core/parser.lua\"]:6292: in function <Interface/AddOns/Details/core/parser.lua:6288>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6294: in function <Interface/AddOns/Details/core/parser.lua:6287>\n[string \"=[C]\"]: in function `ipairs'\n[string \"@Interface/AddOns/Details/functions/profiles.lua\"]:536: in function <Interface/AddOns/Details/functions/profiles.lua:505>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6360: in function <Interface/AddOns/Details/core/parser.lua:6246>\n", -- [1]
		"2024-05-12 13:20:43 | Saving Config | 2024-05-12 13:20:43 | VWD 12044 RELEASE 4.4.0 | Interface/AddOns/Details/classes/class_instance.lua:690: bad argument #1 to 'ipairs' (table expected, got nil) | [string \"@Interface/AddOns/Details/core/parser.lua\"]:6292: in function <Interface/AddOns/Details/core/parser.lua:6288>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6294: in function <Interface/AddOns/Details/core/parser.lua:6287>\n[string \"=[C]\"]: ?\n[string \"@Interface/AddOns/Details/classes/class_instance.lua\"]:690: in function `ListInstances'\n[string \"@Interface/AddOns/Details/functions/savedata.lua\"]:34: in function `SaveLocalInstanceConfig'\n[string \"@Interface/AddOns/Details/functions/savedata.lua\"]:83: in function <Interface/AddOns/Details/functions/savedata.lua:81>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6356: in function <Interface/AddOns/Details/core/parser.lua:6246>\n", -- [2]
		"2024-05-12 13:20:43 | not _detalhes.tabela_instancias | VWD 12044 RELEASE 4.4.0", -- [3]
		"2024-05-11 18:09:08 | Saving Profile | 2024-05-11 18:09:08 | VWD 12044 RELEASE 4.4.0 | Interface/AddOns/Details/functions/profiles.lua:536: bad argument #1 to 'ipairs' (table expected, got nil) | [string \"@Interface/AddOns/Details/core/parser.lua\"]:6292: in function <Interface/AddOns/Details/core/parser.lua:6288>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6294: in function <Interface/AddOns/Details/core/parser.lua:6287>\n[string \"=[C]\"]: in function `ipairs'\n[string \"@Interface/AddOns/Details/functions/profiles.lua\"]:536: in function <Interface/AddOns/Details/functions/profiles.lua:505>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6360: in function <Interface/AddOns/Details/core/parser.lua:6246>\n", -- [4]
		"2024-05-11 18:09:08 | Saving Config | 2024-05-11 18:09:08 | VWD 12044 RELEASE 4.4.0 | Interface/AddOns/Details/classes/class_instance.lua:690: bad argument #1 to 'ipairs' (table expected, got nil) | [string \"@Interface/AddOns/Details/core/parser.lua\"]:6292: in function <Interface/AddOns/Details/core/parser.lua:6288>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6294: in function <Interface/AddOns/Details/core/parser.lua:6287>\n[string \"=[C]\"]: ?\n[string \"@Interface/AddOns/Details/classes/class_instance.lua\"]:690: in function `ListInstances'\n[string \"@Interface/AddOns/Details/functions/savedata.lua\"]:34: in function `SaveLocalInstanceConfig'\n[string \"@Interface/AddOns/Details/functions/savedata.lua\"]:83: in function <Interface/AddOns/Details/functions/savedata.lua:81>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6356: in function <Interface/AddOns/Details/core/parser.lua:6246>\n", -- [5]
		"2024-05-11 18:09:08 | not _detalhes.tabela_instancias | VWD 12044 RELEASE 4.4.0", -- [6]
		"2024-05-11 12:05:34 | Saving Profile | 2024-05-11 12:05:34 | VWD 12044 RELEASE 4.4.0 | Interface/AddOns/Details/functions/profiles.lua:536: bad argument #1 to 'ipairs' (table expected, got nil) | [string \"@Interface/AddOns/Details/core/parser.lua\"]:6292: in function <Interface/AddOns/Details/core/parser.lua:6288>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6294: in function <Interface/AddOns/Details/core/parser.lua:6287>\n[string \"=[C]\"]: in function `ipairs'\n[string \"@Interface/AddOns/Details/functions/profiles.lua\"]:536: in function <Interface/AddOns/Details/functions/profiles.lua:505>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6360: in function <Interface/AddOns/Details/core/parser.lua:6246>\n", -- [7]
		"2024-05-11 12:05:34 | Saving Config | 2024-05-11 12:05:34 | VWD 12044 RELEASE 4.4.0 | Interface/AddOns/Details/classes/class_instance.lua:690: bad argument #1 to 'ipairs' (table expected, got nil) | [string \"@Interface/AddOns/Details/core/parser.lua\"]:6292: in function <Interface/AddOns/Details/core/parser.lua:6288>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6294: in function <Interface/AddOns/Details/core/parser.lua:6287>\n[string \"=[C]\"]: ?\n[string \"@Interface/AddOns/Details/classes/class_instance.lua\"]:690: in function `ListInstances'\n[string \"@Interface/AddOns/Details/functions/savedata.lua\"]:34: in function `SaveLocalInstanceConfig'\n[string \"@Interface/AddOns/Details/functions/savedata.lua\"]:83: in function <Interface/AddOns/Details/functions/savedata.lua:81>\n[string \"=[C]\"]: in function `xpcall'\n[string \"@Interface/AddOns/Details/core/parser.lua\"]:6356: in function <Interface/AddOns/Details/core/parser.lua:6246>\n", -- [8]
		"2024-05-11 12:05:34 | not _detalhes.tabela_instancias | VWD 12044 RELEASE 4.4.0", -- [9]
	},
}
__details_debug = {
}
